{
  "data_source": "https://www.energy.gov/femp/demand-response-and-time-variable-pricing-programs-search",
  "scraped_at": "2025-10-11T10:30:31.757017",
  "total_programs": 122,
  "programs": [
    {
      "state": "Alabama",
      "utility _name": "Tennessee Valley Authority (TVA)",
      "program_name": "<a href=\"https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The TVA-Enel X Demand Response Program provides payments to participants in exchange for their agreement to reduce electricity consumption with 30 minutes notice during times of exceptionally high demand. Demand response events may occur between 5 A.M. and 8 P.M. Enel X collaborates with customers to create an optimal demand reduction plan. Interested customers should contact their local electricity distributor.",
      "keywords": ""
    },
    {
      "state": "Arizona",
      "utility _name": "Arizona Public Service (APS)",
      "program_name": "<a href=\"https://cpowerenergy.com/aps/\">Peak Solutions</a>",
      "hidden_program_name": "Peak Solutions",
      "hidden_program_link": "https://cpowerenergy.com/aps/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Arizona Public Service Company (APS) offers the Peak Solutions demand response program to its commercial and industrial customers. The program is offered through CPower and allows customers to earn revenue for being available to curtail load on short notice when the grid is stressed. The program has two categories: APS Peak Solutions Day Of and APS Peak Solutions Day Ahead. For the Day Of program, APS provides 60 minutes notice prior to an interruption. The program runs from June 1 – September 30, and events can be called anytime between 4 and 9 P.M. Events last anywhere from 1-5 hours on a maximum of three consecutive days. Capacity and energy payments of $40 per kW and $0.09 per kWh, respectively, are paid to customers for reducing their energy consumption. There are no penalties for failing to respond to called events. The main differences between the two program categories is that for the Day Ahead program, customers receive notifications by 12pm (noon) the day before the event, and are compensated $32 per kW capacity instead of $40 per kW. CPower helps with registration and offers onsite facility assessments of curtailment oppoortiunities.",
      "keywords": ""
    },
    {
      "state": "Arizona",
      "utility _name": "Tucson Electric Power",
      "program_name": "<a href=\"https://www.tep.com/smart-demand-response/\">Smart Demand Response (SmartDR) Program</a>",
      "hidden_program_name": "Smart Demand Response (SmartDR) Program",
      "hidden_program_link": "https://www.tep.com/smart-demand-response/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Tucson Electric Power's (TEP's) Smart Demand Response (SmartDR) Program offers large commercial and industrial customers the opportunity to reduce energy costs by reducing energy use at times of high demand. The program provides quarterly bill credits to customers who agree to be notified by TEP during high demand events and asked to reduce their energy use according to an \"energy reduction plan,\" which they design in collaboration with TEP. For more information, contact TEP's Commercial Energy Solutions department at 520-745-3425 or smartdr@tep.com.",
      "keywords": ""
    },
    {
      "state": "Arkansas",
      "utility _name": "Entergy Arkansas",
      "program_name": "<a href=\"https://www.entergy-arkansas.com/your_home/save_money/ee/thermostat/\">Smart Direct Load Control Pilot Program</a>",
      "hidden_program_name": "Smart Direct Load Control Pilot Program",
      "hidden_program_link": "https://www.entergy-arkansas.com/your_home/save_money/ee/thermostat/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Small commercial customers are eligible to participate in Entergy Arkansas' Smart Direct Load Control Pilot Program and save money through the installation of an advanced smart thermostat installed by Entergy at no additional cost to the customer. Customers will save money when Entergy sends a signal to the enrolled thermostat to automatically adjust the temperature by two to four degrees on days when electricity demand is highest. Events are called between 12 and 7 P.M. from June 1 to September 30. Customers may receive an annual enrollment incentive of up to $100.",
      "keywords": ""
    },
    {
      "state": "Arkansas",
      "utility _name": "Entergy Arkansas",
      "program_name": "<a href=\"https://www.entergy-arkansas.com/your_business/save_money/ee/agricultural-irrigation/\">Agricultural Irrigation Load Control Program</a>",
      "hidden_program_name": "Agricultural Irrigation Load Control Program",
      "hidden_program_link": "https://www.entergy-arkansas.com/your_business/save_money/ee/agricultural-irrigation/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Agricultural customers can enroll in Entergy's Agricultural Irrigation Load Control Program and reduce energy costs through demand reductions. At no cost to the customer, Entergy will install load control equipment to each participating irrigation pump and allow the utility to shut off irrigation pumps during times of high electricity demand. Customers will receive on average $100 per month for each enrolled pump. Load control events are called only on weekdays during peak demand months from June through August. Power interruptions last no more than four hours and occur between 12 and 9 P.M. Customers can be interrupted a maximum of 15 times per summer period and no more than twice per week",
      "keywords": ""
    },
    {
      "state": "Arkansas",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Arkansas",
      "utility _name": "Southwestern Electric Power Company (SWEPCO)",
      "program_name": "<a href=\"https://www.swepcosavings.com/#/commercial/load-management\">Load Management Standard Offer Pathway</a>",
      "hidden_program_name": "Load Management Standard Offer Pathway",
      "hidden_program_link": "https://www.swepcosavings.com/#/commercial/load-management",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Southwestern Electric Power Company (SWEPCO)'s Load Management Standard Offer Pathway (SOP) provides incentives to large commercial customers for load curtailment on short notice (as little as one hour) during non-holiday weekday afternoon peak demand periods (between 1 and 7 P.M.) from June 1st through September 30th. Customers are notified at least one hour before an interruption. Curtailment events are limited to a maximum of three weekdays per month, lasting no more than four hours each and for no more than three consecutive days. Participants must have a peak demand of at least 175 kW. Payments are based on verified demand savings.",
      "keywords": ""
    },
    {
      "state": "California",
      "utility _name": "Los Angeles Department of Water and Power",
      "program_name": "<a href=\"https://www.ladwp.com/commercial-services/programs-and-rebates-commercial/demand-response-program\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.ladwp.com/commercial-services/programs-and-rebates-commercial/demand-response-program",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Los Angeles Department of Water and Power (LADWP) offers financial incentives to customers participating in their demand response (DR) program. Customers are eligible to receive two different incentives, one for \"capacity\", another for actual event participation. The event incentives is $0.25/kWh. The capacity incentives is based on committed kW curtailment capacity, with a minimum 50% performance during the DR events. If an event is not called during a given month, capacity incentives are still granted. Customers who select the day-ahead notification option will receive an $8/kW monthly payment, which escalated to a $12/kW in the two-hour advance notification option. Participants must be able to curtail at least 100 kW. LADWP may call a maximum of 12 events per season, with a limit of one event per day, and a maximum of four hours per event. The program applies 1-6 p.m., June 15 to October 15.",
      "keywords": ""
    },
    {
      "state": "California",
      "utility _name": "PG&amp;E",
      "program_name": "<a href=\"https://www.pge.com/en/save-energy-and-money/energy-saving-programs/demand-response-programs/business-programs.html#cbp\">Capacity Bidding Program</a>",
      "hidden_program_name": "Capacity Bidding Program",
      "hidden_program_link": "https://www.pge.com/en/save-energy-and-money/energy-saving-programs/demand-response-programs/business-programs.html#cbp",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Under the Capacity Bidding Program (CBP), PG&amp;E participants receive an incentive for pledging to reduce their energy use by a pre-determined amount in the event a CBP event is call by the utility. The CPB program is an aggregator managed program, meaning customers will enroll in CPB through a third-party aggregators who manages their participations and relays their monthly reduction pledge. There are three program options through the CPB program: prescribed, elect and elect +, event duration for these options lasts between 1-6 hours, 1-8 hours, and 1-24 hours respectively. Program hours are 1-9 P.M., Monday through Friday. No minimum demand load is required for participations. PG&amp;E notifies aggregators of events by 4 P.M. the day before the event. Incentives and non-compliance penalties are aggregator dependent and based on customer/aggregators agreements.",
      "keywords": ""
    },
    {
      "state": "California",
      "utility _name": "Southern California Edison (SCE)",
      "program_name": "<a href=\"https://www.sce.com/business/savings-incentives/demand-response/eligibility\">Optional Binding Mandatory Curtailment Program</a>",
      "hidden_program_name": "Optional Binding Mandatory Curtailment Program",
      "hidden_program_link": "https://www.sce.com/business/savings-incentives/demand-response/eligibility",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "SCE offers the Optional Binding Mandatory Curtailment Program, which provides customers with exemptions from rotating power outages if they can reduce their circuit load during Stage 3 emergencies. Participants must reduce their power consumption by 15% below their established baseline load for the duration of every rotating outage event. The penalty for failure to reduce as requested is $6.00 per kWh for energy use that exceeds an established baseline.",
      "keywords": ""
    },
    {
      "state": "California",
      "utility _name": "Southern California Edison (SCE)",
      "program_name": "<a href=\"https://www.sce.com/business/savings-incentives/summer-discount-plan\">Summer Discount Plan</a>",
      "hidden_program_name": "Summer Discount Plan",
      "hidden_program_link": "https://www.sce.com/business/savings-incentives/summer-discount-plan",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Southern California Edison's (SCE) Summer Discount Plan is a summer air conditioner cycling program for commercial customers. This is a \"direct load control\" program where participants receive a bill credit in return for allowing the utility to cycle air conditioners when needed year-round. Customers can choose among several options regarding the frequency and durations of participation, each with corresponding remuneration levels ranging from $10/yr per unit to $145/yr per unit. Curtailment events can be called year-round any day of the week but occur most often during the summer season.",
      "keywords": ""
    },
    {
      "state": "California",
      "utility _name": "San Diego Gas and Electric (SDGE)",
      "program_name": "<a href=\"https://www.sdge.com/businesses/savings-center/energy-management-programs/demand-response/capacity-bidding-program\">Capacity Bidding Program</a>",
      "hidden_program_name": "Capacity Bidding Program",
      "hidden_program_link": "https://www.sdge.com/businesses/savings-center/energy-management-programs/demand-response/capacity-bidding-program",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Under the Capacity Bidding Program (CBP), SDG&amp;E participants receive a monthly incentive for pledging to reduce their energy by a pre-determined amount in the event a CBP event is called by the utility. Events can be called from 1-9 PM May through October. Events can be scheduled on a day ahead or day of basis and can last from two to four hours. There is a maximum of one event per day and six events per month.  Failure to reduce the pledge amount during an event may result in penalties. Customers typically enroll in CBP through a third-party aggregator / curtailment service provider (CSP), who manages their participation and relays their monthly reduction pledge, which can vary.",
      "keywords": ""
    },
    {
      "state": "Colorado",
      "utility _name": "Colorado Springs Utilities",
      "program_name": "<a href=\"https://www.csu.org/Pages/PeakEnergyRewards.aspx\">Peak Energy Rewards</a>",
      "hidden_program_name": "Peak Energy Rewards",
      "hidden_program_link": "https://www.csu.org/Pages/PeakEnergyRewards.aspx",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Colorado Springs Utilities offers the Peak Energy Rewards Program for customers with a qualifying Wifi connected thermostat. Participation in this program allows the utility to remotely adjust participating customers' thermostats during periods of high energy demand. Events occur from May 1 through September 30th, during these events the temperature will be adjusted no more than four degrees. Thermostats are adjusted for no longer than four hours per event and customers can opt out of the temperature adjustment if they do not want to participate that day. Customers receive a one time bill credit of $50 for every thermostat they register and a $25 bill credit each year they participate in the program.",
      "keywords": ""
    },
    {
      "state": "Colorado",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://co.my.xcelenergy.com/s/business/rate-plans/peak-partner-rewards\">Peak Partner Rewards Program</a>",
      "hidden_program_name": "Peak Partner Rewards Program",
      "hidden_program_link": "https://co.my.xcelenergy.com/s/business/rate-plans/peak-partner-rewards",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Xcel Energy's Peak Partner Rewards program offers customers with as little as 25 kW in reduction capability a monthly credit for reduced electricity use during periods of peak energy demand. Customers can earn $2/kW per month for their committed cuts, as well as $0.70/kWh for actual event participation. Events, of which there can be up to 15 throughout the year, last between one and four hours and take place between 12-8 P.M. on non-holiday, weekdays. Participants must respond with as little as one hour's notice. No more than one curtailment event can be called per day. The initial contract term is 48 months.",
      "keywords": ""
    },
    {
      "state": "Connecticut",
      "utility _name": "Eversource",
      "program_name": "<a href=\"https://www.eversource.com/content/business/save-money-energy/energy-efficiency-programs/demand-response\">ConnectedSolutions</a>",
      "hidden_program_name": "ConnectedSolutions",
      "hidden_program_link": "https://www.eversource.com/content/business/save-money-energy/energy-efficiency-programs/demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Commercial customers of Eversource in Connecticut can participate in the utility's ConnectedSolutions program, either through a curtailment service provider (CSP) or independently. Participating customers are able to receive incentives for reducing their electricity use during peak demand events. Customers have the option to choose to participate in the daily or targeted curtailment options. Daily participants participate in more events creating greater opportunity for incentives while targeted participants participate in fewer events. Daily curtailment participants can earn a $200 per average kW reduction per season and participate in 30-60 events annually. Target dispatch participants can earn a $35 incentive per average kW reduction per season as well as a $10 kW bonus averaged across all weekends. Targeted dispatch participants participate in 3-8 events annually. The event season goes from June 1 to September 30, all events last two-to-three hours and are called between 3 P.M. and 8 P.M. Customers are notified of events at least 24 hours prior.",
      "keywords": ""
    },
    {
      "state": "Florida",
      "utility _name": "Duke Energy",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/backup-generator-program\">Backup Generator Program</a>",
      "hidden_program_name": "Backup Generator Program",
      "hidden_program_link": "https://www.duke-energy.com/business/products/backup-generator-program",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Duke Energy (Duke) offers a Backup Generator program in which customers grant the utility the right to control participants' generators during periods of extreme energy demands. Customers will be notified of events 24 hours prior. Remuneration is based on the capacity of the subscribed generator(s) and the frequency of events.",
      "keywords": ""
    },
    {
      "state": "Florida",
      "utility _name": "Florida Power and Light",
      "program_name": "<a href=\"https://www.fpl.com/rates/retail-tariffs.html\">Commercial Load Control Program</a>",
      "hidden_program_name": "Commercial Load Control Program",
      "hidden_program_link": "https://www.fpl.com/rates/retail-tariffs.html",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Florida Light and Power (FPL) offers the Commercial/Industrial Load Control Program which provides substantial monthly credits to customers that demonstrate the ability to shed at least 200 kW by allowing FPL to install direct load control devices on assorted equipment following a free audit. Credits are awarded regardless of whether FPL initiates a demand event. Advance notice of one hour or more is provided to participants. In the event of an emergency, customers are notified of curtailment events 15 minutes prior. This program is offered to customers in all areas served by the utility. This schedule is currently closed until further notice.",
      "keywords": ""
    },
    {
      "state": "Florida",
      "utility _name": "Florida Power and Light",
      "program_name": "<a href=\"http://www.fpl.com/business/energy_saving/programs/oncall.shtml\">On Call Savings Program</a>",
      "hidden_program_name": "On Call Savings Program",
      "hidden_program_link": "http://www.fpl.com/business/energy_saving/programs/oncall.shtml",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Under the Business On Call® Savings Program, customers agree to let Florida Power and Light (FPL) occasionally cycle their air conditioners during peak demand times (3 to 6 P.M.) and in return receive a monthly bill credit of $2 per ton per month for each of the seven months of the program (April-October), even if the air conditioning is never turned off. The program has historically been activated three to four times per year. During an event, the customer's A/C may cycle off for 17.5 minutes per 30-minute period for a maximum of three and a half hours per day. This program is available to customers in FPL's Region Territory only.",
      "keywords": ""
    },
    {
      "state": "Florida",
      "utility _name": "Florida Power and Light",
      "program_name": "<a href=\"https://www.fpl.com/business/save/programs/customized-incentives.html\">Custom Incentives Program</a>",
      "hidden_program_name": "Custom Incentives Program",
      "hidden_program_link": "https://www.fpl.com/business/save/programs/customized-incentives.html",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Custom Incentive Program from Florida Power and Light (FPL) offers financial incentives for implementing energy-saving ideas (subject to FPL approval) that trim at least 25 kW of demand during FPL's peak demand periods (June - September). This program is available to customers in all areas served by the utility. To find out if you qualify, contact your FPL customer representative or the Businesses Care Center at 1-800-375-2434.",
      "keywords": ""
    },
    {
      "state": "Florida",
      "utility _name": "Tampa Electric (TECO)",
      "program_name": "<a href=\"http://www.tampaelectric.com/business/saveenergy/conservationvalue/\">Conservation Value Program</a>",
      "hidden_program_name": "Conservation Value Program",
      "hidden_program_link": "http://www.tampaelectric.com/business/saveenergy/conservationvalue/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Tampa Electric (TECO) Conservation Value Program provides rebates up to $92 per kW reduction for equipment that shifts or reduces energy use during summer and/or winter peak periods. The peak-demand savings are determined at 5 P.M. in August and 7 A.M. in January, roughly coincident to the time of the utility's peak demand. Measures providing as little as 5 kW are eligible. For more information or to sign up, call (813) 275-3909.",
      "keywords": ""
    },
    {
      "state": "Florida",
      "utility _name": "Tampa Electric (TECO)",
      "program_name": "<a href=\"http://www.tampaelectric.com/business/saveenergy/loadmanagement/\">Load Management Program</a>",
      "hidden_program_name": "Load Management Program",
      "hidden_program_link": "http://www.tampaelectric.com/business/saveenergy/loadmanagement/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Tampa Electric (TECO) Load Management Program offers customers $3.00-$3.50/kW credit on their monthly bills for allowing Tampa Electric to control operation of air conditioning or specialized equipment during the summer operating season and winter operating season when peak demand occurs. Payment occurs regardless of whether TECO calls the program or not. Summer operating season is April 1 to October 31 from 2-10 P.M. Winter operating season is November 1 to March 31 from 6-11 A.M. and 6-10 P.M. For more information or to sign up, call (813) 275-3909.",
      "keywords": ""
    },
    {
      "state": "Florida",
      "utility _name": "Tampa Electric (TECO)",
      "program_name": "<a href=\"http://www.tampaelectric.com/business/saveenergy/standbygenerator/\">Standby Generator Program</a>",
      "hidden_program_name": "Standby Generator Program",
      "hidden_program_link": "http://www.tampaelectric.com/business/saveenergy/standbygenerator/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Tampa Electric (TECO) Standby Generator Program provides customers with credits of $6.15 per kW on their monthly electric bill for the portion of the normal facility load that can be served by a standby generator within 30 minutes' notice during peak demand periods. A minimum of 25 kW of transferable load is required to qualify. For more information or to sign up, call (813) 275-3909.",
      "keywords": ""
    },
    {
      "state": "Georgia",
      "utility _name": "Tennessee Valley Authority (TVA)",
      "program_name": "<a href=\"https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Tennessee Valley Authority (TVA)-Enel X Demand Response Program provides payments to participants in exchange for their agreement to reduce electricity consumption with 30 minutes' notice during times of exceptionally high demand. Demand response events may occur any day between the hours of 5 A.M. and 8 P.M. Central Time. Enel-X collaborates with customers to create an optimal demand reduction plan. Interested customers should contact their local electricity distributor.",
      "keywords": ""
    },
    {
      "state": "Hawaii",
      "utility _name": "Hawaiian Electric Company",
      "program_name": "<a href=\"https://www.hawaiianelectric.com/products-and-services/customer-incentive-programs/energy-scout\">Large Commercial and Industrial Direct Load Control</a>",
      "hidden_program_name": "Large Commercial and Industrial Direct Load Control",
      "hidden_program_link": "https://www.hawaiianelectric.com/products-and-services/customer-incentive-programs/energy-scout",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Hawaiian Electric's (HECO's) Large Commercial and Industrial Direct Load Control (CIDLC) program, also known as EnergyScoutTM for Business, provides customers with free installation of a device that can curtail customer-designated loads. Participating customers receive monthly bill credits based on the magnitude of the load they let HECO control, regardless of whether a DR event is called. In the unusual event that a DR event lasting more than one hour occurs, program participants receive an additional incentive. This program is currently fully subscribed and HECO is directing interested customers towards its Fast DR program instead.",
      "keywords": ""
    },
    {
      "state": "Hawaii",
      "utility _name": "Hawaiian Electric Company",
      "program_name": "<a href=\"https://www.hawaiianelectric.com/products-and-services/customer-incentive-programs/energy-scout\">Small Business Direct Load Control Program</a>",
      "hidden_program_name": "Small Business Direct Load Control Program",
      "hidden_program_link": "https://www.hawaiianelectric.com/products-and-services/customer-incentive-programs/energy-scout",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Hawaiian Electric's (HECO's) Small Business Direct Load Control (SBDLC) program, also known as EnergyScoutTM for Small Business, provides customers with free installations of a device that can temporarily turn off water heaters or cycle air conditioners for no longer than an hour. Participants receive a monthly credit of $5 for each participating water heater and each ton of air conditioning enrolled. Incentives are received regardless of whether an event is called. The program is currently fully subscribed; interested customers should check the HECO website for updates.",
      "keywords": ""
    },
    {
      "state": "Hawaii",
      "utility _name": "Hawaiian Electric Company",
      "program_name": "<a href=\"https://www.hawaiianelectric.com/products-and-services/demand-response/fast-demand-response\">Fast Demand Response</a>",
      "hidden_program_name": "Fast Demand Response",
      "hidden_program_link": "https://www.hawaiianelectric.com/products-and-services/demand-response/fast-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Hawaiian Electric's (HECO's) Fast Demand Response (DR) program is intended to stabilize the grid and prevent unplanned outages during times when demand exceeds generation capacity. Program participants agree to have controllers installed on non-essential equipment. However, they maintain complete control of their equipment and can opt out of participating in any event. Events occur between 7 A.M. and 9 P.M. on weekdays and last a maximum of one hour. Participants have 10 minutes to reduce the participating energy load once the event has been initiated. Customers can participate in 40 events per year at $5/kW each month or 80 events at $10/kW per month. There is a minimum load shed requirement of 50 kW, which amounts to $3,000 or $6,000 per year for 40- and 80-event participants, respectively.",
      "keywords": ""
    },
    {
      "state": "Idaho",
      "utility _name": "Idaho Power",
      "program_name": "<a href=\"https://www.idahopower.com/ways-to-save/savings-for-your-business/irrigation-programs/irrigation-peak-rewards/\">Irrigation Peak Rewards</a>",
      "hidden_program_name": "Irrigation Peak Rewards",
      "hidden_program_link": "https://www.idahopower.com/ways-to-save/savings-for-your-business/irrigation-programs/irrigation-peak-rewards/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Idaho Power offers a direct load control option, the Irrigation Peak Rewards program, to agricultural customers for allowing irrigation pumps to be remotely shut off during peak electricity usage. The program runs from June 15 to September 15 and offers participants $5.25 per kW of controlled load plus a small additional incentive for kWh actually reduced; if the number of events exceeds three, the kWh incentive for actual events goes up significantly. Individual irrigation pumps have a load control device installed at the pump location. Load control events can occur any weekday or Saturday between 3 and 10 P.M. for standard interruptions or 3 and 11 P.M. for extended interruptions. Customers are notified four hours before each event by the company. A minimum of three load control events, each lasting no more than four hours, will occur each program season. The company, however, also offers an option to opt out of a specific load control event in exchange for a fee.",
      "keywords": ""
    },
    {
      "state": "Idaho",
      "utility _name": "Rocky Mountain Power",
      "program_name": "<a href=\"https://www.rockymountainpower.net/savings-energy-choices/business/irrigation-load-control.html\">Irrigation Load Control</a>",
      "hidden_program_name": "Irrigation Load Control",
      "hidden_program_link": "https://www.rockymountainpower.net/savings-energy-choices/business/irrigation-load-control.html",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Rocky Mountain Power's Irrigation Load Control program offers financial incentives to irrigators who agree to curtail electricity use during peak demand periods. Irrigators choose which sites to enroll in the program and which load control option best suits their needs. Rocky Mountain Power's third-party vendor, EnelX, then installs a device that allows customers to access an online portal to monitor usage and control their demand. Compensation is determined by multiplying the average load (kW) a customer can reliably shut off during program hours by the incentive rate, adjusted for event participation. The incentive rate is set by customer's average expected kW per pump. The program runs from June 1 through August 15. Events can be called only during weekdays from 2 to 9 P.M and customers will be notified at least four hours prior to the event. Participants receive a 20% bonus if the listed pumps participate in every event that lasts until 9 P.M. Events are limited to a maximum of 20 events per week and 52 event-hours per season (and no more than 12 event-hours in any given week). the day before an event. For more information or to sign up, customers can contact EnelX at (888) 363-7662.",
      "keywords": ""
    },
    {
      "state": "Illinois",
      "utility _name": "Ameren",
      "program_name": "<a href=\"https://www.ameren.com/illinois/business/electric-vehicles/rate\">EV Rate Program</a>",
      "hidden_program_name": "EV Rate Program",
      "hidden_program_link": "https://www.ameren.com/illinois/business/electric-vehicles/rate",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Ameren offers the optional EV Charging Program for certain non-residential facilities (particularly, customers on rate schedules DS-2, DS-3, and DS-4). These rates offer steep discounts for charging fleets during Preferred Charging Periods (11 P.M. – 7 A.M.) and substantial discounts for charging fleets during Standard Charging Periods (7– 11 A.M. and 7– 11 P.M.).",
      "keywords": ""
    },
    {
      "state": "Illinois",
      "utility _name": "MidAmerican Energy",
      "program_name": "<a href=\"https://www.midamericanenergy.com/curtailment\">Curtailment Program</a>",
      "hidden_program_name": "Curtailment Program",
      "hidden_program_link": "https://www.midamericanenergy.com/curtailment",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "MidAmerican Energy offers its Curtailment program to its Illinois commercial and industrial customers who can reduce load by a minimum of 200 kW during peak demand periods. Customers can choose between summer only participation from June through September or year-round participation. Customers will be notified at least two hours in advance of curtailment events, which will last a maximum of six hours each. Curtailment incentives are based on the contracted kW to be reduced during peak periods and are payable as rebates at the end of the peak energy season. There may be financial penalties for failing to curtail when requested. For more information or to participate, call (866) 584-0871.",
      "keywords": ""
    },
    {
      "state": "Illinois",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Indiana",
      "utility _name": "AES Indiana",
      "program_name": "<a href=\"https://www.aesindiana.com/coolcentsr-air-conditioning-management\">CoolCents&reg;</a>",
      "hidden_program_name": "CoolCents®",
      "hidden_program_link": "https://www.aesindiana.com/coolcentsr-air-conditioning-management",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "AES Indiana offers CoolCents®, a direct load control program that remunerates customers up to $20 each summer (June-September) per air conditioning unit for the right to cycle the unit's compressor via a smart thermostat. As a smart thermostat is required for participation, interested customers are eligible for $50 off an eligible smart thermostat if interested in participating in the program. Call CoolCents at (866) 908-4915 for more information or to enroll.",
      "keywords": ""
    },
    {
      "state": "Indiana",
      "utility _name": "Duke Energy",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/powershare\">PowerShare</a>",
      "hidden_program_name": "PowerShare",
      "hidden_program_link": "https://www.duke-energy.com/business/products/powershare",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Duke Energy's PowerShare program remunerates participants who can curtail at least 100 kW up to 5% of their total bill for reducing load below a customer-specific baseline during periods when the grid is compromised or when market prices are high. There are several options, including voluntary and mandatory ones. Payments are higher for the mandatory programs, but there is a penalty for not meeting the committed load shed during notified events.",
      "keywords": ""
    },
    {
      "state": "Indiana",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Iowa",
      "utility _name": "MidAmerican Energy",
      "program_name": "<a href=\"https://www.midamericanenergy.com/curtailment\">Curtailment Program</a>",
      "hidden_program_name": "Curtailment Program",
      "hidden_program_link": "https://www.midamericanenergy.com/curtailment",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "MidAmerican Energy offers its Curtailment program to commercial and industrial customers able to reduce load by a minimum of 200 kW during peak demand periods. Customers can choose to participate in curtailment events only during the summer period (June-September) or year-round. Curtailment calls occur two to six hours in advance of required reductions, and each event lasts a maximum of six hours. Curtailment incentives are based on the contracted kW to be reduced during peak periods and are payable as rebates at the end of the peak energy season",
      "keywords": ""
    },
    {
      "state": "Iowa",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Kansas",
      "utility _name": "Evergy",
      "program_name": "<a href=\"https://www.evergy.com/ways-to-save/incentives/demand-response\">Business Demand Response Program</a>",
      "hidden_program_name": "Business Demand Response Program",
      "hidden_program_link": "https://www.evergy.com/ways-to-save/incentives/demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Evergy's Business Demand Response Program rewards commercial customers who can reduce their load by at least 25 kW during high-demand days. Participants work with the utility to develop a customized curtailment plan. Customers can select the number of events (4, 6 or 8) in which to participate and have the opportunity to earn bonus incentives for extended periods of curtailment (7-10 hours). Curtailment events are called on weekdays from 10 A.M. - 8 P.M. No more than 20 events will be called during the curtailment season, and each event will last up to four hours.",
      "keywords": ""
    },
    {
      "state": "Kentucky",
      "utility _name": "Duke Energy",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/powershare\">Power Share</a>",
      "hidden_program_name": "Power Share",
      "hidden_program_link": "https://www.duke-energy.com/business/products/powershare",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The PowerShare program from Duke Energy provides financial incentives for reducing energy consumption levels during peak use periods. Customers may choose from a variety of curtailment options, including voluntary and mandatory load drops. The minimum curtailment is 100 kW. There are also options to tailor the program for the number of events your site is willing to participate in each year. Incentives range up to 5% off monthly bills for participating customers. Call (800) 723-9678 for more information or to participate.",
      "keywords": ""
    },
    {
      "state": "Kentucky",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Kentucky",
      "utility _name": "Tennessee Valley Authority (TVA)",
      "program_name": "<a href=\"https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Tennessee Valley Authority (TVA)-Enel X Demand Response Program provides payments to participants in exchange for their agreement to reduce electricity consumption with 30 minutes' notice during times of exceptionally high demand. Demand response events may occur any day between the hours of 5 A.M. and 8 P.M. Central Time. Enel-X collaborates with customers to create an optimal demand reduction plan. Interested customers should contact their local electricity distributor.",
      "keywords": ""
    },
    {
      "state": "Louisiana",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Louisiana",
      "utility _name": "Entergy New Orleans",
      "program_name": "<a href=\"https://energysmartadr.com/\">EnergySmart Large Commercial Demand Response</a>",
      "hidden_program_name": "EnergySmart Large Commercial Demand Response",
      "hidden_program_link": "https://energysmartadr.com/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Entergy New Orleans offers cost savings to commercial customers that can reduce consumption during peak periods through the EnergySmart Large Commercial Demand Response Program. The program is an Automated Demand Response program that automatically reduces energy consumption via pre approved measures. Customers receive biannual payments for reduced electrical demand. Payment is based on average demand reduction across all events during a performance period ($50/kW for summer and $10/kW for non-summer). There are no performance penalties for opting out or reducing participation during an event.",
      "keywords": ""
    },
    {
      "state": "Maryland",
      "utility _name": "Delmarva Power",
      "program_name": "<a href=\"https://energywiserewards.delmarva.com/md/commercial/\">Energy Wise Rewards</a>",
      "hidden_program_name": "Energy Wise Rewards",
      "hidden_program_link": "https://energywiserewards.delmarva.com/md/commercial/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Delmarva Power's Energy Wise Rewards™  offering is a \"direct load control\" program that allows the company to cycle the compressors in customers' air conditioners for up to 15 minutes in any 30-minute period during summer weekdays on usually about five \"peak saving days\" per summer (June through September). Cycling events usually last three to six hours. The company controls the air conditioners either through a programmable thermostat or an outdoor switch box that they install at your facility. Devices and installation services come at no charge. Customers receive bill credits for participating.",
      "keywords": ""
    },
    {
      "state": "Maryland",
      "utility _name": "Pepco",
      "program_name": "<a href=\"https://energywiserewards.pepco.com/md/commercial/overview/\">Energy Wise Rewards</a>",
      "hidden_program_name": "Energy Wise Rewards",
      "hidden_program_link": "https://energywiserewards.pepco.com/md/commercial/overview/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "PEPCO's Energy Wise Rewards™ offering is a \"direct load control\" program that allows the company to cycle customers' central air conditioners or heat pumps for up to 15 minutes in any 30-minute period during summer weekdays (June through September) on usually about five \"peak saving days\" per summer. Cycling events usually last three to six hours. The company controls the air conditioners either through a programmable thermostat or an outdoor switch box that they install on customers' A.C. units. Devices and installation services come at no charge. Customers receive bill credits of up to $80 per year for participating.",
      "keywords": ""
    },
    {
      "state": "Michigan",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Michigan",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://mi.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings\">Electric Rate Savings</a>",
      "hidden_program_name": "Electric Rate Savings",
      "hidden_program_link": "https://mi.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy offers the Electric Rate Savings  program, which provides reduced demand charges for peak demand reduction at commercial and industrial facilities that can cut load by 50 kW or more during peak periods, primarily in the summer months of June through September (though customers can be called on to reduce anytime during the year). Participating customers receive a per-kW discount on controllable demand every month, but in exchange must commit to reducing their load to a pre-determined level, usually for four to eight hours. There is a penalty for non-compliance. Customers can call 800-481-4700 or email BSC@xcelenergy.com for more information or to enroll in the program.",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Dairyland Power Cooperative",
      "program_name": "<a href=\"https://dairylandpower.com/load-management\">Direct Load Control Programs</a>",
      "hidden_program_name": "Direct Load Control Programs",
      "hidden_program_link": "https://dairylandpower.com/load-management",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Dairyland Power Cooperative offers their members the Electric$ense Load Management program, a direct load control program. Through this program, customers' devices are turned off, cycled or modulated during events that occur 2-6 P.M. during the summer as well as 6:55 to 11 A.M. or 4:55 to 8 P.M. in the winter. Energy savings during these times are passed onto customers through incentives and rates. Visit the program website to find demand response program options for your local cooperative.",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Dakota Electric Association",
      "program_name": "<a href=\"https://www.dakotaelectric.com/member-services/programs-rebates/for-your-business/energy-wise-management-programs/\">EnergyWise Load Management</a>",
      "hidden_program_name": "EnergyWise Load Management",
      "hidden_program_link": "https://www.dakotaelectric.com/member-services/programs-rebates/for-your-business/energy-wise-management-programs/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Dakota Electric Association offers several money-saving options through its Energy Wise® Load Management initiative. Full and partial interruption options are available (Rate 70 and 71). The Full Interruption option is offered to customers who manually reduce their connected load to zero during times of peak demand, or let Dakota control the site's generator(s) to achieve the same. The Partial Interruption option is available to customers who agree to reduce their electric load by at least 50 kW during times of peak energy use. Savings are commensurate with the magnitude of curtailment.",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Minnesota Power",
      "program_name": "<a href=\"https://www.mnpower.com/CustomerService/DualFuel\">Commercial Dual Fuel Program</a>",
      "hidden_program_name": "Commercial Dual Fuel Program",
      "hidden_program_link": "https://www.mnpower.com/CustomerService/DualFuel",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Minnesota Power offers a Commercial Dual Fuel program that provides customers a discount on their energy use in exchange for occasional interruptions from the utility. The incentive is roughly 5 cents per curtailed kWh and depends on the program option. The Dual Fuel Standard option provides a small discount with more limited interruptions (up to two times per day and four hours at a time). The Dual Fuel Plus option offers a larger discount for more extended interruptions (up to 20 hours per day and only for electric heating). The incentive is roughly 5 cents per curtailed kWh.",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Otter Tail Power Company",
      "program_name": "<a href=\"https://www.otpco.com/coolsavings#:~:text=Stay%20cool%20and%20save%20this%20summer%20with%20CoolSavings!&amp;text=Once%20accepted%2C%20we&#039;ll%20send,keeping%20you%20cool%20and%20comfortable.\">CoolSavings Program</a>",
      "hidden_program_name": "CoolSavings Program",
      "hidden_program_link": "https://www.otpco.com/coolsavings#:~:text=Stay%20cool%20and%20save%20this%20summer%20with%20CoolSavings!&amp;text=Once%20accepted%2C%20we'll%20send,keeping%20you%20cool%20and%20comfortable.",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Customers who enroll in Otter Tail Power Company's CoolSavings program allow Otter Tail to manage their cooling usage during peak demand periods. The customer receives a monthly credit of $6 per ton ( based on the size of the controlled cooling load) during the summer months of June to September. Customers can call 800-493-3299 for more information or to sign up.",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Otter Tail Power Company",
      "program_name": "<a href=\"https://www.otpco.com/energy-control/\">Energy Control Options</a>",
      "hidden_program_name": "Energy Control Options",
      "hidden_program_link": "https://www.otpco.com/energy-control/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Otter Tail Power Company offers various energy control options that provide 25-50% rate cuts in exchange for allowing the utility to control specific equipment (such as domestic water heating or thermal storage) on their system during on-peak times. Customers can choose whether or not to be notified ahead of events.",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://www.xcelenergy.com/programs_and_rebates/business_programs_and_rebates/rates/electric_rate_savings\">Electric Rate Savings</a>",
      "hidden_program_name": "Electric Rate Savings",
      "hidden_program_link": "https://www.xcelenergy.com/programs_and_rebates/business_programs_and_rebates/rates/electric_rate_savings",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Xcel Energy offers the Electric Rate Savings program, which provides financial incentives for peak demand reduction at commercial and industrial facilities that can reduce load by 50 kW or more during peak periods, primarily in the summer (June to September). Customers can be called on to reduce anytime during the year, but the great majority of events occur in the summer. Participating customers receive a per-kW discount on controllable demand every month, but in exchange must commit to reducing their load to a pre-determined level for up to 150 hours per year. Customers can also add time-of-day service and save more on energy costs by shifting part of their load to off-peak hours (9 P.M. to 9 A.M.).",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://mn.my.xcelenergy.com/s/business/rate-plans/optimize-your-charge\">Optimize Your Charge (EV Rate)</a>",
      "hidden_program_name": "Optimize Your Charge (EV Rate)",
      "hidden_program_link": "https://mn.my.xcelenergy.com/s/business/rate-plans/optimize-your-charge",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Xcel Energy offers Optimize Your Charge, two available rates that reward customers who agree to charge their EVs during specified off-peak windows at least 25% of the time. Customers have the option of choosing between two off-peak charging windows: 9 P.M. to 5 A.M. or 1 A.M. to 9 A.M. The customer must use a charger or EV from a pre-specified list maintained by Xcel. For each vehicle or charger registered in this program, the customer can receive a $50 annual credit.",
      "keywords": ""
    },
    {
      "state": "Minnesota",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://www.xcelenergy.com/programs_and_rebates/business_programs_and_rebates/rates/savers_switch_for_business\">Saver's Switch for Business</a>",
      "hidden_program_name": "Saver's Switch for Business",
      "hidden_program_link": "https://www.xcelenergy.com/programs_and_rebates/business_programs_and_rebates/rates/savers_switch_for_business",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Xcel Energy offers the Saver's Switch for Business program, which provides participants a monthly discount of $5 per ton of enrolled air conditioning in exchange for allowing the utility to cycle the air conditioning on and off for 15 to 20 minute intervals during periods of peak electric demand in the summer (June to September). The maximum amount of allowable control hours is 300 hours per year.",
      "keywords": ""
    },
    {
      "state": "Mississippi",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Mississippi",
      "utility _name": "Tennessee Valley Authority (TVA)",
      "program_name": "<a href=\"https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.enelx.com/n-a/en/resources/data-sheets-brochures/faq-tennessee-valley-authority-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The TVA-Enel X Demand Response Program provides payments to participants in exchange for their agreeing to reduce electricity consumption with 30 minutes notice during times of exceptionally high demand. Demand response events may occur any day between the hours of 5 A.M. and 8 P.M. Central Time. Enel-X collaborates with customers to create an optimal demand reduction plan. Interested customers should contact their local electricity distributor.",
      "keywords": ""
    },
    {
      "state": "Missouri",
      "utility _name": "Ameren",
      "program_name": "<a href=\"https://www.ameren.com/missouri/business/demand-response\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.ameren.com/missouri/business/demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Ameren Missouri offers its Demand Response Program using Enel X, an aggregator (also known as a curtailment service provider, or CSP). One- to four-hour events can be called (with at least one hour's notice) anytime May to September; events generally take place between 3 and 7 P.M. A minimum of two events and maximum of fifteen events will be called per program season. Participants agree to curtail usage according to their customized (with Enel X) \"energy reduction plan,\" and in exchange receive bill credits commensurate with these reductions.",
      "keywords": ""
    },
    {
      "state": "Missouri",
      "utility _name": "Evergy",
      "program_name": "<a href=\"https://www.evergy.com/ways-to-save/incentives/demand-response\">Business Demand Response</a>",
      "hidden_program_name": "Business Demand Response",
      "hidden_program_link": "https://www.evergy.com/ways-to-save/incentives/demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Evergy, formed from the merger of KCP&amp;L and Westar Energy, offers its Business Demand Response program, which provides a credit on summer energy bills in exchange for reducing electrical usage for as many as ten hours on up to twenty summer weekdays (June 1 – September 30), between 10 A.M. and 8 P.M. Customers can select the number of events in which to participate (4, 6 or 8 events) and may earn bonus incentives for extending their curtailment durations. Contact Evergy's demand response team at 833-303-9173 for more information and to confirm that the program is accepting new applicants in your service area.",
      "keywords": ""
    },
    {
      "state": "Missouri",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Montana",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Nevada",
      "utility _name": "NV Energy",
      "program_name": "<a href=\"https://www.nvenergy.com/help/coolshare-support\">Cool Share Program</a>",
      "hidden_program_name": "Cool Share Program",
      "hidden_program_link": "https://www.nvenergy.com/help/coolshare-support",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "NV Energy's Cool Share program is currently (Spring 2024) not accepting new applications, but has historically been available to small businesses with air conditioning units of ten tons or less. Participants earn incentives for allowing direct load control via NV Energy or by controlling their own A.C. loads via internet-attached thermostats.",
      "keywords": ""
    },
    {
      "state": "New Jersey",
      "utility _name": "Orange and Rockland",
      "program_name": "<a href=\"https://www.oru.com/en/save-money/rebates-incentives-credits/new-jersey-customers/incentives-for-residential-customers-nj/thermostat-rebate\">Bring Your Own Thermostat Program</a>",
      "hidden_program_name": "Bring Your Own Thermostat Program",
      "hidden_program_link": "https://www.oru.com/en/save-money/rebates-incentives-credits/new-jersey-customers/incentives-for-residential-customers-nj/thermostat-rebate",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Orange and Rockland's (O&amp;R) small commercial customers can participate in the Bring Your Own Thermostat program by allowing O&amp;R to make brief, limited adjustments to their central air-conditioning settings. Permissible \"adjustment periods\" occur from May to September during weekdays from 11:30 A.M. to 11 P.M. Adjustment periods last no more than four hours and occur no more than ten times per summer (unless there's a power emergency). Customers can elect to re-take control of their thermostat and adjust the temperature at any time. Customers will receive an $85 rebate for each thermostat enrolled in this program and $25 at the end of the summer season for each year enrolled in the program.",
      "keywords": ""
    },
    {
      "state": "New Mexico",
      "utility _name": "Public Service Company of New Mexico",
      "program_name": "<a href=\"https://www.pnm.com/peaksaver\">Peak Saver Program</a>",
      "hidden_program_name": "Peak Saver Program",
      "hidden_program_link": "https://www.pnm.com/peaksaver",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Public Service of New Mexico's Peak Saver Program, is open to large customers on qualifying rates, provides financial incentives to participants in return for voluntarily reducing the amount of energy they use during peak demand days, typically the hottest days of the year. The size of the incentive paid depends on the amount of electricity committed to the program. These events may occur during any non-holiday weekday from 8 A.M. to 8 P.M. from June 1 to September 30. PNM is limited to 100 demand response event hours per year. Each event is limited to four hours in duration. Notifications are sent out ten minutes prior to the start of an event.",
      "keywords": ""
    },
    {
      "state": "New Mexico",
      "utility _name": "Public Service Company of New Mexico",
      "program_name": "<a href=\"https://www.pnmpowersaver.com/business/\">Power Saver Program</a>",
      "hidden_program_name": "Power Saver Program",
      "hidden_program_link": "https://www.pnmpowersaver.com/business/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Power Saver Program offers small business customers (&lt; 50 kW peak) annual payments of $25 per device and a one-time enrollment bonus of $75 per device for allowing the company to either install a wi-fi enabled thermostat or connect a load control device directly to their air conditioning units. On selected summer weekday afternoons from June 1 to September 30 when electricity demand increases, the Power Saver device receives a wireless signal that puts the air conditioner into a conservation mode.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Central Hudson",
      "program_name": "<a href=\"https://www.cenhud.com/my-energy/save-energy-money/commercial-demand-response/\">Commercial System Relief Program</a>",
      "hidden_program_name": "Commercial System Relief Program",
      "hidden_program_link": "https://www.cenhud.com/my-energy/save-energy-money/commercial-demand-response/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Through the Commercial System Relief Program (CSRP) Central Hudson offers its customers incentives for reducing their electricity usage during peak periods. Two enrollment options are available, one voluntary (for which payments are made only for called event performance) and one, the more lucrative \"reservation payment\" option, in which customers are also remunerated ($1.23/kW each summer month, June through September) for their commitment to respond to events. Customers in both options are paid $0.11/kWh for \"planned events.\" (i.e., those with at least 21 hours' notice) For \"unplanned events,\" (less than 21 hours' notice) customers in the voluntary options are paid $0.35/kWh, with $0.21 paid to the reservation payment participants. Events are called weekdays from 12 A.M. to 8 P.M. and last no more than four hours per event. Customers who are interested in the reservation payment option must enroll before May 1.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Central Hudson",
      "program_name": "<a href=\"https://cenhudpeakperks.com/\">Peak Perks</a>",
      "hidden_program_name": "Peak Perks",
      "hidden_program_link": "https://cenhudpeakperks.com/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Through its Peak Perks initiative, Central Hudson offers commercial facilities a number of direct load control options, in which the utility installs a smart thermostat or a switching device on rooftop air conditioning units or pool pumps in order to cycle them during times when the grid is constrained or wholesale electricity prices are unusually high. Customers are remunerated $125 for signing up, and up to $75 per summer for each piece of enrolled equipment.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Central Hudson",
      "program_name": "<a href=\"https://cenhudpeakperks.com/targeted-demand-response/\">Targeted Demand Response</a>",
      "hidden_program_name": "Targeted Demand Response",
      "hidden_program_link": "https://cenhudpeakperks.com/targeted-demand-response/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "For customers in certain transmission-constrained portions of its service territory, Central Hudson offers the Targeted Demand Response program. Customers can earn roughly $27.30/kW each summer (June 1st to September 30th) for their commitment to curtail a specified amount of load (relative to their five highest peaks in the past ten days) for four to eight hours (the latter in extreme events). If no events are called, performance during a test event in late July / early August between 2 and 6 P.M. will determine remuneration. A minimum of 50 kW of reduction commitment is necessary to participate. Day-ahead notifications by the utility will be sent by 5 P.M. via email or phone. Same-day notifications are sent at least two hours prior to the event by email or phone. The enrollment deadline for full participation (June 1 - September 30) is May 31, and June 30 for partial season participation (July 1 - September 30).",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Con Edison",
      "program_name": "<a href=\"https://www.coned.com/en/save-money/rebates-incentives-tax-credits/rebates-incentives-tax-credits-for-commercial-industrial-buildings-customers/smart-usage-rewards\">Commercial System Relief Program</a>",
      "hidden_program_name": "Commercial System Relief Program",
      "hidden_program_link": "https://www.coned.com/en/save-money/rebates-incentives-tax-credits/rebates-incentives-tax-credits-for-commercial-industrial-buildings-customers/smart-usage-rewards",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Through the Commercial System Relief Program (CSRP) Con Edison offers its customers incentives for reducing their electricity usage during peak periods. The CSRP provides a 21-hour notice for \"planned events,\" which exclusively take place on weekdays. Participants receive between $6 (Staten Island and Westchester County) and $18 (Brooklyn, Bronx, Manhattan, and Queens) per pledged kW per month and $1 for each kWh that is reduced during an event. \"Unplanned events\" can be called with less than 21 hours' notice, but participation in those is voluntary. Enrollment is open from March 1 2024 - April 1 2024.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Con Edison",
      "program_name": "<a href=\"https://www.coned.com/en/save-money/rebates-incentives-tax-credits/rebates-incentives-tax-credits-for-commercial-industrial-buildings-customers/smart-usage-rewards\">Distribution Load Relief Program</a>",
      "hidden_program_name": "Distribution Load Relief Program",
      "hidden_program_link": "https://www.coned.com/en/save-money/rebates-incentives-tax-credits/rebates-incentives-tax-credits-for-commercial-industrial-buildings-customers/smart-usage-rewards",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The Distribution Load Relief Program (DLRP) pays participants between $18 and $25 per kW for each month of enrollment, as well as $1/kWh for actual event reductions, in exchange for their willingness to cut load by pledged amounts any time between 6 A.M. and 12 A.M. (midnight), seven days per week, including holidays. Typically, events are called with two hours' notice, though less warning can be provided in advance of an \"immediate event,\" i.e., when there is an imminent threat to the grid.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Con Edison",
      "program_name": "<a href=\"https://www.coned.com/en/save-money/rebates-incentives-tax-credits/rebates-incentives-tax-credits-for-commercial-industrial-buildings-customers\">Load Management Incentive Program</a>",
      "hidden_program_name": "Load Management Incentive Program",
      "hidden_program_link": "https://www.coned.com/en/save-money/rebates-incentives-tax-credits/rebates-incentives-tax-credits-for-commercial-industrial-buildings-customers",
      "open_to_customers": "Open",
      "program_or_rate": "Incentive",
      "areawide_contract": "Yes",
      "description": "ConEd offers a number of  incentives for customers to purchase products and systems that facilitate load management, from absorption chillers to thermal storage systems.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Con Edison",
      "program_name": "<a href=\"https://www.coned.com/en/business-partners/business-opportunities/dynamic-load-management-request-for-proposals\">Term and Auto Dynamic Load Management</a>",
      "hidden_program_name": "Term and Auto Dynamic Load Management",
      "hidden_program_link": "https://www.coned.com/en/business-partners/business-opportunities/dynamic-load-management-request-for-proposals",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "ConEd offers longer-term options, called Term-DLM and Auto-DLM, for customers willing to make multiple (three to five) year commitments to offerings comparable to CSRP. These longer deals will entail somewhat greater compensation amounts. The Auto-DLM program requires customers to respond much quicker as these resources are typically located in specific, constrained areas within the utility's service territory. Notification occurs ten minutes prior to a curtailment event. Customers enrolled in the Auto-DLM must be available to reduce load seven days per week between the hours of 6 A.M. and 12 A.M. (midnight) from May through September.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "National Grid",
      "program_name": "<a href=\"https://www.nationalgridus.com/Upstate-NY-Business/RFP/Term-DLM-and-Auto-DLM-Program-Request-for-Proposals\">Term and Auto Dynamic Load Management</a>",
      "hidden_program_name": "Term and Auto Dynamic Load Management",
      "hidden_program_link": "https://www.nationalgridus.com/Upstate-NY-Business/RFP/Term-DLM-and-Auto-DLM-Program-Request-for-Proposals",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "National Grid offers longer-term options, called Term-DLM and Auto-DLM, for customers willing to make multiple (three to five) year commitments to offerings comparable to CSRP. These longer deals will entail somewhat greater compensation amounts. The Auto-DLM program requires customers to respond much quicker as these resources are typically located in specific, constrained areas within the utility's service territory. Notification occurs ten minutes prior to a curtailment event. Customers enrolled in the Auto-DLM must be available to reduce load seven days per week between the hours of 6 A.M. and 12 A.M. (midnight) from May through September. The request for proposals to participate in this program closed March 1 2024 for the 2025 vintage year, check the National Grid website to see when the Request for Proposal period for the 2026 vintage year will open.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "NYSEG",
      "program_name": "<a href=\"https://www.nyseg.com/web/nyseg/smartenergy/businesssolutions/cidemandresponse/commercial-system-relief-program\">Commercial System Relief Program</a>",
      "hidden_program_name": "Commercial System Relief Program",
      "hidden_program_link": "https://www.nyseg.com/web/nyseg/smartenergy/businesssolutions/cidemandresponse/commercial-system-relief-program",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Through the Commercial System Relief Program (CSRP) New York State Electric and Gas (NYSEG) offers its commercial/industrial customers incentives for reducing their electricity usage during peak periods. Customers must be able to curtail 50 kW or more for at least four hours starting at 2 P.M. on weekdays, May through September.  Two enrollment options are available, one voluntary (for which payments are made only for called event performance) and one, the more lucrative \"reservation payment\" option, in which customers are also remunerated ($4.10/kW each month) for their commitment to respond to events. Customers under the both the reservation payment and voluntary participation options receive a performance payment $0.50/kWh. The enrollment deadline for the Reservation Payment Option is April 1, 2024 and September 30, 2024 for the Voluntary Participation Option.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "NYSEG",
      "program_name": "<a href=\"https://www.nyseg.com/smartenergy/businesssolutions/cidemandresponse\">Term and Auto Dynamic Load Management</a>",
      "hidden_program_name": "Term and Auto Dynamic Load Management",
      "hidden_program_link": "https://www.nyseg.com/smartenergy/businesssolutions/cidemandresponse",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "NYSEG offers longer-term options, called Term-DLM and Auto-DLM, for customers willing to make multiple (three to five) year commitments to offerings comparable to CSRP. These longer deals will entail somewhat greater compensation amounts. The Auto-DLM program requires customers to respond much quicker as these resources are typically located in specific, constrained areas within the utility's service territory. Notification occurs ten minutes prior to a curtailment event. Customers enrolled in the Auto-DLM must be available to reduce load seven days per week between the hours of 6 A.M. and 12 A.M. (midnight) from May through September. The request for proposal period to participate in this program closed March 1 2024 for the 2024 Demand Response Capacity Period, check the NYSEG website to see when the Request for Proposal period for the 2025 Demand Response Capability period will open.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "NYSEG",
      "program_name": "<a href=\"https://enrollmythermostat.com/smartsavingsnys/\">Smart Savers Rewards</a>",
      "hidden_program_name": "Smart Savers Rewards",
      "hidden_program_link": "https://enrollmythermostat.com/smartsavingsnys/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Small commercial customers can participate in the Smart Savers Rewards program and receive $70 for each eligible internet-connected thermostat enrolled in the program. Customers allow NYSEG to make brief, limited temperature adjustments during periods when demand on the grid is high. Participants can earn an additional $20 if they fully participate in one full event without opting out. With full participation, during adjustment periods, thermostats will automatically be raised up four degrees for up to four hours. Adjustment periods occur weekdays between 1 and 7 P.M. during the summer months (May 1 to September 30) and occur no more than 15 times per summer. Thermostats are automatically lowered to the normal set point after the adjustment periods are over. Participation in this program is voluntary and customers can opt out of any thermostat adjustment at any time.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Orange and Rockland",
      "program_name": "<a href=\"https://www.oru.com/en/save-money/rebates-incentives-credits/new-york-customers/incentives-for-residential-customers-ny/thermostat-rebate\">Bring Your Own Thermostat Program</a>",
      "hidden_program_name": "Bring Your Own Thermostat Program",
      "hidden_program_link": "https://www.oru.com/en/save-money/rebates-incentives-credits/new-york-customers/incentives-for-residential-customers-ny/thermostat-rebate",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Orange and Rockland's (O&amp;R) small commercial customers can participate in the Bring Your Own Thermostat program by allowing O&amp;R to make brief, limited adjustments to their central air-conditioning settings. Permissible \"adjustment periods\" occur from May to September during weekdays from 11:30 A.M. to 11 P.M. Adjustment periods last no more than four hours and occur no more than ten times per summer (unless there's a power emergency). Customers can elect to re-take control of their thermostat and adjust the temperature at any time. Customers will receive an $85 rebate for each thermostat enrolled in this program and $25 at the end of the summer season for each year enrolled in the program.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "PSE&amp;G Long Island",
      "program_name": "<a href=\"https://www.psegliny.com/en/saveenergyandmoney/GreenEnergy/PeakLoad/SmartSavers\">Smart Savers</a>",
      "hidden_program_name": "Smart Savers",
      "hidden_program_link": "https://www.psegliny.com/en/saveenergyandmoney/GreenEnergy/PeakLoad/SmartSavers",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "PSE&amp;G offers a direct load control program, called Smart Savers, which allows PSE&amp;G to make small temperature adjustments to customers' thermostats that are enrolled with the utility. Customers receive a one-time first-year payment of $85 per enrolled thermostat, and a $25 payment for each subsequent year they are enrolled, as long as they reduce their load in at least 50 percent of events called by the utility. Events occur from May through September. Customers can elect to take control of their thermostat and adjust the temperature at any time.",
      "keywords": ""
    },
    {
      "state": "New York",
      "utility _name": "Rochester Gas &amp; Electric",
      "program_name": "<a href=\"https://enrollmythermostat.com/smartsavingsnys/\">Smart Savers Rewards</a>",
      "hidden_program_name": "Smart Savers Rewards",
      "hidden_program_link": "https://enrollmythermostat.com/smartsavingsnys/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Small commercial customers can participate in the Smart Savers Rewards program and receive $70 for each eligible internet-connected thermostat enrolled. Customers allow RG&amp;E to make brief, limited temperature adjustments during periods when demand on the grid is high. Participants can earn an additional $20 if they participate in one full event without opting out. With full participation, during these adjustment periods, thermostats will automatically be raised up four degrees for up to four hours. Adjustment periods fall on weekdays between 1 and 7 P.M. during the summer months (May 1 to September 30) and occur no more than 15 times per summer. Thermostats are automatically lowered to the normal set point after the adjustment periods are over. Customers can elect to re-take control of their thermostat and adjust the temperature at any time.",
      "keywords": ""
    },
    {
      "state": "North Carolina",
      "utility _name": "Duke Energy Carolinas",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/energywise-business\">EnergyWise® Business</a>",
      "hidden_program_name": "EnergyWise® Business",
      "hidden_program_link": "https://www.duke-energy.com/business/products/energywise-business",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Small and medium commercial customers in the Duke Energy Carolinas service area can enroll in the EnergyWise® Business program. Customers can save on energy costs by allowing Duke Energy to temporarily reduce energy consumption during times of high demand called \"conservation periods.\" Two enrollment options are available through EnergyWise® Business: 1) the summer Load Control program, in which customers receive annual credits of $50-135 per load control device depending on the reduction in AC operation, and 2) the winter Bring Your Own kW program, in which customers either manually or automatically reduce load during energy conservation periods in exchange for $30 per reduced average kW.",
      "keywords": ""
    },
    {
      "state": "North Carolina",
      "utility _name": "Duke Energy Carolinas",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/onsite-generation\">On-Site Generation Service Program</a>",
      "hidden_program_name": "On-Site Generation Service Program",
      "hidden_program_link": "https://www.duke-energy.com/business/products/onsite-generation",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The On-Site Generation Service Program, available in the Duke Energy Carolinas service area, targets customers that do not currently own backup generation but would like to. Duke will install, own, and operate new generators (300 kW or larger) for participants willing to let the company use them in times of grid stress or high wholesale prices. There is a monthly service fee for this rate based on the levelized cost to own and operate the equipment.",
      "keywords": ""
    },
    {
      "state": "North Carolina",
      "utility _name": "Duke Energy Carolinas",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/powershare\">Power Share</a>",
      "hidden_program_name": "Power Share",
      "hidden_program_link": "https://www.duke-energy.com/business/products/powershare",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Duke Energy Carolinas offers the PowerShare program, which provides financial incentives for reducing energy consumption levels during peak use periods. Customers may choose from a variety of curtailment options, including voluntary and mandatory load drops. The minimum curtailment is 100 kW. There are also options to participate with self-generation equipment and to tailor the program for the number of events your site is willing to participate in each year. Incentives range up to 8% off monthly bills for participating customers. Customers enrolled in the voluntary option are notified a day prior to curtailment events, while mandatory option customers receive minimum 30 minutes' advance notice. There are penalties for failure to perform under the mandatory and self-generation options. Note: customers located in the Duke Energy Progress area are not eligible for this program.",
      "keywords": ""
    },
    {
      "state": "North Carolina",
      "utility _name": "Duke Energy Progress",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/energywise-business\">EnergyWise® Business</a>",
      "hidden_program_name": "EnergyWise® Business",
      "hidden_program_link": "https://www.duke-energy.com/business/products/energywise-business",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Small and medium commercial customers in the Duke Energy Progress service area can enroll in the EnergyWise® Business program. Customers can save on energy costs by allowing Duke Energy to temporarily reduce energy consumption during times of high demand called \"conservation periods.\" Two enrollment options are available through EnergyWise® Business: 1) the summer Load Control program, in which customers receive annual credits of $50-135 per load control device depending on the reduction in AC operation, and 2) the winter Bring Your Own kW program, in which customers either manually or automatically reduce load during energy conservation periods in exchange for $30 per reduced average kW.",
      "keywords": ""
    },
    {
      "state": "North Dakota",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "North Dakota",
      "utility _name": "Otter Tail Power Company",
      "program_name": "<a href=\"https://www.otpco.com/ways-to-save/programs/coolsavings/\">CoolSavings Program</a>",
      "hidden_program_name": "CoolSavings Program",
      "hidden_program_link": "https://www.otpco.com/ways-to-save/programs/coolsavings/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Otter Tail customers can enroll in the CoolSavings  program which allows Otter Tail to manage their cooling usage during peak demand periods. The customer will receive a credit of $6 per ton of controlled load during the summer months (June to September).",
      "keywords": ""
    },
    {
      "state": "North Dakota",
      "utility _name": "Otter Tail Power Company",
      "program_name": "<a href=\"https://www.otpco.com/energy-control/\">Energy Control Options</a>",
      "hidden_program_name": "Energy Control Options",
      "hidden_program_link": "https://www.otpco.com/energy-control/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Otter Tail Power Company offers various energy control options that provide 25-50% rate cuts in exchange for allowing the utility to control specific equipment (such as domestic water heating or thermal storage) on their system during on-peak times. Customers can choose whether or not to be notified ahead of events.",
      "keywords": ""
    },
    {
      "state": "North Dakota",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://nd.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings\">Electric Rate Savings</a>",
      "hidden_program_name": "Electric Rate Savings",
      "hidden_program_link": "https://nd.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy's Electric Rate Savings program is for customers willing to curtail load by at least 50 kW at Xcel's request during times of peak electric demand. In exchange, a monthly credit is applied to customers' utility bills. Peak demand typically occurs during the months of June through September; however, events may be called at any time during the year. Contact the Xcel Business Solutions Center at 1-800-481-4700 for more information.",
      "keywords": ""
    },
    {
      "state": "North Dakota",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://nd.my.xcelenergy.com/s/business/rate-plans/savers-switch\">Saver's Switch</a>",
      "hidden_program_name": "Saver's Switch",
      "hidden_program_link": "https://nd.my.xcelenergy.com/s/business/rate-plans/savers-switch",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy's Saver's Switch offers program participants a bill discount in exchange for allowing the utility to cycle participating air conditioning units on and off for 15- to 20-minute intervals during periods of peak electric demand.  Customers receive a monthly discount of $5 per ton of enrolled air conditioning. Peak demand events typically occur during summer months from June through September and occur 5-15 days per summer.",
      "keywords": ""
    },
    {
      "state": "Oklahoma",
      "utility _name": "Public Service Company of Oklahoma",
      "program_name": "<a href=\"https://powerforwardwithpso.com/programs/peak-performers/\">Peak Performers Program</a>",
      "hidden_program_name": "Peak Performers Program",
      "hidden_program_link": "https://powerforwardwithpso.com/programs/peak-performers/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Public Service Company of Oklahoma's Peak Performers program offers incentives for voluntarily reducing energy use for two to four hours on no more than 16 \"peak event\" days per summer. Peak events occur between June 1 and September 30 from the hours of 1 to 7 P.M. on any weekday (excluding holidays). Once per year, PSO will pay participants an average of $32 per kilowatt enrolled in the program. Customers receive notification at least two hours prior to a peak event. Incentives are based on the average kW saved over all peak event days. Contact PSO at 888-776-1366 for more information or to apply.",
      "keywords": ""
    },
    {
      "state": "Oregon",
      "utility _name": "Idaho Power",
      "program_name": "<a href=\"https://www.idahopower.com/ways-to-save/savings-for-your-business/irrigation-programs/irrigation-peak-rewards/\">Irrigation Peak Rewards </a>",
      "hidden_program_name": "Irrigation Peak Rewards",
      "hidden_program_link": "https://www.idahopower.com/ways-to-save/savings-for-your-business/irrigation-programs/irrigation-peak-rewards/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Idaho Power offers the Irrigation Peak Rewards Program, which provides a financial incentive to customers for allowing the utility to remotely turn off specific irrigation pumps for a minimum of three times during a program season. The program season runs from June 15 – September 15 each year. Events can occur any weekday or Saturday between 3 and 10 P.M., or 11 P.M. for \"extended program\" participants, and last no more than four hours each. Idaho Power provides notification to customers four hours before each event.",
      "keywords": ""
    },
    {
      "state": "Oregon",
      "utility _name": "Pacific Power",
      "program_name": "<a href=\"https://www.pacificpower.net/savings-energy-choices/business/wattsmart-efficiency-incentives-oregon/oregon-agriculture/irrigation-load-control.html\">Irrigation Load Control</a>",
      "hidden_program_name": "Irrigation Load Control",
      "hidden_program_link": "https://www.pacificpower.net/savings-energy-choices/business/wattsmart-efficiency-incentives-oregon/oregon-agriculture/irrigation-load-control.html",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Pacific Power's Irrigation Load Control Program is designed to help irrigators save money and contribute to a more stable electricity grid. Pacific Power customers on Schedule 41 or 48 rates with irrigation pumps of 25 horsepower or more that run at least 200 hours during the peak season (June 1 - September 15), can earn cash incentives by enrolling in this program. During peak demand periods, which typically occur between noon and 10pm, customers will temporarily shut off your pumps according to Pacific Power's notifications. These events last no more than four hours each, and there will be a maximum of 20 events totaling 52 hours per year. The amount of compensation customers receive is based on the amount of power you can reduce and the incentive rate you choose.",
      "keywords": ""
    },
    {
      "state": "Oregon",
      "utility _name": "Portland General Electric",
      "program_name": "<a href=\"https://portlandgeneral.com/save-money/save-money-business/energy-partner-program\">Energy Partner On Demand</a>",
      "hidden_program_name": "Energy Partner On Demand",
      "hidden_program_link": "https://portlandgeneral.com/save-money/save-money-business/energy-partner-program",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Portland General Electric's Energy Partner Program offers commercial customers a customizable way to receive payments for curtailing load during high-demand periods. Payments are based on the amount of energy saved during high-demand events, plus a base payment for program participation. There are several participation windows to choose from, and options for how much advance notice is required. Events usually last two to four hours, and cannot exceed five hours.",
      "keywords": ""
    },
    {
      "state": "Oregon",
      "utility _name": "Portland General Electric",
      "program_name": "<a href=\"https://portlandgeneral.com/save-money/save-money-business/energy-partner-smart-thermostat\">Energy Partner Smart Thermostat Program</a>",
      "hidden_program_name": "Energy Partner Smart Thermostat Program",
      "hidden_program_link": "https://portlandgeneral.com/save-money/save-money-business/energy-partner-smart-thermostat",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Portland General Electric's Energy Partner Smart Thermostat Program allows businesses to install free smart thermostats to help them save energy costs when demand is highest. In order to qualify for the program, customers must have a ducted electric heating or air conditioning system and have a permanently installed Wi-Fi network. Customers need not own their space to participate. On a particularly hot day or cold morning, the smart thermostat may be automatically adjusted by a few degrees for no more than a few hours. Customers receive $100 up-front for signing up and an additional $60 per site each season they participate in Peak Time Events.",
      "keywords": ""
    },
    {
      "state": "Oregon",
      "utility _name": "Portland General Electric",
      "program_name": "<a href=\"https://portlandgeneral.com/save-money/save-money-business/dispatchable-standby-generators\">Dispatchable Standby Generation</a>",
      "hidden_program_name": "Dispatchable Standby Generation",
      "hidden_program_link": "https://portlandgeneral.com/save-money/save-money-business/dispatchable-standby-generators",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Portland General Electric customers with standby generators may participate in the Dispatchable Standby Generation program, in which PGE can operate the generators during periods of peak demand. In exchange, PGE will pay for the fuel and maintenance of the generators, as well as any permits and necessary control and communications hardware.",
      "keywords": ""
    },
    {
      "state": "Pennsylvania",
      "utility _name": "FirstEnergy",
      "program_name": "<a href=\"https://firstenergycorp.com/save_energy/save_energy_pennsylvania/west_penn_power/for_your_business/commercial-industrial-demand-response.html\">Commercial and Industrial Demand Response Program</a>",
      "hidden_program_name": "Commercial and Industrial Demand Response Program",
      "hidden_program_link": "https://firstenergycorp.com/save_energy/save_energy_pennsylvania/west_penn_power/for_your_business/commercial-industrial-demand-response.html",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "FirstEnergy customers in the Met-Ed, Penn Power, and West Penn Power service areas can take advantage of their Commercial &amp; Industrial Demand Response Program, administered by CPower and EnerNOC Inc. Under the program, customers receive financial incentives by committing to reduce load for up to four consecutive hours on as many as six days (weekdays only) during the summer (June 1—September 30). Notification will always occur by 10 A.M. on the previous day.",
      "keywords": ""
    },
    {
      "state": "Rhode Island",
      "utility _name": "Rhode Island Energy",
      "program_name": "<a href=\"https://www.rienergy.com/RI-Business/Energy-Saving-Programs/ConnectedSolutions\">ConnectedSolutions</a>",
      "hidden_program_name": "ConnectedSolutions",
      "hidden_program_link": "https://www.rienergy.com/RI-Business/Energy-Saving-Programs/ConnectedSolutions",
      "open_to_customers": "Closed",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Rhode Island commercial customers of Rhode Island Energy can participate in the utility's ConnectedSolutions program, either through a curtailment service provider (CSP) or independently. Customers have two options: Summer Targeted Dispatch and Daily Dispatch. The Summer Targeted Dispatch option asks customers to reduce their demand during periods of peak demand in the summer months (June through September). There are typically two to eight periods per season, and each period lasts up to three hours. Customers are remunerated at $40/kW. The Daily Dispatch option is similar but occurs much more frequently, typically with 30 to 60 demand reduction periods (2-3 hours each) per summer season. Customers are remunerated at $300/kW. Rhode Island Energy's 2024-2025 Connected Solutions program is currently under review and pending approval. As of June 1, 2024 new applications and enrollments are no longer being accepting. Check Rhode Island Energy's website for the most up to date information.",
      "keywords": ""
    },
    {
      "state": "South Carolina",
      "utility _name": "Duke Energy Carolinas",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/energywise-business\">EnergyWise&reg; Business</a>",
      "hidden_program_name": "EnergyWise® Business",
      "hidden_program_link": "https://www.duke-energy.com/business/products/energywise-business",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Small and medium commercial customers in the Duke Energy Carolinas service area can enroll in the EnergyWise® Business program. Customers can save on energy costs by allowing Duke Energy to temporarily reduce energy consumption during times of high demand called \"conservation periods.\" Two enrollment options are available through EnergyWise® Business: 1) the summer Load Control program, in which customers receive annual credits of $50-135 per load control device depending on the reduction in AC operation, and 2) the winter Bring Your Own kW program, in which customers either manually or automatically reduce load during energy conservation periods in exchange for $30 per reduced average kW.",
      "keywords": ""
    },
    {
      "state": "South Carolina",
      "utility _name": "Duke Energy Carolinas",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/onsite-generation\">On-Site Generation Service Program</a>",
      "hidden_program_name": "On-Site Generation Service Program",
      "hidden_program_link": "https://www.duke-energy.com/business/products/onsite-generation",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "The On-Site Generation Service Program, available in the Duke Energy Carolinas service area, targets customers that do not currently own back-up generation but would like to. Duke will install, own, and operate new generators (300 kW or larger) for participants willing to let the company use them in times of grid stress or high wholesale prices. There is a monthly service fee for this rate based on the levelized cost to own and operate the equipment.",
      "keywords": ""
    },
    {
      "state": "South Carolina",
      "utility _name": "Duke Energy Carolinas",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/powershare\">Power Share</a>",
      "hidden_program_name": "Power Share",
      "hidden_program_link": "https://www.duke-energy.com/business/products/powershare",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Duke Energy Carolinas offers the PowerShare program, which provides financial incentives for reducing energy consumption levels during peak use periods. Customers may choose from a variety of curtailment options, including voluntary and mandatory load drops. The minimum curtailment is 100 kW. There are also options to participate with self-generation equipment and to tailor the program for the number of events your site is willing to participate in each year. Incentives range up to 8% off monthly bills for participating customers. Customers enrolled in the voluntary option are notified a day prior to curtailment events, while mandatory option customers receive minimum 30 minutes' advance notice. There are penalties for failure to perform under the mandatory and self-generation options. Note: customers located in the Duke Energy Progress area are not eligible for this program.",
      "keywords": ""
    },
    {
      "state": "South Carolina",
      "utility _name": "Duke Energy Progress",
      "program_name": "<a href=\"https://www.duke-energy.com/business/products/energywise-business\">EnergyWise&reg; Business</a>",
      "hidden_program_name": "EnergyWise® Business",
      "hidden_program_link": "https://www.duke-energy.com/business/products/energywise-business",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Small and medium commercial customers in both the Duke Energy Progress service area can enroll in the EnergyWise® Business program. Customers can save on energy costs by allowing Duke Energy to temporarily reduce energy consumption during times of high demand called \"conservation periods.\" Two enrollment options are available through EnergyWise® Business: 1) the summer Load Control program, in which customers receive annual credits of $50-135 per load control device depending on the reduction in AC operation, and 2) the winter Bring Your Own kW program, in which customers either manually or automatically reduce load during energy conservation periods in exchange for $30 per reduced average kW.",
      "keywords": ""
    },
    {
      "state": "South Dakota",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://sd.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings\">Electric Rate Savings Program</a>",
      "hidden_program_name": "Electric Rate Savings Program",
      "hidden_program_link": "https://sd.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy's Electric Rate Savings program is for customers willing to curtail load by at least 50 kW at Xcel's request during times of peak electric demand. In exchange, a monthly credit is applied to their utility bill. Peak demand typically occurs during the months of June through September; however, events may be called at any time during the year. Contact your Xcel Energy account manager or the Business Solutions Center at 1-800-481-4700 for more information.",
      "keywords": ""
    },
    {
      "state": "South Dakota",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://sd.my.xcelenergy.com/s/business/rate-plans/savers-switch\">Saver's Switch</a>",
      "hidden_program_name": "Saver's Switch",
      "hidden_program_link": "https://sd.my.xcelenergy.com/s/business/rate-plans/savers-switch",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy's Saver's Switch program offers participants a bill discount in exchange for allowing the utility to cycle participating air conditioning units on and off for 15- to 20-minute intervals during periods of peak electric demand. Peak demand events typically occur during summer months from June through September and occur 5-15 days per summer. Customers receive a monthly discount of $5/ton of enrolled air conditioning from June through September. A one-year commitment is required.",
      "keywords": ""
    },
    {
      "state": "South Dakota",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "South Dakota",
      "utility _name": "Otter Tail Power Company",
      "program_name": "<a href=\"https://www.otpco.com/ways-to-save/programs/coolsavings/\">CoolSavings Program</a>",
      "hidden_program_name": "CoolSavings Program",
      "hidden_program_link": "https://www.otpco.com/ways-to-save/programs/coolsavings/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Otter Tail customers can enroll in the CoolSavings  program which allows Otter Tail to manage their cooling usage during peak demand periods. The customer will receive a credit of $6 per ton of controlled load during the summer months (June to September).",
      "keywords": ""
    },
    {
      "state": "South Dakota",
      "utility _name": "Otter Tail Power Company",
      "program_name": "<a href=\"https://www.otpco.com/energy-control/\">Energy Control Options</a>",
      "hidden_program_name": "Energy Control Options",
      "hidden_program_link": "https://www.otpco.com/energy-control/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Otter Tail Power Company offers various energy control options that provide 25-50% rate cuts in exchange for allowing the utility to control specific equipment (such as domestic water heating or thermal storage) on their system during on-peak times. Customers can choose whether or not to be notified ahead of events.",
      "keywords": ""
    },
    {
      "state": "Tennessee",
      "utility _name": "Tennessee Valley Authority (TVA)",
      "program_name": "<a href=\"https://www.enelx.com/n-a/en/resources/brochures/tennessee-valley-authority-demand-response\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.enelx.com/n-a/en/resources/brochures/tennessee-valley-authority-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Tennessee Valley Authority (TVA)-Enel X Demand Response Program provides payments to participants in exchange for their agreement to reduce electricity consumption with 30 minutes' notice during times of exceptionally high demand. Demand response events may occur between 5 A.M. and 8 P.M. year-round. Enel-X collaborates with customers to create an optimal demand reduction plan. Interested customers should contact their local electricity distributor.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "AEP Texas",
      "program_name": "<a href=\"https://aeptexasefficiency.com/#/commercial/south-load-management\">Load Management Program</a>",
      "hidden_program_name": "Load Management Program",
      "hidden_program_link": "https://aeptexasefficiency.com/#/commercial/south-load-management",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "AEP provides the Texas Load Management Standard Offer Program to distribution customers who are prepared to curtail electric load with at least 30 minutes' notice. The program performance period is for one year, during which time customers receive one scheduled load interruption as well as up to four, eight or twelve unscheduled interruptions (depending on their agreement with AEP). The duration of unscheduled interruptions is based on the option chosen by the customer. For the summer peak period, customers eligible for this program must have a minimum load of 500 kW and be able to reduce by at least 5 kW. Interruptions during this period take place on weekdays from 1 to 7 P.M. starting on June 1st and ending September 30th. Incentives depend on the unscheduled interruptions option chosen and are based on verified demand savings that occur as a result of interruptions. During the winter period, customers must be able to reduce electric demand by at least 100 kW. Events may be called at any time of day or week during the program operating period from December 1st through February 28th.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "Austin Energy",
      "program_name": "<a href=\"https://savings.austinenergy.com/commercial/offerings/load-management/commercial-demand-response\">Commercial Demand Response</a>",
      "hidden_program_name": "Commercial Demand Response",
      "hidden_program_link": "https://savings.austinenergy.com/commercial/offerings/load-management/commercial-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Austin Energy's Commercial Demand Response program offers customers incentives for curtailing unnecessary load during peak demand periods, which occurs between 1 to 7 P.M. from June through September. Curtailment events last up to two hours and average about 20-25 events per year, with an annual maximum of 25 events. Customers have the option to enroll in either the Standard Demand Response program or the Fast Demand Response program. Standard DR provides an incentive of $50-$80 per kW curtailed and a 30-minute notice before each curtailment event. Customers in the Fast DR option receive an additional $5 to $10 more per kW incentive and ten minutes' notice before each curtailment event. Participants have free access to a web-based Energy Profiler Online, which can generate customer-specific reports on daily energy usage, peak demand, and power and load factor.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "Austin Energy",
      "program_name": "<a href=\"https://savings.austinenergy.com/rebates/commercial/offerings/cooling-and-heating/pp-thermostat\">Power Partner Program</a>",
      "hidden_program_name": "Power Partner Program",
      "hidden_program_link": "https://savings.austinenergy.com/rebates/commercial/offerings/cooling-and-heating/pp-thermostat",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Austin Energy customers can also enroll in the Power Partner Program when they allow the utility to make brief temperature adjustments of 2 to 4 degrees on their thermostats during times of peak demand. Customers must have an eligible Wi-Fi-enabled thermostat to participate and will receive an $50 bill credit plus $25 annually for each thermostat that remains enrolled. Power Partner events occur no more than 25 times per year, on weekdays between 3 to 6 P.M. from June through September.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "Center Point Energy",
      "program_name": "<a href=\"https://www.centerpointenergy.com/en-us/SaveEnergyandMoney/Pages/Load-Management-.aspx?sa=ho&amp;au=bus\">Load Management Program</a>",
      "hidden_program_name": "Load Management Program",
      "hidden_program_link": "https://www.centerpointenergy.com/en-us/SaveEnergyandMoney/Pages/Load-Management-.aspx?sa=ho&amp;au=bus",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "CenterPoint Energy's Commercial Load Management Program provides up to $30.00/kW to participants for curtailing load during two scheduled curtailments of 1 to 3 hours plus up to four unscheduled peak events lasting a maximum of four hours each. The available curtailment periods are summer weekdays (June 1-September 30) between 1-7 P.M. Participants must agree to curtail at least 100 kW per site. Aggregators (e.g., ESCOs or curtailment service providers) can also participate in the program.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "CPS Energy",
      "program_name": "<a href=\"https://www.cpsenergy.com/en/my-business/savenow/comm-dr.html\">Commercial Demand Response </a>",
      "hidden_program_name": "Commercial Demand Response",
      "hidden_program_link": "https://www.cpsenergy.com/en/my-business/savenow/comm-dr.html",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Commercial and Industrial CPS Energy customers can enroll in their Demand Response program. Incentives are based on verified performance during peak events, which occur between 1 and 7 p.m. on weekdays from June 1 to September 30. Events typically last three hours and occur approximately 25 times per year. Customers will receive either two hours' or 30 minutes' notice (based on customer choice) before each curtailment event.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "CPS Energy",
      "program_name": "<a href=\"https://www.cpsenergy.com/en/my-home/savenow/my-thermostat-rewards.html?linkvar=new-mainhero\">Summer DR Program</a>",
      "hidden_program_name": "Summer DR Program",
      "hidden_program_link": "https://www.cpsenergy.com/en/my-home/savenow/my-thermostat-rewards.html?linkvar=new-mainhero",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "CPS Energy offers a Summer DR program to help customers save money and manage energy usage during peak summer months. Customers with a Wi-Fi enabled smart thermostat, can enroll in the program and allow CPS Energy to make small adjustments to their thermostat settings during peak demand periods, typically weekdays between 1 pm and 10 pm, Monday through Friday. Customers will receive an $85 rebate for each thermostat enrolled plus an additional $30 per each additional year enrolled.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "Entergy Texas",
      "program_name": "<a href=\"https://www.entergy-texas.com/your_business/save_money/ee/load-management/\">Load Management Program</a>",
      "hidden_program_name": "Load Management Program",
      "hidden_program_link": "https://www.entergy-texas.com/your_business/save_money/ee/load-management/",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Entergy Texas Load Management Program offers $32.50/kW for participation in one scheduled curtailment event which lasts one hour, and up to four unscheduled events that last a maximum of four hours. Curtailments occur during the summer from June through September, from 1 to 7 P.M on weekdays. Customers must be able to curtail at least 250 kW to be eligible. Enrollment in this program is limited and typically ends the last day of April.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "Oncur",
      "program_name": "<a href=\"https://www.oncor.com/us/en/home/partners/eepm-home/commercial-provider/load-management-program.html\">Commercial Load Management Program</a>",
      "hidden_program_name": "Commercial Load Management Program",
      "hidden_program_link": "https://www.oncor.com/us/en/home/partners/eepm-home/commercial-provider/load-management-program.html",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Oncor's Commercial Load Management Program provides remuneration directly to service contractors (e.g., ESCOs, aggregators, energy efficiency service providers, retail electric providers, and utility customers themselves) to reduce energy use in facilities during peak demand periods from June 1 through September 30, between 1 and 7 P.M. Eligible facilities must be able to curtail at least 100 kW with 30 minutes' notice.",
      "keywords": ""
    },
    {
      "state": "Texas",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://tx.my.xcelenergy.com/s/business/rate-plans/savers-switch\">Saver's Switch Program</a>",
      "hidden_program_name": "Saver's Switch Program",
      "hidden_program_link": "https://tx.my.xcelenergy.com/s/business/rate-plans/savers-switch",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy's Saver's Switch Program provides savings on cooling costs by letting Xcel install a remote-controlled switch on air-conditioning units that cycle them on and off for brief 15- to 20-minute intervals for an average of four hours during times of peak demand. These load control events typically occur between late mornings and evenings on the hottest five to fifteen summer days. In addition to bill savings, customers receive a discount of $20 per ton of enrolled air conditioning on their October bills.",
      "keywords": ""
    },
    {
      "state": "Utah",
      "utility _name": "Rocky Mountain Power",
      "program_name": "<a href=\"https://www.rockymountainpower.net/savings-energy-choices/business/irrigation-load-control.html\">Irrigation Load Control</a>",
      "hidden_program_name": "Irrigation Load Control",
      "hidden_program_link": "https://www.rockymountainpower.net/savings-energy-choices/business/irrigation-load-control.html",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Rocky Mountain Power's Irrigation Load Control Program offers financial incentives to irrigators who agree to curtail electricity use during peak demand periods. Irrigators choose which sites to enroll in the program and which load control option best suits their needs. Rocky Mountain Power's third-party vendor, EnelX, then installs a device that allows customers to access an online portal to monitor usage and control their demand. Compensation is determined by multiplying the average load (kW) a customer can reliably shut-off during program hours by the incentive rate, adjusted for event participation. The incentive rate is set by customers' average expected kW per pump. The program runs from June 1 through August 15 (voluntary events may be dispatched separately, from June 1 to September 30). Events can be called only during weekdays from 2 to 9 P.M. The utility is limited to 52 event-hours (and no more than 12 event-hours in any given week). Customers receive notification at least four hours prior to the event.",
      "keywords": ""
    },
    {
      "state": "Virginia",
      "utility _name": "Dominion Energy",
      "program_name": "<a href=\"https://www.dominionenergy.com/virginia/save-energy/targeted-sector-programs#distributed\">Non-Residential Distributed Generation Program</a>",
      "hidden_program_name": "Non-Residential Distributed Generation Program",
      "hidden_program_link": "https://www.dominionenergy.com/virginia/save-energy/targeted-sector-programs#distributed",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "Yes",
      "description": "Dominion Energy's Non-Residential Distributed Generation Program offers a monthly incentive for customers who have backup generators and allow the company to remotely activate them during load curtailment events. Backup generators must be at least 200 kW to participate in the program. Participants agree to have their generators operated up to 120 hours per year. Curtailment events are called with at least 30 minutes notice and can last between 4-6 hours. The monthly incentive depends on the amount of load reduced and the energy usage during events.",
      "keywords": ""
    },
    {
      "state": "Virginia",
      "utility _name": "Tennessee Valley Authority (TVA)",
      "program_name": "<a href=\"https://www.enelx.com/n-a/en/faq/eindustry/tennessee-valley-authority-demand-response\">Demand Response Program</a>",
      "hidden_program_name": "Demand Response Program",
      "hidden_program_link": "https://www.enelx.com/n-a/en/faq/eindustry/tennessee-valley-authority-demand-response",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The TVA-Enel X Demand Response Program provides payments to TVA customers in exchange for agreeing to reduce electricity consumption with 30 minutes notice during times of exceptionally high demand. Demand response events may occur year-round from 5 A.M. to 8 P.M. CT. Enel X collaborates with customers to create an optimal demand reduction plan. Demand response efforts typically involve curtailing energy usage of such equipment as lighting, chillers, pumps and HVAC equipment. Interested customers should contact their local electricity distributor.",
      "keywords": ""
    },
    {
      "state": "Wisconsin",
      "utility _name": "MISO",
      "program_name": "<a href=\"https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc\">Demand Response Offerings</a>",
      "hidden_program_name": "Demand Response Offerings",
      "hidden_program_link": "https://www.misoenergy.org/markets-and-operations/#nt=%2Fmarketsandopstype%3ADemand%20Response&amp;t=10&amp;p=0&amp;s=FileName&amp;sd=desc",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "The Midcontinent Independent System Operator (MISO) enables commercial entities with demand response capabilities to bid into both its electricity supply-side and demand-side markets. These arrangements are bids, not \"programs\" in the traditional sense of providing incentives or bill credits for moderating or shifting loads; MISO (and some other ISOs/RTOs) operate markets where demand flexibility can reap revenue when those resources (e.g., storage, curtailment, demand shifted away from peak demand hours) can compete economically as generators or reductions in demand. MISO uses its markets to ensure resource adequacy and reliability in the region; DR participants are compensated when they deliver a promised reduction in load or use of onsite generation that is less costly than the next increment of supply at that node. Interested businesses can get acquainted with MISO's demand response markets through a recent workshop (https://cdn.misoenergy.org/20240510%20Demand%20Response%20101%20Workshop%20Presentation632828.pdf) and can register their rsources to participate in the markets via a MISO DR tool (https://cdn.misoenergy.org/Demand%20Response%20Tool%20User%20Guide177286.pdf).",
      "keywords": ""
    },
    {
      "state": "Wisconsin",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://wi.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings\">Electric Rate Savings</a>",
      "hidden_program_name": "Electric Rate Savings",
      "hidden_program_link": "https://wi.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy's Electric Rate Savings program is for customers willing to curtail load by at least 50 kW at Xcel's request during times of peak electric demand. In exchange, a monthly credit is applied to customers' utility bills. Peak demand typically occurs during the months of June through September; however, events may be called at any time during the year. Contact the Xcel Business Solutions Center at 1-800-481-4700 for more information.",
      "keywords": ""
    },
    {
      "state": "Wisconsin",
      "utility _name": "Xcel Energy",
      "program_name": "<a href=\"https://wi.my.xcelenergy.com/s/business/rate-plans/savers-switch\">Saver's Switch </a>",
      "hidden_program_name": "Saver's Switch",
      "hidden_program_link": "https://wi.my.xcelenergy.com/s/business/rate-plans/savers-switch",
      "open_to_customers": "Open",
      "program_or_rate": "Program",
      "areawide_contract": "No",
      "description": "Xcel Energy's Saver's Switch offers program participants a bill discount in exchange for allowing the utility to cycle participating air conditioning units on and off for 15- to 20-minute intervals during periods of peak electric demand.  Customers receive a monthly discount of $3 per kW of enrolled air conditioning. Peak demand events typically occur during summer months from June through September and occur 5-15 days per summer.",
      "keywords": ""
    }
  ]
}