{
  "program_id": "ENTERGY_NOLA_ENERGY_SMART_ADR_2025",
  "program_name": "Energy Smart Large Commercial Automated Demand Response Program",
  "program_type": "utility",
  "status": "active",
  "description": "Entergy New Orleans' Energy Smart Large Commercial Automated Demand Response Program rewards organizations that reduce electricity use during peak demand periods. Managed by Honeywell Smart Energy using the Enbala Virtual Power Plant engine and DemandSites suite of solutions. The program uses fully automated demand response to manage energy consumption and support the grid during periods of peak energy demand. Customers earn twice-yearly cash payments: up to $50/kW during summer (June-September) and up to $10/kW during non-summer periods. Three-year contract initiated in August 2020. No cost or obligation to participate, and customers can opt out before or during events without penalties. 24-hour advance event notifications. Separate residential battery storage pilot program (Phase 1: 30 customers, Phase 2: up to 140 customers including 15 small commercial) launched 2022-2024.",
  "geography": {
    "states": ["LA"],
    "utilities": ["Entergy New Orleans"],
    "isos": [],
    "iso_notes": "Entergy New Orleans is a municipal utility serving New Orleans city limits only. Not directly part of wholesale ISO markets like MISO for demand response purposes. Separate from Entergy Louisiana which serves surrounding areas and participates in MISO.",
    "service_territories": [
      "New Orleans city limits only (Orleans Parish)"
    ],
    "zone_designation": null,
    "regional_notes": "New Orleans is unique as the only city in the United States to regulate an investor-owned energy utility when there is a state level agency in place. Entergy New Orleans is regulated by the New Orleans City Council, not the Louisiana Public Service Commission. Post-Hurricane Ida (August 2021) context critical: entire city lost power, 10-day restoration, 10 heat-related deaths, major grid resilience investments underway. $1 billion 10-year resilience plan filed post-Ida. Hurricane-prone location makes backup power and grid resilience high priority. Peak summer demand approximately 1,200 MW (2023).",
    "regulatory_authority": "New Orleans City Council (Utility, Cable, Telecommunications and Technology Committee)",
    "regulatory_notes": "Municipal utility jurisdiction - not regulated by Louisiana PSC. City Council approves all program changes via Council Resolutions and Dockets."
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "residential_max_kw": null,
      "commercial_min_kw": null,
      "size_threshold_notes": "Program is designated 'Large Commercial' but specific minimum kW threshold not publicly disclosed. Must contact program directly at 504-784-0640 or adr@energysmartnola.com for eligibility determination. Eligible sectors include: educational institutions, large box retail, large commercial, office space, hospitals and healthcare, hotels, government, multi-family and apartments. Example participant: Mount Carmel Academy (1,200 students, 9-acre campus) joined 2021 and earned $51,237 in incentives since joining. New Orleans & Company (tourism marketing organization) also participant."
    },
    "behind_the_meter": true,
    "front_of_meter": false,
    "behind_the_meter_notes": "Program focuses on automated load reduction at customer facilities. Separate Battery Storage Demand Response Pilot Program exists for residential and small commercial customers with solar-connected smart battery systems. Phase 1 (May-September 2023): 30 residential customers. Phase 2 (approved April 2024): up to 140 customers (125 residential + 15 small commercial). Battery pilot managed by Honeywell, partners with Tesla and Enphase. For battery storage information: entergyno-vpp@energyhub.net. Unclear if large commercial behind-the-meter batteries can participate in Large Commercial ADR program - battery pilot currently residential/small commercial focus.",
    "minimum_capacity_kw": null,
    "minimum_capacity_notes": "Minimum capacity requirement not publicly disclosed. Program materials emphasize 'free, no-obligation survey shows you exactly how and what your kW commitment level looks like.' Suggests flexible enrollment based on individual facility assessment rather than hard minimum threshold. Must contact program for eligibility determination.",
    "maximum_capacity_kw": null,
    "resource_types": [
      "HVAC controls (primary)",
      "lighting controls",
      "industrial process modification",
      "facility load management",
      "automated building management systems",
      "battery storage (separate pilot program for residential/small commercial only)"
    ],
    "requires_aggregator": false,
    "aggregator_required_notes": "Program is managed directly by Entergy New Orleans through third-party administrator Honeywell Smart Energy (three-year contract from August 2020). Honeywell handles design, marketing, enrollment, and deployment. Customers enroll directly with Entergy New Orleans/Energy Smart program, not through independent aggregators. Honeywell uses Enbala Virtual Power Plant engine integrated with DemandSites suite of solutions.",
    "technology_requirements": "Automated demand response solutions with minimal operational impact. Advanced solutions are preprogrammed to ensure consistent performance and maximum energy savings. No on-site personnel input required to participate. Energy measures installed and programmed to facility specifications and needs. Real-time monitoring capabilities. Must be able to receive 24-hour advance event notifications. Ability to opt out before or adjust facility zones during events."
  },
  "programs": [
    {
      "program_name": "Large Commercial Automated Demand Response",
      "program_type": "utility_managed",
      "status": "active",
      "description": "Primary commercial/industrial demand response program managed by Honeywell Smart Energy. Uses automated demand response with preprogrammed solutions for consistent performance. Twice-yearly cash incentive payments based on kW commitment levels. Voluntary participation with no penalties for non-performance or opt-outs.",
      "payment_structure": {
        "has_capacity_payment": true,
        "capacity_payment_notes": "Payments made twice yearly (appears to be semi-annual settlement, not monthly). Payment is capacity-style compensation based on enrolled kW commitment level, not purely event performance.",
        "has_performance_payment": false,
        "performance_payment_notes": "No separate performance or curtailment payments disclosed. Incentive structure is 'up to $50/kW summer' and 'up to $10/kW non-summer' suggesting payments based on committed capacity with performance expectation, but no additional per-event or per-MWh payments mentioned.",
        "capacity_rate": {
          "unit": "$/kW",
          "varies_by_season": true,
          "varies_by_zone": false,
          "determination_method": "Set by Entergy New Orleans and approved by New Orleans City Council",
          "seasonal_rates": [
            {
              "season": "Summer (June 1 - September 30)",
              "rate": 50,
              "unit": "$/kW",
              "rate_qualifier": "up to",
              "payment_frequency": "twice yearly",
              "notes": "Peak demand season in New Orleans. Hot, humid summer drives air conditioning load. Maximum rate available."
            },
            {
              "season": "Non-summer (October 1 - May 31)",
              "rate": 10,
              "unit": "$/kW",
              "rate_qualifier": "up to",
              "payment_frequency": "twice yearly",
              "notes": "Lower demand off-peak season. Significantly lower incentive than summer."
            }
          ],
          "notes": "Rates stated as 'up to' values - actual payment may depend on participation levels, performance, or other factors not publicly disclosed. Contact program for exact payment structure. Annualized revenue estimate (if achieving maximum rates both seasons): Summer (4 months × $50/kW ÷ 12 months/year × 12 = $200/kW annual summer component) + Non-summer (8 months × $10/kW ÷ 12 months/year × 12 = $80/kW annual non-summer component) = approximately $280/kW annually if achieving maximum rates. However, 'up to' qualifier suggests this is maximum, not guaranteed."
        },
        "payment_timing": "Twice-yearly cash payments",
        "payment_method": "Cash payments",
        "penalty_structure": {
          "has_penalties": false,
          "penalty_description": "No penalties for non-performance. Customers can opt out before scheduled adjustment events, as they are taking place, or adjust facility zones during an event - at your convenience and comfort without penalties.",
          "penalty_notes": "Voluntary program with no penalties. However, payments may be reduced if committed capacity not available - 'up to' rate structure suggests performance may affect payment amount even if not framed as penalties."
        }
      },
      "eligibility": {
        "minimum_capacity_kw": null,
        "minimum_capacity_notes": "Not publicly disclosed. Free facility survey determines kW commitment level.",
        "customer_types": [
          "Educational institutions",
          "Large box retail",
          "Large commercial",
          "Office space",
          "Hospitals and healthcare",
          "Hotels",
          "Government",
          "Multi-family and apartments"
        ],
        "battery_suitability": "Unclear for large commercial batteries. Separate Battery Storage Demand Response Pilot Program exists but currently limited to residential (125 customers) and small commercial (15 customers) with solar-connected smart battery systems. Large commercial behind-the-meter battery eligibility for main ADR program not explicitly stated. Batteries would need to integrate with Honeywell automated DR platform. Contact entergyno-vpp@energyhub.net for battery storage eligibility. Hurricane-prone New Orleans creates strong case for battery storage providing dual benefit: DR revenue + backup power during outages (critical post-Hurricane Ida)."
      },
      "event_parameters": {
        "event_type": "Peak demand adjustment",
        "trigger_conditions": "Called during peak energy demand periods on the grid. Typically on especially hot days during summer. Events will not occur on weekends or holidays unless Entergy New Orleans is experiencing emergency grid conditions.",
        "notification_time_hours": 24,
        "notification_methods": [
          "Automatic notifications 24 hours before adjustment event",
          "Email",
          "Text"
        ],
        "typical_events_per_year": "At least 1, maximum 15",
        "event_frequency_notes": "Enrolled customers can anticipate at least one adjustment and a maximum of 15 adjustments per summer season (June-September). Appears events concentrated in summer period when peak demand highest.",
        "maximum_events_per_year": 15,
        "maximum_duration_per_event_hours": 4,
        "typical_duration_hours": "2-4",
        "event_duration_notes": "Events normally last 2-4 hours. Demand response events will last no longer than four hours.",
        "opt_out_allowed": true,
        "opt_out_notes": "Customers can opt out before scheduled adjustment events, as they are taking place, or adjust facility zones during an event without penalties. Real-time flexibility to manage participation.",
        "seasonal_concentration": "Summer (June 1 - September 30)",
        "time_of_day": "Peak demand periods, typically afternoon/early evening during hot days",
        "weekend_holiday_events": "Events will not occur on weekends or holidays unless Entergy New Orleans is experiencing emergency grid conditions"
      },
      "performance_measurement": {
        "testing_requirements": "Not publicly disclosed",
        "baseline_calculation": "Not publicly disclosed. Free facility survey establishes kW commitment level baseline.",
        "baseline_methodology": "Unknown - not specified in public program materials. Contact program for details.",
        "metering_requirements": "Real-time monitoring capabilities mentioned. Specific metering equipment requirements not disclosed. Honeywell DemandSites platform provides monitoring.",
        "measurement_interval": "Unknown",
        "audit_rights": "Not disclosed in public materials"
      },
      "registration": {
        "registration_process": "1) Call 504-784-0640 or email adr@energysmartnola.com 2) Free, no-obligation facility survey conducted 3) Survey shows exactly how and what kW commitment level looks like 4) Energy measures installed and programmed to facility specifications 5) Automated notifications set up",
        "registration_deadline": "None specified - appears to be open enrollment",
        "contract_length": "Not disclosed in customer-facing materials. Honeywell TPA contract is three years (initiated August 2020).",
        "early_termination": "Can opt out anytime - no cost or obligation"
      }
    },
    {
      "program_name": "Battery Storage Demand Response Pilot Program",
      "program_type": "pilot_vpp",
      "status": "active_phase_2",
      "description": "Pilot program for residential and small commercial customers with solar-connected smart battery systems. Phase 1 (May-September 2023): 30 residential customers. Phase 2 (approved April 2024, City Council Resolution R-24-119): up to 140 customers (125 residential + 15 small commercial). Managed by Honeywell. Partners with battery manufacturers including Tesla and Enphase. Five-month pilot (May-September coinciding with summer peak demand season). Costs recovered through Energy Efficiency Cost Recovery Rider (Rider EECR).",
      "payment_structure": {
        "has_capacity_payment": true,
        "capacity_payment_notes": "Participants receive incentives for enrolling and participating in demand response events. Residential customers can earn up to $600 (referenced in some materials). Exact small commercial incentive structure not disclosed.",
        "has_performance_payment": true,
        "performance_payment_notes": "Payment structure includes both enrollment incentive and participation in demand response events.",
        "penalty_structure": {
          "has_penalties": false,
          "penalty_notes": "Pilot program - penalty structure not disclosed"
        }
      },
      "eligibility": {
        "customer_classes_eligible": [
          "Residential (125 customers Phase 2)",
          "Small commercial (15 customers Phase 2)"
        ],
        "large_commercial_eligible": false,
        "system_requirements": "Existing solar-connected smart battery systems or newly installed systems eligible in Phase 2",
        "battery_manufacturers": ["Tesla", "Enphase"],
        "capacity_limit": "140 total customers (125 residential + 15 small commercial) in Phase 2",
        "battery_suitability": "Program specifically designed for behind-the-meter battery storage. Residential and small commercial only. Large commercial battery eligibility unclear - contact entergyno-vpp@energyhub.net for information."
      },
      "event_parameters": {
        "event_type": "Peak demand periods",
        "pilot_period": "Five months (May 1 - September 30)",
        "notification_time_hours": null,
        "event_parameters_notes": "Specific event notification time, frequency, and duration not disclosed in public materials. Phase 1 pilot report was due December 1, 2023 to New Orleans City Council with results - report not publicly available in research."
      },
      "registration": {
        "registration_contact": "entergyno-vpp@energyhub.net",
        "website": "energysmartbatterystorage.com (URL inaccessible during research)",
        "capacity_limit": "140 customers Phase 2",
        "registration_status": "Phase 2 approved and under implementation (Energy Smart Program Year 14)"
      },
      "regulatory_approval": {
        "phase_1_docket": "UD-22-03",
        "phase_1_resolution": "R-22-266 (established docket)",
        "phase_1_approval_resolution": "R-22-483 (November 3, 2022)",
        "phase_1_report_due": "December 1, 2023",
        "phase_2_application_date": "Not specified",
        "phase_2_approval_resolution": "R-24-119 (April 4, 2024)",
        "phase_2_implementation": "Energy Smart Program Year 14"
      }
    }
  ],
  "notification": {
    "notification_time_hours": 24,
    "notification_methods": [
      "Automatic notifications",
      "Email",
      "Text messages"
    ],
    "notification_notes": "24-hour advance event notifications for Large Commercial ADR program. Battery pilot program notification parameters not publicly disclosed."
  },
  "seasons": [
    {
      "season_name": "Summer Peak Period",
      "typical_months": "June - September",
      "start_date": "June 1",
      "end_date": "September 30",
      "incentive_rate": 50,
      "incentive_rate_unit": "$/kW",
      "peak_demand_driver": "Extreme heat and humidity driving air conditioning load in New Orleans. Coincides with hurricane season (June 1 - November 30).",
      "event_frequency": "At least 1, maximum 15 events during summer season",
      "notes": "Primary DR season. New Orleans summer is hot and humid with temperatures regularly exceeding 90°F. Hurricane Ida struck August 29, 2021 causing total power loss citywide. Summer resilience critical. Battery Storage Pilot Program operates May-September (5 months) coinciding with peak risk period."
    },
    {
      "season_name": "Non-Summer Period",
      "typical_months": "October - May",
      "start_date": "October 1",
      "end_date": "May 31",
      "incentive_rate": 10,
      "incentive_rate_unit": "$/kW",
      "peak_demand_driver": "Lower demand season. New Orleans has mild winters. Occasional cold snaps but minimal heating load compared to summer cooling.",
      "event_frequency": "Not specified - appears events primarily concentrated in summer",
      "notes": "Significantly lower incentive rate (80% reduction vs summer). Events less frequent or may not occur. Hurricane season extends into October-November (official season ends November 30)."
    }
  ],
  "historical_events": [
    {
      "event_type": "Hurricane Ida Impact",
      "date": "2021-08-29",
      "description": "Hurricane Ida struck southeast Louisiana with 150 mph winds, causing total power loss across entire city of New Orleans. Took 10 days until restoration nearly complete. 10 people died due to excessive heat during outage. Damaged 30,000+ distribution utility poles. Major portions of electric system had to be completely rebuilt. Prompted $1 billion 10-year resilience plan and acceleration of grid hardening investments.",
      "dr_program_impact": "Highlighted critical need for distributed energy resources including behind-the-meter battery storage for resilience. Led to Battery Storage Demand Response Pilot Program (approved March 2022, launched May 2023). Demonstrated vulnerability of centralized grid. Created policy support for demand response and DER programs as resilience measures.",
      "lessons_learned": "Battery storage with backup power capability provides dual benefit: DR revenue + critical resilience during extended outages. New Orleans' hurricane risk makes battery storage particularly valuable compared to inland locations."
    },
    {
      "event_type": "Energy Smart Program Launch",
      "date": "2024-03",
      "description": "Energy Smart program launched new website to improve customer access and enrollment. Program has paid more than $39 million in incentives to more than 98,000 participants, saving customers nearly 325 million kWh since inception.",
      "notes": "Comprehensive energy efficiency and demand response program administered by Entergy New Orleans. Developed by New Orleans City Council."
    },
    {
      "event_type": "Honeywell Contract Award",
      "date": "2020-08",
      "description": "Entergy New Orleans awarded three-year contract to Honeywell to manage Large Commercial & Industrial Demand Response program. Honeywell manages design, marketing, enrollment, and deployment. Uses Enbala Virtual Power Plant engine integrated with DemandSites suite of solutions.",
      "notes": "Represents shift to third-party administrator model with sophisticated automated DR technology platform."
    }
  ],
  "historical_events_note": "Specific demand response event call history (dates, times, durations, actual events called 2022-2024) not publicly available. Program emphasizes 'maximum 15 events per summer' but actual historical frequency not disclosed. Mount Carmel Academy case study shows $51,237 earned since joining in 2021 but does not break down by event. Contact program at 504-784-0640 for historical performance data.",
  "data_sources": [
    {
      "source_name": "Energy Smart ADR Website",
      "url": "https://www.energysmartadr.com/",
      "last_updated": "2024",
      "data_type": "program_rules"
    },
    {
      "source_name": "Energy Smart NOLA Website",
      "url": "https://energysmartnola.info/",
      "last_updated": "2024",
      "data_type": "program_rules"
    },
    {
      "source_name": "Entergy New Orleans Demand Response Technologies Press Release",
      "url": "https://www.entergy.com/news/entergy-new-orleans-helps-meet-electricity-demand-with-demand-response-technologies/",
      "last_updated": "not specified",
      "data_type": "program_overview"
    },
    {
      "source_name": "Honeywell Entergy New Orleans Contract Press Release",
      "url": "https://www.powermag.com/press-releases/honeywell-to-support-entergy-new-orleans-commercial-demand-response-goals/",
      "last_updated": "2020-08",
      "data_type": "program_administration"
    },
    {
      "source_name": "Mount Carmel Academy Case Study",
      "url": "https://www.entergy.com/blog/mount-carmel-academy-champions-energy-efficiency-through-entergy-new-orleans-energy-smart-program",
      "last_updated": "not specified",
      "data_type": "case_study"
    },
    {
      "source_name": "New Orleans City Council Battery Storage Docket UD-22-03",
      "url": "https://council.nola.gov/committees/smart-and-sustainable-cities-committee/dockets/resolution-and-order-establishing-a-docket-and-(1)/",
      "last_updated": "2024-04",
      "data_type": "regulatory_filing"
    },
    {
      "source_name": "Alliance for Affordable Energy - UD-22-03 Battery Storage",
      "url": "https://www.all4energy.org/ud-22-03.html",
      "last_updated": "2024",
      "data_type": "regulatory_analysis"
    },
    {
      "source_name": "ProPublica/NPR Hurricane Ida Investigation",
      "url": "https://www.npr.org/2021/09/22/1039110522/entergy-resisted-upgrading-new-orleans-power-grid-residents-paid-the-price",
      "last_updated": "2021-09-22",
      "data_type": "historical_context"
    },
    {
      "source_name": "Entergy New Orleans Resilience Plan",
      "url": "https://www.entergy.com/news/first-phase-entergy-new-orleans-resilience-plan-granted-city-council-approval",
      "last_updated": "not specified",
      "data_type": "grid_planning"
    },
    {
      "source_name": "Energy Smart Program Performance Statistics",
      "url": "https://www.entergy.com/blog/energy-smart-pays-customers-reduce-energy-usage-at-no-cost-join",
      "last_updated": "not specified",
      "data_type": "program_statistics"
    },
    {
      "source_name": "New Orleans Regulatory Structure Article",
      "url": "https://thelensnola.org/2019/12/26/after-35-years-utility-regulation-in-new-orleans-is-beginning-to-change/",
      "last_updated": "2019-12-26",
      "data_type": "regulatory_context"
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": true,
    "optimizer_notes": "Entergy New Orleans Large Commercial ADR program has moderate compatibility with battery optimization. Strengths: (1) Simple capacity-style payment structure ($50/kW summer, $10/kW non-summer) provides predictable revenue stream, (2) 24-hour advance notice allows optimization planning, (3) Limited event frequency (max 15/year) minimizes disruption to other revenue streams (arbitrage, ancillary services if in ERCOT), (4) No penalties for opt-outs provides operational flexibility, (5) 2-4 hour event duration matches typical battery discharge capability. Challenges: (1) 'Up to' rate qualifier creates revenue uncertainty - actual payments may be lower than maximum, (2) Minimum kW threshold unknown - enrollment eligibility requires facility assessment, (3) Large commercial behind-the-meter battery eligibility unclear - battery pilot currently limited to residential/small commercial, (4) Baseline methodology not disclosed, (5) Performance measurement not transparent, (6) Municipal utility program - not integrated with wholesale markets (no MISO LMPs or ancillary services stacking), (7) Relatively low revenue potential vs wholesale market programs. Revenue estimate (if 1 MW enrolled at maximum rates): Summer $50,000 (50 $/kW × 1000 kW) + Non-summer $10,000 = $60,000 annual, but 'up to' qualifier suggests lower actual payments possible. Best use case: Behind-the-meter battery primarily for backup power and customer bill management with ADR as supplemental revenue stream, particularly valuable in hurricane-prone New Orleans.",
    "api_available": false,
    "api_notes": "Managed through Honeywell DemandSites platform with automated control. Customer-level API access not mentioned. Automated notifications via email/text. Real-time monitoring provided by Honeywell platform. Integration would likely require coordination with Honeywell and Entergy New Orleans.",
    "api_documentation_url": null,
    "data_quality_score": 6.0,
    "data_quality_explanation": "Moderate data quality. Strengths: Clear seasonal incentive rates ($50/kW summer, $10/kW non-summer), well-documented event parameters (24hr notice, 2-4hr duration, max 15 events), clear program administration structure (Honeywell TPA), good regulatory documentation for battery pilot (Council resolutions and dockets), strong contextual information (Hurricane Ida, resilience plans, peak demand ~1,200 MW). Weaknesses: (1) 'Up to' rate qualifier creates uncertainty about actual payment amounts, (2) No minimum kW threshold disclosed, (3) No baseline methodology disclosed, (4) No historical event call data (actual frequency 2022-2024 unknown), (5) Large commercial battery eligibility unclear, (6) Performance measurement and audit procedures not disclosed, (7) Tariff documents not accessible (referenced as 'on file with City Council'), (8) Battery pilot Phase 1 results report (due December 2023) not publicly available, (9) Energy Smart Battery Storage website inaccessible during research. Missing data requires direct contact with program (504-784-0640, adr@energysmartnola.com). Municipal utility with less transparent public data compared to ISO programs or larger utilities with PSC oversight.",
    "last_verified_date": "2025-10-11",
    "battery_suitability_overall": "Moderate to good suitability with caveats. For residential/small commercial batteries: Good fit via dedicated Battery Storage Pilot Program (Phase 2: 140 customers including 15 small commercial, solar-connected systems, partners with Tesla/Enphase). For large commercial batteries: Unclear eligibility for Large Commercial ADR program. Battery Storage Pilot explicitly excludes large commercial currently. Large commercial behind-the-meter battery participation pathway undefined - requires direct inquiry with program. Value proposition strongest when combining DR revenue with other benefits: (1) Backup power during hurricanes (critical post-Hurricane Ida), (2) Customer bill reduction through demand charge management and time-of-use optimization, (3) ADR incentives as supplemental revenue ($50/kW summer). Hurricane resilience benefit potentially worth more than DR revenue in New Orleans context (10 days without power during Ida, heat-related deaths). Battery specifications: Solar-connected systems emphasized in pilot program. 2-4 hour discharge duration aligns with event parameters. 24-hour advance notice allows state-of-charge management. Limited event frequency (max 15/year, concentrated in summer June-September) minimizes cycling impact. No penalties for non-performance reduces availability risk. Revenue potential lower than wholesale market programs (ERCOT, MISO) but program simplicity and hurricane backup value may compensate.",
    "recommended_strategies": [
      "For residential/small commercial: Enroll in Battery Storage Demand Response Pilot Program (Phase 2) - contact entergyno-vpp@energyhub.net",
      "For large commercial: Contact program (504-784-0640, adr@energysmartnola.com) to determine behind-the-meter battery eligibility before investing",
      "Emphasize dual-purpose battery deployment: DR revenue + hurricane backup power (critical differentiator in New Orleans)",
      "Request free facility survey to determine kW commitment level and actual payment structure (resolve 'up to' rate uncertainty)",
      "Plan for summer-concentrated events (June-September) - ensure battery available during peak heat/hurricane season",
      "Use 24-hour advance notice for state-of-charge optimization - pre-charge battery ahead of called events",
      "Leverage opt-out flexibility - skip events when customer backup power needs or arbitrage opportunities exceed DR value",
      "Stack revenue streams: DR incentives + demand charge reduction + time-of-use bill savings + backup power value",
      "Consider solar + storage given pilot program emphasis on solar-connected systems",
      "Monitor Phase 1 pilot results when published - may inform large commercial battery pathway development",
      "Advocate to New Orleans City Council for large commercial battery inclusion in future program phases",
      "If ineligible for Entergy New Orleans program, consider MISO wholesale market participation via Entergy Louisiana for facilities outside city limits"
    ],
    "notes": "Entergy New Orleans operates unique municipal utility DR program separate from surrounding Entergy Louisiana (which participates in MISO wholesale markets). New Orleans City Council regulation provides local control but results in less standardized program structure and lower public transparency vs PSC-regulated utilities. Hurricane Ida fundamentally changed New Orleans energy landscape - grid resilience now top priority with $1B 10-year investment plan. Behind-the-meter battery storage has elevated strategic importance for resilience beyond traditional DR economics. Battery Storage Pilot Program (30 customers Phase 1, 140 customers Phase 2) shows utility commitment to DER integration. Program administered by sophisticated third-party (Honeywell with Enbala VPP platform) suggests technical capability for advanced battery integration, but current focus on residential/small commercial. Large commercial battery participation pathway needs clarification. Revenue potential moderate ($50/kW summer, $10/kW non-summer with 'up to' qualifier) compared to wholesale market programs but program simplicity and hurricane backup benefits may offset lower payments."
  },
  "data_gaps_and_assumptions": {
    "missing_data_fields": [
      "Specific minimum kW threshold for Large Commercial ADR eligibility",
      "Actual payment amounts (only 'up to' maximum rates disclosed)",
      "Baseline calculation methodology",
      "Performance measurement procedures",
      "Historical event call data (actual dates, times, durations 2022-2024)",
      "Historical event frequency (stated max 15/year but actual frequency unknown)",
      "Large commercial behind-the-meter battery eligibility and participation pathway",
      "Battery Storage Pilot Phase 1 results report (due December 1, 2023)",
      "Detailed battery pilot event parameters (notification time, frequency, duration)",
      "Small commercial incentive rates for Battery Storage Pilot Phase 2",
      "Current enrollment numbers for Large Commercial ADR program",
      "Total MW capacity enrolled in program",
      "Participation by customer sector breakdown",
      "Actual performance rates and compliance statistics",
      "Audit and verification procedures",
      "Metering equipment technical specifications",
      "Contract terms and length for participants",
      "Tariff schedule details (referenced as 'on file with City Council' but not publicly accessible)",
      "Honeywell DemandSites platform technical specifications and integration options",
      "Energy Efficiency Cost Recovery Rider (Rider EECR) rate impact on customers"
    ],
    "assumptions_made": [
      "Assumed 'up to $50/kW summer' and 'up to $10/kW non-summer' are maximum possible payments and actual payments may be lower based on performance or other factors",
      "Assumed twice-yearly payment means semi-annual settlements (possibly one payment covering summer period, one covering non-summer)",
      "Assumed event frequency 'at least 1, maximum 15' applies specifically to summer season based on context, though non-summer event frequency not stated",
      "Assumed large commercial behind-the-meter batteries not currently eligible for Large Commercial ADR program since Battery Storage Pilot explicitly limited to residential/small commercial and no large commercial battery pathway mentioned",
      "Assumed 'no penalties' means no financial penalties for non-performance or opt-outs, though 'up to' rate structure may imply performance-based payment reductions",
      "Assumed events occur primarily on weekday afternoons during hot summer days based on standard utility peak demand patterns, though exact time-of-day not specified",
      "Assumed program operates year-round (not just summer) based on separate summer/non-summer payment rates, though event concentration clearly in summer",
      "Assumed Mount Carmel Academy enrollment 2021 refers to Large Commercial ADR program (not battery pilot which launched 2023)",
      "Assumed Battery Storage Pilot Phase 2 implementation ongoing in 2024/2025 following April 2024 Council approval"
    ],
    "conflicting_information": [],
    "data_quality_concerns": [
      "Entergy New Orleans tariff schedules referenced as 'on file with New Orleans City Council' but not accessible via public website - could not verify official rate structures",
      "Energy Smart Battery Storage website (energysmartbatterystorage.com) returned DNS error during research - could not access dedicated battery program information",
      "Battery Storage Pilot Phase 1 results report (due December 1, 2023 per Council Resolution R-22-483) not found in public City Council documents - unable to verify pilot performance",
      "IRP presentations and detailed program documents (referenced in search results) returned access errors - could not verify demand response capacity planning",
      "'Up to' rate qualifier creates significant uncertainty about actual revenue potential - requires direct program contact for clarification",
      "No historical event log or annual program reports found - actual DR program performance and utilization unknown",
      "Large commercial battery eligibility ambiguous - Battery Storage Pilot excludes large commercial but main ADR program eligibility for batteries not explicitly addressed",
      "Honeywell contract details (three-year term from August 2020) suggest contract may be up for renewal/expired in 2023 - current TPA status unclear",
      "Mount Carmel Academy case study provides total incentives since 2021 ($51,237) but no breakdown by year or events - cannot verify rate calculations",
      "Peak demand stated as 'approximately 1,200 MW (2023)' from single source - could not verify via multiple sources or official Entergy New Orleans capacity reports"
    ]
  },
  "research_summary": {
    "research_date": "2025-10-11",
    "time_spent_minutes": 30,
    "researcher_notes": "Conducted comprehensive research on Entergy New Orleans Energy Smart demand response programs with focus on large commercial participation and battery storage eligibility. Key findings: (1) Municipal utility with New Orleans City Council regulation (unique in US) provides local control but reduces public transparency vs PSC-regulated utilities. (2) Large Commercial ADR program offers up to $50/kW summer, $10/kW non-summer in twice-yearly cash payments, managed by Honeywell Smart Energy with Enbala VPP platform, 24-hour advance notice, max 15 events/year summer season, no penalties for opt-outs. (3) Battery Storage Demand Response Pilot Program launched May 2023 (Phase 1: 30 residential customers), expanded April 2024 (Phase 2: 140 customers including 15 small commercial), specifically for solar-connected smart battery systems. (4) Large commercial behind-the-meter battery eligibility unclear - pilot program excludes large commercial, main ADR program battery pathway not explicitly defined. (5) Hurricane Ida (August 2021) fundamentally shifted New Orleans energy priorities toward resilience - 10-day citywide outage, 10 heat deaths, $1B resilience plan. Battery storage with backup power capability has elevated strategic value beyond traditional DR economics. (6) Peak demand ~1,200 MW (2023) provides scale context. (7) Data quality limitations: 'up to' rate qualifier creates revenue uncertainty, minimum kW threshold not disclosed, baseline methodology not disclosed, historical event data not available, key documents (tariff schedules, Phase 1 pilot report) not publicly accessible. Mount Carmel Academy case study ($51,237 since 2021) demonstrates real participant revenue but lacks granular detail. Program contact (504-784-0640, adr@energysmartnola.com) required for detailed eligibility and payment information. Hurricane-prone context makes New Orleans battery value proposition unique - backup power during extended outages potentially worth more than DR revenue, creating compelling dual-benefit deployment case.",
    "verification_status": "All data extracted from official Entergy New Orleans sources, New Orleans City Council regulatory documents, Honeywell press releases, news articles, and program websites. NO DATA INVENTED. Fields marked 'unknown', 'not disclosed', 'unclear' represent genuine gaps in publicly available information. Seasonal rates ($50/kW summer, $10/kW non-summer) verified across multiple independent sources. Event parameters (24hr notice, 2-4hr duration, max 15 events) verified in multiple program materials. Battery Storage Pilot Program details verified via City Council Resolutions R-22-483 (Phase 1 approval) and R-24-119 (Phase 2 approval). Hurricane Ida impact verified via multiple news sources including ProPublica/NPR investigation. Regulatory structure (City Council vs PSC) verified via local journalism. Mount Carmel Academy participation verified via official Entergy blog. Peak demand (~1,200 MW) from single source - treat as approximate. 'Up to' rate qualifier indicates maximum rates - actual payments may differ but exact structure requires direct program contact.",
    "recommended_next_steps": [
      "Contact Entergy New Orleans Energy Smart program (504-784-0640, adr@energysmartnola.com) to: (a) Determine minimum kW threshold for large commercial eligibility, (b) Clarify 'up to' rate structure and actual payment methodology, (c) Request large commercial behind-the-meter battery participation pathway if applicable, (d) Request historical event call data 2022-2024, (e) Request baseline calculation and performance measurement methodology",
      "Contact Battery Storage Pilot program (entergyno-vpp@energyhub.net) to: (a) Inquire about large commercial battery eligibility roadmap, (b) Request Phase 1 pilot results, (c) Understand Phase 2 enrollment process and timeline for small commercial (15 slots)",
      "Review New Orleans City Council docket UD-22-03 documents for detailed Battery Storage Pilot Phase 1 report (due December 1, 2023) - may require direct Council records request",
      "Access official Entergy New Orleans tariff schedules via New Orleans City Council Utilities Committee to verify rate structures and program rules",
      "Request Entergy New Orleans Energy Smart annual program reports or performance filings to City Council for historical enrollment, capacity, and event data",
      "Monitor New Orleans City Council Utility, Cable, Telecommunications and Technology Committee meetings for demand response program updates and potential large commercial battery inclusion discussions",
      "Compare program economics to MISO wholesale DR programs (via Entergy Louisiana for facilities outside New Orleans city limits) for potential alternative participation pathway",
      "Conduct facility energy audit via free Energy Smart survey to determine actual kW commitment level and payment estimates specific to facility",
      "Research Honeywell DemandSites platform integration requirements and API access for potential battery optimization integration",
      "Analyze hurricane backup power value (VBPU - value of backup power during outages) specific to New Orleans facility to quantify resilience benefit beyond DR revenue",
      "Contact Entergy New Orleans grid planning department for insights on future distributed energy resource programs post-Hurricane Ida resilience investments",
      "Review Entergy New Orleans Integrated Resource Plans (2021 IRP, 2024 IRP in progress) for demand response capacity forecasts and battery storage integration strategy"
    ],
    "confidence_level": "medium",
    "confidence_explanation": "Medium confidence (6.0/10) in extracted data quality. High confidence areas: (1) Seasonal incentive rates ($50/kW summer, $10/kW non-summer) consistently stated across multiple official sources - very reliable, (2) Event parameters (24hr notice, 2-4hr duration, max 15 events) verified in multiple program materials - reliable, (3) Battery Storage Pilot program structure, capacity (30→140 customers), and regulatory approval timeline verified via City Council resolutions - highly reliable, (4) Hurricane Ida impact and resilience context extensively documented - highly reliable, (5) Honeywell TPA role and Enbala platform verified via press releases - reliable, (6) Regulatory structure (City Council regulation) verified via authoritative local journalism - reliable. Medium confidence areas: (1) 'Up to' rate qualifier creates uncertainty about actual payment amounts - requires clarification, (2) Large commercial battery eligibility ambiguous based on available information - requires clarification, (3) Peak demand figure (~1,200 MW) from single source - treat as approximate, (4) Mount Carmel Academy revenue ($51,237 since 2021) lacks granular breakdown - demonstrates program reality but limited analytical value. Low confidence areas: (1) Minimum kW threshold completely undisclosed - cannot estimate, (2) Baseline methodology not disclosed - major gap for battery optimization, (3) Historical event call data not available - cannot verify stated max 15 frequency, (4) Actual vs maximum payment rates unknown due to 'up to' qualifier - revenue projections uncertain, (5) Large commercial battery pathway undefined - participation feasibility unclear. Critical documents inaccessible (tariff schedules, Phase 1 pilot report, battery storage website) limit verification. Overall: Sufficient information for preliminary battery opportunity assessment and strategic decision (hurricane backup + DR revenue dual benefit clearly compelling), but operational planning and financial modeling require direct program engagement to resolve data gaps."
  }
}
