{
  "program_id": "XCEL-MN-OPTIMIZE-YOUR-CHARGE-EV",
  "program_name": "Optimize Your Charge (EV Rate)",
  "utility": "Xcel Energy",
  "state": "Minnesota",
  "iso_rto_territory": "MISO",
  "program_type": "utility",
  "status": "active",
  "classification": {
    "program_category": "EV_MANAGED_CHARGING",
    "is_demand_response": false,
    "is_tou_rate": false,
    "is_behavioral_incentive": true,
    "notes": "This is a behavioral EV charging optimization program with incentive payments, not a traditional demand response program or time-of-use rate. Participants receive credits for charging during preferred windows but loads are not directly controlled."
  },
  "payment_structure": {
    "annual_incentive": {
      "payment_amount": "50 USD per year",
      "payment_type": "bill_credit",
      "performance_requirement": "25% of charging sessions during preferred charging window",
      "notes": "Minnesota requirement is 25% compliance, more lenient than Colorado/New Mexico (80%). Participants select their preferred charging schedule during enrollment."
    }
  },
  "event_parameters": {
    "charging_optimization": {
      "control_method": "behavioral_voluntary",
      "monitoring_method": "telematics_data",
      "platform_provider": "WeaveGrid",
      "description": "WeaveGrid monitors EV/charger telematics data to verify charging occurs during participant-selected off-peak windows. No direct control of charging equipment.",
      "advance_notice": "not applicable",
      "duration": "not applicable",
      "frequency": "continuous_monitoring"
    }
  },
  "eligibility": {
    "customer_class": "residential_and_small_commercial",
    "eligible_vehicles": [
      "Certain Toyota plug-in electric vehicles",
      "Certain Lexus plug-in electric vehicles",
      "Certain Tesla vehicles"
    ],
    "eligible_chargers": {
      "level_1": "eligible (120V)",
      "level_2": "eligible (240V, recommended for best benefits)",
      "notes": "Participants can use any home charging equipment. Level 2 chargers recommended for faster, more efficient charging."
    },
    "battery_storage_non_ev": {
      "eligible": false,
      "notes": "This program is exclusively for electric vehicle charging optimization. Stationary battery energy storage systems are NOT eligible for this program."
    },
    "enrollment_process": {
      "platform": "WeaveGrid online enrollment",
      "requirements": [
        "Create WeaveGrid account",
        "Sign into EV or charger account to establish connection",
        "Select preferred charging schedule",
        "Agree to 25% compliance threshold"
      ],
      "url": "https://oyc.xcelenergy.ev-pulse.com/"
    }
  },
  "baseline_methodology": "not applicable",
  "battery_suitability": {
    "rating": "Not Applicable - EV Program Only",
    "justification": "The Optimize Your Charge program is exclusively designed for electric vehicle (EV) charging optimization and is NOT a demand response program suitable for stationary battery energy storage systems. This program: (1) Only accepts eligible EVs from specific manufacturers (Toyota, Lexus, Tesla), (2) Uses EV/charger telematics data through WeaveGrid platform for monitoring, (3) Provides behavioral incentives ($50/year) for voluntary charging schedule compliance, not performance-based DR payments, (4) Does not involve direct load control or dispatch signals. For stationary battery storage in Minnesota, Xcel Energy offers DIFFERENT programs: the Renewable Battery Connect program (residential solar+storage incentives) and the Capacity*Connect program (200 MW commercial/industrial distributed battery deployment). This EV program should NOT be included in battery energy storage DR program catalogs as it is fundamentally different technology and application.",
    "barriers": [
      "Program exclusively for electric vehicles, not stationary storage",
      "Requires EV/charger telematics integration via WeaveGrid",
      "Payment structure ($50/year) not economically viable for battery storage",
      "No grid services or demand response dispatch capability",
      "Behavioral/voluntary program, not performance-based DR",
      "Eligibility limited to specific EV makes/models"
    ],
    "opportunities": []
  },
  "alternative_programs_for_battery_storage": {
    "renewable_battery_connect": {
      "description": "Residential solar+storage incentive program (primarily Colorado)",
      "payment": "$370 per kWh energy capacity for income-qualified customers, standard rates lower",
      "max_incentive": "5000 USD",
      "capacity_limit": "50 kWh",
      "notes": "Available in Minnesota as of November 2024 with approximately $3.48 million available for incentives. Requires solar+storage system with new or existing Interconnection Agreement."
    },
    "capacity_connect": {
      "description": "Commercial/industrial distributed battery storage deployment program",
      "target_capacity": "200 MW by 2028",
      "battery_sizes": "1-3 MW per site",
      "payment_type": "direct_payments_to_host_sites",
      "budget": "$152M (50 MW minimum) to $430M (200 MW maximum)",
      "status": "Proposed to Minnesota Public Utilities Commission, not yet approved",
      "notes": "Xcel Energy owns and operates batteries at host customer sites (businesses, commercial, industrial, nonprofits). Batteries charged during low-cost periods and dispatched during peak demand."
    },
    "miso_wholesale_dr": {
      "description": "MISO demand response programs",
      "notes": "Battery storage can participate in MISO wholesale DR programs. Minnesota is within MISO territory."
    }
  },
  "data_sources": [
    {
      "url": "https://ev.xcelenergy.com/optimize-your-charge",
      "access_date": "2025-10-12",
      "data_quality": "primary",
      "notes": "Main Optimize Your Charge program page (TLS certificate error prevented direct fetch but content verified through search results)"
    },
    {
      "url": "https://www.weavegrid.com/xcelenergy/optimize-your-charge",
      "access_date": "2025-10-12",
      "data_quality": "primary",
      "notes": "WeaveGrid platform provider information on program mechanics"
    },
    {
      "url": "https://xcelenergy-support.weavegrid.com/hc/en-us/articles/24040491797655-Which-EVs-and-home-charging-stations-are-eligible-for-Xcel-Energy-s-Optimize-Your-Charge-program",
      "access_date": "2025-10-12",
      "data_quality": "primary",
      "notes": "WeaveGrid support documentation on EV and charger eligibility"
    },
    {
      "url": "https://newsroom.xcelenergy.com/news/xcel-energy-to-meet-minnesotas-energy-needs-with-first-in-the-nation-distributed-capacity-procurement",
      "access_date": "2025-10-12",
      "data_quality": "secondary",
      "notes": "Information on Capacity*Connect program as alternative battery storage program in Minnesota"
    },
    {
      "url": "https://mn.gov/commerce/energy/consumer/energy-programs/on-site-energy-storage-systems.jsp",
      "access_date": "2025-10-12",
      "data_quality": "secondary",
      "notes": "Minnesota Department of Commerce information on Renewable Battery Connect storage incentives"
    }
  ],
  "research_notes": "CRITICAL FINDING: This is NOT a demand response program suitable for battery energy storage systems. The Optimize Your Charge program is exclusively an EV charging optimization program with behavioral incentives. Program mechanics: (1) Participants enroll eligible EVs (Toyota, Lexus, Tesla) through WeaveGrid platform, (2) Select preferred charging window aligned with grid needs, (3) WeaveGrid monitors charging behavior via EV/charger telematics, (4) Participants receive $50 annual bill credit for charging during preferred window at least 25% of the time (Minnesota threshold, lower than CO/NM 80% requirement). No direct load control, no dispatch signals, no performance-based payments. Program attracted ~5,000 participants across multiple states. For actual battery storage opportunities in Minnesota, Xcel Energy offers: (a) Renewable Battery Connect - residential solar+storage incentives ($370/kWh for income-qualified, lower for standard, $5k cap, 50 kWh max), active as of Nov 2024 with $3.48M available, and (b) Capacity*Connect - proposed 200 MW commercial/industrial battery deployment program ($152M-$430M budget) pending PUC approval, 1-3 MW batteries at host sites with direct payments. Additionally, battery storage can participate in MISO wholesale DR programs. This program should be flagged as 'Not Applicable for Battery Storage' in any DR program catalog intended for BESS optimization.",
  "research_date": "2025-10-12",
  "research_quality_score": 8,
  "research_quality_notes": "High-quality research with clear determination that this is NOT a battery storage DR program. Successfully identified: (1) Program is EV-only with specific vehicle eligibility, (2) Behavioral/voluntary optimization using WeaveGrid telematics, (3) $50/year incentive with 25% compliance threshold, (4) No applicability to stationary battery storage, (5) Alternative programs available for actual battery storage (Renewable Battery Connect, Capacity*Connect). Score of 8 reflects: comprehensive program understanding, clear classification as EV program, identification of alternative battery programs, primary source verification through WeaveGrid documentation. Score not higher because: (1) Could not directly access main Xcel EV site due to TLS certificate error, (2) Capacity*Connect program details limited (proposal stage), (3) Specific charging window definitions not documented. Research definitively answers the key question: this is an EV charging program, NOT suitable for battery energy storage DR catalog."
}
