{
  "program_id": "NEW-YORK-COMMERCIAL-SYSTEM-RELIEF-PROGRAM",
  "program_name": "Commercial System Relief Program",
  "utility": "NYSEG",
  "state": "New York",
  "iso_rto_territory": "NYISO",
  "program_type": "utility",
  "status": "active",

  "description": "NYSEG's Commercial System Relief Program (CSRP) provides compensation to commercial and industrial customers for reducing electricity usage during peak demand periods. The program offers two participation options: (1) Reservation Payment Option with monthly capacity payments and event-based performance payments, requiring commitment to respond to events; (2) Voluntary Participation Option with performance-only payments and no commitment. Events are called with minimum 21 hours advance notice when day-ahead peak forecast reaches system reliability thresholds, typically on weekday afternoons from 2 PM to 6 PM during the May-September season.",

  "payment_structure": {
    "capacity_payment": {
      "reservation_option": {
        "rate": "$4.35/kW-month (for five or more planned events) or $4.10/kW-month (for four or less planned events)",
        "billing_frequency": "monthly",
        "notes": "Monthly payments made to participants enrolled in Reservation Payment Option based on contracted load relief capacity. Participants must maintain >25% performance factor to continue receiving reservation payments."
      },
      "voluntary_option": {
        "rate": "$0/kW-month",
        "billing_frequency": "not applicable",
        "notes": "No capacity payments under Voluntary Participation Option"
      }
    },
    "performance_payment": {
      "rate": "$0.50/kWh",
      "conditions": "Paid for actual load relief provided during events. Performance amount equals performance rate multiplied by average kW of load relief during event multiplied by number of event hours. All performance payments are made after the program year.",
      "measurement": "Customer Baseline Load (CBL) methodology - 'high 5 out of 10' average customer baseline, based on average of highest usage in each potential dispatch hour in the highest five out of ten days"
    },
    "bill_credit": {
      "rate": "not applicable",
      "structure": "not applicable"
    }
  },

  "event_parameters": {
    "notification_time": "minimum 21 hours",
    "event_duration": "minimum 4 hours (typically 2 PM to 6 PM, total 4-hour window)",
    "event_window": "weekdays 2:00 PM to 6:00 PM",
    "max_events_per_season": "not specified (program references 'five or more planned events' suggesting at least 5 events anticipated)",
    "max_hours_per_season": "not specified",
    "seasons": [
      {
        "name": "peak season",
        "dates": "May 1 to September 30",
        "notes": "Primary program season based on enrollment deadlines, though year-round operation may be possible"
      }
    ],
    "event_trigger": "Day-ahead peak load forecast reaches at least 92% of forecasted summer system-wide peak",
    "test_events": "Customers enrolled in Reservation Payment Option are required to participate in one one-hour test event every year"
  },

  "eligibility": {
    "customer_classes": ["commercial", "industrial"],
    "minimum_load": "50 kW reduction capability",
    "interval_meter_required": true,
    "excluded_customers": [],
    "aggregator_allowed": true,
    "direct_participation_allowed": true,
    "notes": "Customers able to reduce electricity use by 50 kW or more can be direct participants. Aggregators can enroll multiple smaller customers. Interval meter must be installed - if not present, installation must be coordinated which may delay participation start."
  },

  "baseline_methodology": "Customer Baseline Load (CBL) using 'high 5 out of 10' methodology - calculated as average of the highest usage in each potential dispatch hour across the highest five out of ten days. Performance factor of more than 25% required for Reservation Payment Option qualification.",

  "enrollment": {
    "reservation_option_deadline": "April 1, 2025 for May 1 start OR May 1, 2025 for June 1 start",
    "voluntary_option_deadline": "September 30, 2025",
    "program_year": "typically May-September peak season",
    "notes": "Staggered deadlines suggest Reservation option requires more advance planning for system capacity planning"
  },

  "battery_suitability": {
    "rating": "Good",
    "justification": "NYSEG CSRP is well-suited for battery energy storage systems with several favorable attributes: (1) 21-hour advance notice provides excellent scheduling window for overnight charging before events; (2) 4-hour event duration aligns perfectly with standard 4-hour battery configurations; (3) 2-6 PM weekday call window coincides with NYISO peak pricing periods enabling energy arbitrage synergy; (4) $4.35/kW-month capacity payment provides stable monthly revenue stream ($52.20/kW-year for 1 MW battery = $52,200/year guaranteed under Reservation option); (5) $0.50/kWh performance payment is competitive; (6) Fast battery response capability (milliseconds) easily exceeds any program requirements; (7) 50 kW minimum threshold easily met by commercial/industrial batteries (typically 100 kW to 5+ MW). Key limitations preventing 'Excellent' rating: (1) Battery eligibility not explicitly confirmed in program documentation - generic behind-the-meter language suggests eligibility but requires verification; (2) CBL methodology designed for load curtailment may need battery-specific adaptation since batteries don't have consistent baseline load; (3) Uncertain event frequency (no maximum specified) creates revenue forecasting challenges; (4) 25% performance factor requirement needs battery-specific interpretation regarding state-of-charge limits; (5) Unclear whether CSRP enrollment restricts simultaneous NYISO wholesale market participation - if mutually exclusive, must compare revenue streams. Overall assessment: Strong program for batteries due to predictable scheduling, favorable call window timing, meaningful capacity payments, and 4-hour duration match. Priority action: Contact NYSEG demand response team to confirm explicit battery eligibility, clarify CBL calculation for batteries, obtain historical event frequency data (2022-2024), and verify NYISO market stacking rules."
  },

  "data_sources": [
    "https://www.nyseg.com/smartenergy/businesssolutions/cidemandresponse/commercial-system-relief-program",
    "https://www.nyseg.com/w/commercial-system-relief-program",
    "https://www.rge.com/smartenergy/businesssolutions/cidr/commercial-system-relief-program",
    "https://dps.ny.gov/event/nysegrge-comments-due-nyseg-and-rges-annual-report-detailing-demand-response-programs-and",
    "Various web searches for NYSEG CSRP program details (October 2025)"
  ],

  "research_notes": "Research conducted October 11, 2025 via web searches due to connection failures when accessing NYSEG website directly. Successfully gathered comprehensive program information from search results and related sources. Key findings: (1) Two distinct payment options create different value propositions - Reservation option provides $4.35/kW-month guaranteed capacity revenue plus $0.50/kWh performance payments but requires commitment and >25% performance factor; Voluntary option offers $0.50/kWh performance-only with no obligations; (2) Program uses 'high 5 out of 10' CBL methodology which may need battery-specific interpretation; (3) Events occur on weekdays 2-6 PM with minimum 21-hour advance notice; (4) Critical finding not in previous research: minimum 4-hour event duration requirement; (5) Events triggered when day-ahead forecast reaches 92% of summer peak; (6) Required annual test event for Reservation participants; (7) Sister utility RG&E operates identical program confirming coordinated Avangrid administration. Major data gaps: (1) Maximum events per season/year not specified (only reference to 'five or more planned events'); (2) No historical event frequency data available for revenue modeling; (3) Battery storage eligibility not explicitly confirmed or excluded; (4) CBL methodology for batteries unclear; (5) NYISO market stacking rules unknown; (6) Penalty structure not detailed beyond performance factor requirement. Program appears well-established with clear payment rates but lacks operational parameter details critical for optimization. Connection to NYSEG website failed repeatedly, requiring alternative research via web search which successfully retrieved payment rates and program structure from search result snippets and related utility pages. RG&E (Rochester Gas & Electric, sister Avangrid utility) operates parallel program with identical rates providing verification of payment structure.",

  "research_date": "2025-10-11",

  "research_quality_score": 7,
  "research_quality_notes": "Score of 7 reflects: EXCELLENT - Clear payment rate documentation from multiple sources ($4.35/$4.10/kW-month capacity, $0.50/kWh performance); verified dual payment options; confirmed 21-hour notice, 50 kW minimum, 2-6 PM call window, CBL methodology, enrollment deadlines. GOOD - Found critical 4-hour minimum event duration and 92% forecast trigger not in previous research. MODERATE - Battery eligibility inferred but not explicitly confirmed; no historical event data; maximum events/hours limits not specified; stacking rules with NYISO unclear. Score would be 8-9 if battery eligibility were explicitly confirmed and historical event frequency data were available. Despite website connection failures, alternative research methods successfully gathered comprehensive program information sufficient for initial battery suitability assessment.",

  "follow_up_required": [
    "Contact NYSEG demand response team at commercial-industrial program line to explicitly confirm battery energy storage system eligibility",
    "Request historical event data 2022-2024 including: number of events per year, actual event durations, dates/times, system conditions",
    "Clarify Customer Baseline Load calculation methodology specific to battery storage resources (likely based on nominated capacity rather than historical usage)",
    "Obtain maximum events per season/year and maximum hours per season/year limits",
    "Verify whether CSRP enrollment allows simultaneous participation in NYISO wholesale markets (energy, capacity, ancillary services) or is mutually exclusive",
    "Clarify 25% performance factor requirement interpretation for batteries regarding state-of-charge limitations",
    "Request complete CSRP tariff document from NY PSC tariff database (likely PSC No. 120 Electricity)",
    "Understand penalty structure for non-performance under Reservation Payment Option",
    "Clarify whether battery discharge only qualifies for load relief or if controlled charging reduction also counts",
    "Determine any special telemetry, control, or communication requirements for battery participants"
  ],

  "related_programs": {
    "rge_csrp": {
      "utility": "Rochester Gas & Electric (RG&E)",
      "state": "New York",
      "description": "Sister Avangrid utility operates identical CSRP with same rate structure",
      "capacity_rate": "$4.35/kW-month or $4.10/kW-month",
      "performance_rate": "$0.50/kWh",
      "status": "active"
    },
    "nyiso_dlrp": {
      "program": "Distribution Load Relief Program",
      "description": "NYISO-administered demand response for distribution-level relief in constrained areas",
      "status": "active",
      "notes": "May offer higher compensation in constrained zones; unclear if stackable with CSRP"
    },
    "nyseg_energy_storage_solutions": {
      "program": "Energy Storage Solutions Program",
      "description": "Separate NYSEG program specifically for residential and small business battery systems (max 25 kWh)",
      "status": "active",
      "notes": "Different program for smaller batteries; CSRP targets larger commercial/industrial systems 50+ kW"
    }
  },

  "optimization_notes": "For 1 MW / 4 MWh battery system: Reservation Option = $4,350/month guaranteed ($52,200/year) + event performance revenue (conservatively estimate 10 events × 4 hours × 1,000 kW × $0.50/kWh = $20,000 = total $72,200/year). Voluntary Option = $0 guaranteed but full flexibility for energy arbitrage and market participation. The 21-hour advance notice enables day-ahead charge scheduling: charge overnight during off-peak hours (typically $20-40/MWh NYISO prices), hold full SOC through morning, discharge 2-6 PM during events (earning $0.50/kWh = $500/MWh equivalent, well above typical NYISO peak prices of $50-100/MWh). Event duration of 4 hours perfectly matches standard battery configurations. Critical optimization question: If CSRP allows NYISO market stacking, battery can earn CSRP payments during events (10-20 days/year) PLUS energy arbitrage revenue on remaining 345-355 days/year PLUS ancillary services during non-event hours. If mutually exclusive, must compare $72K CSRP revenue vs potential NYISO market revenue (1 MW battery in upstate NY typically earns $80-150K/year from energy arbitrage + ancillary services based on NYISO historical prices). Recommend: (1) Confirm stacking rules; (2) Obtain 3-year historical event data; (3) Model CSRP revenue vs NYISO market opportunity; (4) If stackable, Reservation Option is clearly advantageous; (5) If exclusive, need detailed revenue comparison.",

  "program_comparison": "Compared to other NY utility DR programs: NYSEG CSRP capacity rate ($4.35/kW-month = $52.20/kW-year) is moderate - higher than some residential programs but lower than some ISO-level emergency DR programs. Performance rate ($0.50/kWh) is competitive. Con Ed DLRP (Distribution Load Relief Program) offers higher payments in constrained NYC areas but has stricter requirements. Central Hudson operates similar programs. NYSEG's dual-option structure (Reservation vs Voluntary) provides flexibility. The 21-hour notice is longer than many programs (providing better planning) but shorter than day-ahead programs. The 4-hour duration requirement is standard for commercial/industrial DR. Overall, NYSEG CSRP represents solid mid-tier utility DR program with predictable structure suitable for battery optimization if stacking allowed."
}
