{
  "program_id": "MINNESOTA-ENERGYWISE-LOAD-MANAGEMENT",
  "program_name": "EnergyWise Load Management",
  "utility": "Dakota Electric Association",
  "state": "Minnesota",
  "iso_rto_territory": "MISO",
  "program_type": "utility",
  "status": "active",
  "payment_structure": {
    "rate_70_full_interruption": {
      "description": "Lowest available rate, requires reducing connected load to zero during peak demand",
      "payment_type": "rate_reduction",
      "specific_rate": "not available",
      "notes": "Can use standby generators. Dakota Electric can automatically start generators and transfer load."
    },
    "rate_71_partial_interruption": {
      "description": "Requires lowering load by at least 50kW during peak demand",
      "payment_type": "rate_reduction",
      "specific_rate": "not available",
      "notes": "Savings increase with greater load reduction"
    },
    "air_conditioning_option_1": {
      "energy_credit": "0.032 USD per kWh",
      "upfront_rebate": "20 USD per ton cooling capacity",
      "upfront_rebate_max": "1500 USD",
      "notes": "Credit of 3.2 cents per kWh for electricity used by air conditioners. Rebate to offset sub-meter and load control receiver installation costs."
    },
    "air_conditioning_option_2": {
      "seasonal_credit": "6.50 USD per ton per month",
      "applicable_months": "June, July, August",
      "credit_limit": "limited to 1/3 of monthly energy and demand charges",
      "max_compressor_size": "7.5 ton",
      "notes": "No set-up costs required"
    },
    "electric_water_heater_storage": {
      "payment_type": "reduced_electricity_pricing",
      "specific_rate": "not available",
      "notes": "Water heated at night during lower-cost periods"
    },
    "electric_water_heater_interruptible": {
      "payment_type": "reduced_electricity_pricing",
      "specific_rate": "not available",
      "notes": "Power interrupted during high-demand periods"
    },
    "general_load_management_rate": {
      "description": "Load management participants receive electricity at nearly half the regular rate",
      "estimated_savings": "approximately 50% discount",
      "notes": "Power to equipment only interrupted during periods of high electricity demand, usually on the hottest and coldest days of the year"
    },
    "baseline_comparison": {
      "standard_rate_2025": "0.1490 USD per kWh (June, July, August)",
      "standard_rate_other_months": "0.1351 USD per kWh",
      "notes": "Net effective rate including RTA (Renewable Transmission Adjustment)"
    }
  },
  "event_parameters": {
    "air_conditioning": {
      "control_method": "15-minute cycling",
      "description": "Dakota Electric cycles air conditioner condensers on and off in 15-minute increments on high-energy-use days when wholesale electricity is more expensive"
    },
    "general_interruptions": {
      "typical_days": "hottest and coldest days of the year",
      "frequency": "not specified",
      "duration": "not specified",
      "advance_notice": "not specified"
    },
    "dual_fuel_heating": {
      "max_interruption_per_day": "12 hours",
      "max_interruption_per_season": "400 hours",
      "season": "September to May",
      "notes": "Great River Energy may interrupt these loads during peak pricing hours"
    },
    "system_wide_capacity": {
      "summer_peak_reduction": "more than 300 MW",
      "notes": "Great River Energy can typically reduce its load by more than 300 MW through Dakota Electric and other member cooperatives"
    }
  },
  "eligibility": {
    "commercial_industrial": {
      "rate_70": "Businesses capable of reducing connected load to zero during peak demand, can use standby generators",
      "rate_71": "Businesses capable of lowering load by at least 50kW during peak demand",
      "air_conditioning": "Businesses with commercial air conditioning systems, maximum 7.5 ton compressor for Option 2",
      "water_heating": "Businesses with electric water heating systems"
    },
    "enrollment_process": {
      "contact": "Energy Experts",
      "phone": "651-463-6243",
      "notes": "Members must contact to enroll in programs"
    }
  },
  "baseline_methodology": "not available",
  "battery_suitability": {
    "rating": "Limited",
    "justification": "The program is primarily designed for traditional load control applications (HVAC, water heating, generators). While Dakota Electric explored a battery storage pilot program in 2024, that program has not been implemented and the page was archived. The Rate 70/71 interruptible programs could theoretically accommodate battery discharge (as a generator) but: (1) No explicit mention of battery storage eligibility in current programs, (2) Payment structure is rate reduction rather than performance-based payments which limits battery arbitrage value, (3) Air conditioning and water heater programs are equipment-specific and not applicable to batteries, (4) The archived 2024 battery pilot suggests regulatory/program development challenges. Batteries would need to participate as generators under Rate 70 or coordinate with Great River Energy for MISO wholesale market participation.",
    "barriers": [
      "No explicit battery storage eligibility in active programs",
      "Rate reduction payment structure rather than performance-based payments",
      "Equipment-specific programs (HVAC, water heaters) not applicable to storage",
      "Battery pilot program archived/not implemented as of 2024",
      "Unclear dual participation rules with MISO wholesale markets",
      "May require coordination through Great River Energy for wholesale participation"
    ],
    "opportunities": [
      "Rate 70 full interruption could accommodate battery discharge as standby generation",
      "Dakota Electric has demonstrated interest in battery storage (pilot program development)",
      "Great River Energy (wholesale provider) is deploying battery storage pilots",
      "MISO demand response framework allows supply-side participation",
      "Dakota Electric can reduce peak demand significantly (300+ MW system-wide)",
      "Strong load management program history (decades of experience)"
    ]
  },
  "data_sources": [
    {
      "url": "https://www.dakotaelectric.com/member-services/programs-rebates/for-your-business/energy-wise-management-programs/",
      "access_date": "2025-10-12",
      "data_quality": "primary",
      "notes": "Main program description page with payment details for all commercial programs"
    },
    {
      "url": "https://www.dakotaelectric.com/2024/02/27/battery-storage/",
      "access_date": "2025-10-12",
      "data_quality": "secondary",
      "notes": "Archived page about battery storage pilot program exploration (not implemented)"
    },
    {
      "url": "https://rebates.dakotaelectric.com/2022/01/31/load-management-programs/",
      "access_date": "2025-10-12",
      "data_quality": "supporting",
      "notes": "Additional information about load management program structure"
    }
  ],
  "research_notes": "Original URL provided (https://www.dakotaelectric.com/member-services/programs-rebates/for-your-business/energywise-load-management/) returned 404 error. Found active program at alternate URL. Dakota Electric is a regulated electric cooperative served by Great River Energy (wholesale provider). The EnergyWise Load Management program includes multiple sub-programs: Rate 70 (full interruption), Rate 71 (partial interruption), air conditioning control (two options), and electric water heater programs. Specific rate schedules for Rate 70/71 not available in public documentation but described as 'lowest available rate' and 'nearly half the regular rate' respectively. Air conditioning programs have specific quantified payments: Option 1 provides 3.2 cents/kWh credit plus $20/ton rebate (up to $1,500), Option 2 provides $6.50/ton monthly credit June-August. Dakota Electric explored battery storage pilot program in 2024 but page archived with outdated information disclaimer. Great River Energy (wholesale provider) is deploying 1.5 MW battery storage pilot in Cambridge, MN using Form Energy 100-hour duration technology. Dakota Electric participates in MISO grid operations through Great River Energy and can reduce peak demand by 300+ MW system-wide. Dual participation rules with MISO wholesale markets not clearly documented. Program impact: Members helped save nearly $17 million in wholesale power costs (year not specified). Commercial rate book PDF could not be accessed for detailed Rate 70/71 tariff information.",
  "research_date": "2025-10-12",
  "research_quality_score": 6,
  "research_quality_notes": "Good documentation of payment structure for air conditioning programs with specific rates. Limited information on Rate 70/71 specific rates (qualitative descriptions only). No explicit battery storage eligibility information. Baseline methodology not documented. Event parameters partially documented. Archived battery pilot program indicates recent but unsuccessful effort to add storage. Unable to access detailed commercial rate tariff book. Score of 6 reflects: clear payment information for AC programs, limited quantification for interruptible rates, no battery-specific policies, and inability to verify detailed tariff terms."
}
