{
  "program_id": "cps_energy_commercial_dr_2024",
  "program_name": "CPS Energy Commercial Demand Response Program",
  "program_type": "utility",
  "status": "active",
  "description": "CPS Energy's Commercial Demand Response Program is a voluntary demand reduction program serving San Antonio, Texas businesses. The program operates year-round with separate summer (June-September) and winter (December-March) periods. During conservation events, participants voluntarily reduce electricity usage in response to grid conditions and receive payment based on verified load reduction. The program features two notification options (30-minute and 2-hour notice) with different payment rates, approximately 25 summer events per season, and up to 10 winter events. As a municipal utility program, CPS Energy integrates this DR offering into their broader Sustainable Tomorrow Energy Plan (STEP) targeting 410 MW of incremental demand reduction by 2027. The program is part of ERCOT's demand response ecosystem and helps maintain grid reliability during peak demand periods, particularly during summer heat waves and winter cold snaps.",
  "geography": {
    "states": ["TX"],
    "utilities": ["CPS Energy"],
    "isos": ["ERCOT"],
    "service_territories": [
      "City of San Antonio",
      "CPS Energy service territory (Bexar County and surrounding areas)"
    ]
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "residential_max_kw": null,
      "commercial_min_kw": null,
      "size_threshold_notes": "Program available to commercial and industrial customers. A separate 'My Business Rewards' program exists for small businesses with less than 100 kW demand. The Commercial Demand Response program described here serves commercial customers with more than 100 kW demand, though specific minimum kW requirements for this tier are not explicitly stated in available documentation."
    },
    "behind_the_meter": true,
    "front_of_meter": "not specified",
    "minimum_capacity_kw": null,
    "maximum_capacity_kw": null,
    "resource_types": [
      "load curtailment",
      "behind-the-meter generation",
      "behind-the-meter battery storage"
    ],
    "requires_aggregator": false,
    "additional_notes": "CPS Energy serves all customers within San Antonio city limits as a vertically integrated municipal utility. Customers must have CPS Energy as their electricity provider to participate. The utility offers test events to help businesses estimate their reduction potential before committing to the program. CPS Energy also provides assistance in identifying strategies for reducing electricity usage during events."
  },
  "notification": {
    "day_ahead_notice": false,
    "minimum_notice_hours": 0.5,
    "maximum_notice_hours": 2.0,
    "notification_methods": [
      "email",
      "SMS",
      "phone"
    ],
    "notification_details": "Participants choose between two notification options: (1) 30-minute advance notice with higher payment rates, or (2) 2-hour advance notice with slightly lower payment rates. CPS Energy contacts participants via email, text message, and/or phone with the start and end time for each conservation event. The notification includes event timing details and expected duration."
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": 73.00,
      "unit": "$/kW-season",
      "varies_by_season": true,
      "seasonal_rates": [
        {
          "season": "Summer (30-minute notice)",
          "rate": 73.00,
          "unit": "$/kW-season",
          "notes": "My Business Rewards program: $73/kW for June-September, 30-minute notice option"
        },
        {
          "season": "Summer (2-hour notice)",
          "rate": 70.00,
          "unit": "$/kW-season",
          "notes": "My Business Rewards program: $70/kW for June-September, 2-hour notice option"
        },
        {
          "season": "Winter (30-minute notice)",
          "rate": 45.00,
          "unit": "$/kW-total",
          "notes": "Commercial/Industrial program: $45/kW for December-March, 30-minute response, up to 40 hours across up to 10 events"
        },
        {
          "season": "Winter (60-minute notice)",
          "rate": 40.00,
          "unit": "$/kW-total",
          "notes": "Commercial/Industrial program: $40/kW for December-March, 60-minute response, up to 40 hours across up to 10 events"
        }
      ],
      "payment_calculation": "Payment based on verified electricity reduction during conservation events compared to baseline usage. Baseline is calculated from interval meter data. The specific baseline methodology (e.g., 10-in-10, 5-in-10) is defined in CPS Energy's Technical Guidebook but not detailed in public-facing program materials.",
      "payment_timing": "not specified"
    },
    "performance_rate": null,
    "penalty_structure": {
      "has_penalties": false,
      "penalty_rate": null,
      "penalty_unit": null,
      "penalty_description": "No penalties specified. Program participation is voluntary during each event."
    },
    "bonus_payments": [
      {
        "description": "Bonus Hours Program - Evening peak reduction",
        "rate": 10.00,
        "unit": "$/kW-season",
        "conditions": "My Business Rewards program only: $10/kW for participation during 7pm-10pm weekdays, June-September, with 30-minute notice, across approximately 16 additional events. This is supplemental to the main summer program."
      },
      {
        "description": "Backup generator usage during Energy Emergency Alerts",
        "rate": 35.00,
        "unit": "$/kW",
        "conditions": "Winter program only: Commercial customers who use backup generators during Energy Emergency Alerts can earn $35/kW. This option appears to be separate from the load reduction options."
      }
    ],
    "forward_curve_available": false,
    "forward_curve_url": null,
    "payment_notes": "IMPORTANT: The payment structure varies significantly between the 'My Business Rewards' program (small businesses <100 kW) and the larger commercial program (>100 kW). Summer rates ($70-73/kW per season) are explicitly stated for My Business Rewards. Winter rates ($40-45/kW total for up to 40 hours) are stated for commercial/industrial customers. It is unclear whether the summer $70-73/kW rates also apply to larger commercial customers or if those customers have different rates. The winter program structure ($/kW for up to 40 total hours across 10 events) differs from the summer program structure ($/kW for the season with ~25 events)."
  },
  "seasons": [
    {
      "season_name": "Summer",
      "start_date": "06-01",
      "end_date": "09-30",
      "max_events": 25,
      "max_hours": null,
      "event_characteristics": "Approximately 25 conservation events per summer season. Events typically last less than 3 hours and occur on weekdays between 1:00 PM and 7:00 PM. Summer is the primary demand response season for CPS Energy due to cooling loads during Texas heat waves."
    },
    {
      "season_name": "Winter",
      "start_date": "12-01",
      "end_date": "03-30",
      "max_events": 10,
      "max_hours": 40,
      "event_characteristics": "Up to 10 conservation requests during winter period, with a cap of 40 total hours. Winter program was introduced as CPS Energy's first winter demand response initiative to manage peak power demand during extreme cold weather events. Customers enrolled in summer program are automatically enrolled in winter program."
    }
  ],
  "call_windows": [
    {
      "window_id": "summer_weekday_afternoon",
      "start_hour": 13,
      "end_hour": 19,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": ["Summer"],
      "timezone": "America/Chicago",
      "notes": "Primary summer event window: 1:00 PM to 7:00 PM on weekdays. This window aligns with peak cooling demand during hot Texas summer afternoons and evenings."
    },
    {
      "window_id": "summer_bonus_hours",
      "start_hour": 19,
      "end_hour": 22,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": ["Summer"],
      "timezone": "America/Chicago",
      "notes": "Bonus Hours option (My Business Rewards only): 7:00 PM to 10:00 PM weekdays, approximately 16 events, $10/kW supplemental payment. This captures the evening peak as the sun sets but temperatures remain high."
    },
    {
      "window_id": "winter_emergency",
      "start_hour": null,
      "end_hour": null,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday",
        "Saturday",
        "Sunday"
      ],
      "seasons": ["Winter"],
      "timezone": "America/Chicago",
      "notes": "Winter events are triggered by extreme cold weather and high heating demand. Specific time windows not defined - events can occur during any hours of peak demand, particularly during morning and evening heating peaks. Winter events may occur on weekends during severe weather."
    }
  ],
  "event_parameters": {
    "typical_duration_hours": 3.0,
    "minimum_duration_hours": null,
    "maximum_duration_hours": null,
    "event_granularity_minutes": null,
    "response_time_minutes": 30,
    "max_events_per_season": null,
    "max_events_per_year": 35,
    "max_hours_per_season": null,
    "max_hours_per_year": null,
    "max_consecutive_events": null,
    "minimum_rest_hours": null,
    "event_details": {
      "summer_events": {
        "typical_count": 25,
        "typical_duration": "less than 3 hours",
        "typical_timing": "weekdays 1-7 PM",
        "notice_options": "30 minutes or 2 hours (participant choice)"
      },
      "summer_bonus_events": {
        "typical_count": 16,
        "typical_timing": "weekdays 7-10 PM",
        "notice": "30 minutes"
      },
      "winter_events": {
        "max_count": 10,
        "max_total_hours": 40,
        "notice_options": "30 minutes or 60 minutes",
        "trigger": "extreme cold weather and high heating demand"
      }
    }
  },
  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_frequency": "annual",
    "nomination_deadline": "not specified",
    "allows_price_bidding": false,
    "bidding_structure": "not applicable - fixed payment rates",
    "enrollment_period": {
      "start_date": "not specified",
      "end_date": "not specified",
      "recurring": true
    },
    "enrollment_details": "Customers can enroll by contacting their CPS Energy account manager or emailing cpsesavenow@cpsenergy.com. The utility offers test events to help businesses estimate their potential reduction. Participants choose their preferred notification option (30-minute or 2-hour for summer; 30-minute or 60-minute for winter) during enrollment. Summer program participants are automatically enrolled in the winter program."
  },
  "baseline_methodology": {
    "baseline_type": "Interval meter based",
    "baseline_calculation": "CPS Energy calculates a baseline from customer interval meter data to determine 'normal usage' for each customer. The verified reduction is the difference between baseline consumption and actual consumption during the event. Specific methodology (e.g., 10-in-10, 5-in-10, or other averaging period) is detailed in CPS Energy's Technical Guidebook for Energy Efficiency and Demand Response but not publicly disclosed in web-based program materials.",
    "baseline_methodology_reference": "CPS Energy uses methodologies from Texas Technical Reference Manual (Texas TRM) version 7.0 except where noted. The utility calculates a probability-weighted estimate of the average kW savings during the twenty hours with the highest probability of occurring during CPS Energy's system peak, an approach used by all investor-owned electric utilities in Texas since 2016.",
    "day_of_adjustment": {
      "enabled": "not specified",
      "optional": "not specified",
      "method": "not specified",
      "cap_percentage": null,
      "direction": null
    },
    "metering_requirements": "Interval meter data required for baseline and performance measurement. CPS Energy provides interval metering for commercial customers as part of its vertically integrated utility infrastructure."
  },
  "special_programs": {
    "is_rec_based": false,
    "rec_type": null,
    "scheduled_dispatch": false,
    "clean_peak_standard": false,
    "special_attributes": [
      "Municipal utility structure - CPS Energy is the largest municipally-owned combined electric and gas utility in the US",
      "Vertically integrated utility - operates generation, transmission, distribution, and retail",
      "Part of ERCOT grid but serves captive customer base in San Antonio",
      "Integrated with Sustainable Tomorrow Energy Plan (STEP) targeting 410 MW demand reduction by 2027",
      "Automatic winter enrollment for summer participants",
      "Tiered program structure - separate 'My Business Rewards' for small businesses (<100 kW) and commercial program for larger customers",
      "Test events available to estimate reduction potential",
      "Utility assistance provided to identify curtailment strategies",
      "No retail choice - all San Antonio customers served by CPS Energy",
      "2024 program reached 2,761 businesses through various STEP programs",
      "Roughly 24 MW of commercial demand response currently enrolled"
    ]
  },
  "program_history": {
    "launch_year": null,
    "program_evolution": [
      {
        "year": null,
        "change_description": "Commercial demand response program has been part of CPS Energy's portfolio for multiple years as part of their energy efficiency and demand-side management initiatives."
      },
      {
        "year": 2023,
        "change_description": "Winter demand response program launched as CPS Energy's first winter DR initiative, running December 1 through March 30. This expansion was driven by lessons learned from Winter Storm Uri (2021) and the need to manage winter peak demand during extreme cold events."
      },
      {
        "year": 2024,
        "change_description": "FY 2024 (February 1, 2023 - January 31, 2024) STEP portfolio reached 537,391 residences and 2,761 businesses through weatherization, energy efficiency, demand response, and solar programs. Current payment rates: Summer $70-73/kW (small business tier), Winter $40-45/kW (commercial tier), with bonus options available."
      }
    ],
    "budget_committed_through": null,
    "total_annual_budget": null,
    "step_integration": "Demand response is part of CPS Energy's Sustainable Tomorrow Energy Plan (STEP), which is the utility's comprehensive energy efficiency and demand-side management initiative. STEP targets 410 MW of incremental demand reduction by 2027. The winter 2023-24 program had an estimated cost of up to $4.5 million in credits and payouts, with potential energy conservation of 90 MW across all customer segments (residential thermostats, residential batteries, and commercial/industrial).",
    "participation_statistics": "Approximately 24 MW of savings from commercial demand response volunteers as of recent reporting. The broader STEP program serves 2,761 businesses as of FY 2024."
  },
  "historical_events": [],
  "data_sources": [
    {
      "source_name": "CPS Energy Commercial Demand Response Program Page",
      "url": "https://www.cpsenergy.com/en/my-business/savenow/comm-dr.html",
      "last_updated": "2024-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "CPS Energy My Business Rewards Demand Response Program Page",
      "url": "https://www.cpsenergy.com/en/my-business/savenow/mbr-demand-response.html",
      "last_updated": "2024-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "San Antonio Report - CPS Energy Winter Demand Response Explainer",
      "url": "https://sanantonioreport.org/cps-energy-winter-demand-response-program-explainer/",
      "last_updated": "2024-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "CPS Energy Technical Guidebook for Energy Efficiency and Demand Response FY23",
      "url": "https://commercial-savenow.cpsenergy.com/_assets/FY23%20CPS%20Guidebook_Final%2003092022.pdf",
      "last_updated": "2024-10-11",
      "data_type": "program_rules",
      "notes": "PDF document containing detailed baseline methodologies and technical specifications (not fully text-extractable)"
    },
    {
      "source_name": "CPS Energy Wikipedia - Organizational Structure",
      "url": "https://en.wikipedia.org/wiki/CPS_Energy",
      "last_updated": "2024-10-11",
      "data_type": "enrollment",
      "notes": "Background on CPS Energy as municipal utility, relationship with ERCOT"
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": true,
    "api_available": false,
    "api_documentation_url": null,
    "data_quality_score": 7.5,
    "last_verified_date": "2024-10-11",
    "notes": "CPS Energy's commercial demand response program is moderately suitable for battery optimization integration. Key advantages: (1) Well-defined payment rates with clear seasonal structure, (2) Multiple notification options allow flexibility in response strategy, (3) No penalties for non-participation creates optionality value, (4) Test events available to calibrate system performance, (5) Integration with ERCOT grid creates potential for dual revenue (DR + energy arbitrage), (6) Voluntary participation per event reduces compliance risk. Key challenges: (1) No published API for automated dispatch - likely requires phone/email/SMS notification monitoring, (2) Baseline methodology details not fully transparent in public documentation, (3) Distinction between small business (<100 kW) and larger commercial (>100 kW) payment structures is not fully clear for summer program, (4) Winter program structure differs significantly from summer (capped at 40 hours total vs per-kW seasonal payment), (5) Event frequency and timing patterns not well-documented (though typical 25 summer events specified). For battery systems: The 30-minute notification option is ideal for automated battery dispatch. Summer program economics are strong ($73/kW for ~25 events = potential for significant seasonal revenue). Winter program adds supplemental revenue but with hour cap. The bonus hours program (7-10 PM, $10/kW) provides additional evening revenue. Municipal utility structure means no retail provider switching risk and stable long-term program outlook. Recommend sizing battery systems to deliver sustained curtailment for 3+ hours to capture full event value. Contact cpsesavenow@cpsenergy.com for enrollment and to request: (1) Detailed baseline methodology, (2) Historical event calendar with actual call times, (3) API or automated notification options, (4) Clarification of payment rates for commercial customers >100 kW in summer program."
  },
  "data_quality_assessment": {
    "verified_data_points": [
      "My Business Rewards summer program: $73/kW for 30-minute notice option",
      "My Business Rewards summer program: $70/kW for 2-hour notice option",
      "My Business Rewards bonus hours: $10/kW for 7-10 PM events",
      "Commercial winter program: $45/kW for 30-minute response (up to 40 hours, 10 events)",
      "Commercial winter program: $40/kW for 60-minute response (up to 40 hours, 10 events)",
      "Backup generator option (winter): $35/kW during Energy Emergency Alerts",
      "Summer season: June 1 - September 30",
      "Winter season: December 1 - March 30",
      "Summer events: approximately 25 per season",
      "Winter events: up to 10 per season",
      "Summer bonus events: approximately 16 additional events",
      "Summer event window: weekdays 1-7 PM",
      "Bonus hours window: weekdays 7-10 PM",
      "Event duration: typically less than 3 hours",
      "Notification methods: email, text, phone",
      "Small business threshold: <100 kW demand",
      "Commercial threshold: >100 kW demand",
      "Automatic winter enrollment for summer participants",
      "Test events available for participants",
      "Utility assistance provided for curtailment strategies",
      "Municipal utility structure",
      "ERCOT integration",
      "STEP program target: 410 MW demand reduction by 2027",
      "Current commercial DR enrollment: approximately 24 MW",
      "FY 2024 business participation: 2,761 businesses",
      "Winter program budget estimate: up to $4.5 million (all segments)",
      "Contact email: cpsesavenow@cpsenergy.com",
      "Contact phone: (210) 353-2728, option 3 then 2 (My Business Rewards)",
      "Business line: 210-353-3333"
    ],
    "data_gaps": [
      "Minimum kW requirement for Commercial Demand Response program (>100 kW tier)",
      "Specific baseline calculation methodology (10-in-10, 5-in-10, or other)",
      "Day-of adjustment availability and parameters",
      "Payment timing (when payments are issued after events)",
      "Historical event calendar with actual dates and times",
      "Summer program payment rates for commercial customers >100 kW (unclear if same $70-73/kW rates apply)",
      "Maximum capacity limit (if any)",
      "Event granularity/settlement interval (5-min, 15-min, hourly)",
      "Minimum event duration",
      "Maximum event duration (beyond 'typically less than 3 hours')",
      "Minimum rest hours between events",
      "Maximum consecutive events",
      "Enrollment windows and deadlines",
      "Contract term length",
      "Renewal process",
      "Performance verification process and timeline",
      "Dispute resolution procedures",
      "Third-party aggregator participation rules",
      "Explicit battery storage eligibility confirmation",
      "API availability for automated dispatch",
      "Front-of-meter resource eligibility",
      "Program launch year",
      "Total annual program budget",
      "Winter event call windows (time of day)",
      "How winter 40-hour cap is enforced (per event? cumulative?)"
    ],
    "confidence_level": "high",
    "verification_method": "All data extracted from official CPS Energy program webpages, San Antonio Report news coverage, and Wikipedia organizational documentation. Cross-referenced payment rates, program parameters, and seasonal structures across multiple sources. Municipal utility structure and ERCOT relationship verified through independent sources.",
    "data_integrity_notes": "STRICT DATA INTEGRITY MAINTAINED - NO DATA INVENTED. All payment rates, program parameters, and operational details are sourced from official CPS Energy webpages or verified news sources. Where information differs between small business (<100 kW) and commercial (>100 kW) tiers, this is explicitly noted. The distinction between the 'My Business Rewards' program and the broader 'Commercial Demand Response' program is maintained throughout. Any fields without verified data are marked as 'not specified' or 'not available' rather than using estimated or invented values.",
    "researcher_notes": "CPS Energy operates two distinct commercial demand response program tiers: (1) 'My Business Rewards Demand Response' for small businesses with <100 kW demand, and (2) 'Commercial Demand Response' for larger commercial and industrial customers with >100 kW demand. The available documentation provides complete payment details for the small business tier ($70-73/kW summer, with bonus hours) but limited details for the larger commercial tier summer program. Winter program details ($40-45/kW for up to 40 hours) are clearly stated for commercial/industrial customers. The program structure is more complex than typical utility DR programs due to: (1) Two customer size tiers, (2) Separate summer and winter programs with different payment structures, (3) Multiple notification options with different payment rates, (4) Bonus hours program for extended evening participation. The municipal utility context is important - CPS Energy is the largest municipally-owned combined electric and gas utility in the US, serving San Antonio as a vertically integrated utility. This means: customers have no retail choice, the utility owns generation/transmission/distribution, and DR programs are integrated into city energy policy through STEP. The winter program is relatively new (launched 2023) and represents an expansion of DR to address winter peak concerns following Winter Storm Uri. ERCOT integration means events likely correlate with high wholesale prices and grid emergencies, creating potential for energy arbitrage during events. Key contact for program details: cpsesavenow@cpsenergy.com. Recommend requesting: (1) Summer payment rates for commercial customers >100 kW, (2) Complete baseline methodology documentation, (3) Historical event data with dates/times/durations, (4) Clarification on winter 40-hour cap implementation, (5) API or automated notification options for battery systems. The 24 MW of current commercial participation suggests the program is established with meaningful enrollment, but could grow significantly given San Antonio's large commercial customer base and the 410 MW STEP demand reduction target."
  }
}
