{
  "program_id": "AUSTIN-ENERGY-COMMERCIAL-DEMAND-RESPONSE",
  "program_name": "Commercial Demand Response",
  "utility": "Austin Energy",
  "state": "Texas",
  "iso_rto_territory": "ERCOT",
  "program_type": "utility",
  "status": "active",
  "payment_structure": {
    "capacity_payment": {
      "rate": "not available",
      "billing_frequency": "not available",
      "notes": "Program uses performance-based incentives only"
    },
    "performance_payment": {
      "rate": "$50-$80/kW average reduction (Standard DR: $50-$70/kW, Fast DR: $65-$80/kW)",
      "conditions": "Based on average kW saved during events. Fast ADR with Year 1 Bonus: $265-$280/kW. Existing participant ADR upgrade bonus: $200/kW"
    },
    "bill_credit": {
      "rate": "Annual incentive payment",
      "structure": "Paid via check or bill credit. Minimum annual incentive: $25. Maximum annual incentive: $76,000 per facility"
    }
  },
  "event_parameters": {
    "notification_time": "Standard DR: 30 minutes, Fast DR: 10 minutes",
    "event_duration": "Up to 2 hours",
    "max_events_per_season": 25,
    "max_hours_per_season": "not explicitly stated (25 events × 2 hours = 50 hours maximum theoretical)",
    "seasons": [
      {
        "name": "Summer Peak Season",
        "months": "June 1 - September 30",
        "event_window": "1 PM - 7 PM",
        "excluded_days": "Independence Day, Labor Day"
      }
    ]
  },
  "eligibility": {
    "customer_classes": ["commercial"],
    "minimum_load": "20 kW total reduction capability across all facilities",
    "minimum_reduction_percentage": "Approximately 10% reduction capability required",
    "meter_requirements": "Advanced (AMI) meter required",
    "excluded_customers": [],
    "restrictions": [
      "Cannot use standby/emergency generators to offset load during events"
    ]
  },
  "baseline_methodology": "not available - methodology not disclosed on website",
  "battery_suitability": {
    "rating": "Good",
    "justification": "The program explicitly prohibits standby/emergency generators, but does not mention battery storage restrictions. The Fast DR option with 10-minute notification is well-suited for battery response times. Payment structure of $65-$80/kW (Fast DR) with potential $265-$280/kW first-year ADR bonus makes it financially attractive. However, limitations include: (1) Only 25 events/year × 2 hours = 50 hours maximum revenue opportunity, (2) Events limited to 1-7 PM summer window (June-Sept), (3) Performance-based payment requires demonstrable load reduction from baseline, which may be challenging for behind-the-meter batteries if not clearly metered separately, (4) No capacity payments for availability outside events, (5) Unclear if batteries can participate in ERCOT wholesale markets simultaneously. The ADR (Automated Demand Response) capability suggests integration with modern control systems is supported, which is positive for battery management systems."
  },
  "data_sources": [
    "https://savings.austinenergy.com/commercial/offerings/load-management/commercial-demand-response",
    "https://savings.austinenergy.com/commercial/offerings/load-management"
  ],
  "research_notes": "This is a performance-based incentive program, NOT a traditional capacity + performance DR program. Key findings: (1) Payment is one-time annual incentive based on average kW reduction, not ongoing monthly capacity payments, (2) Three tiers available: Standard DR ($50-$70/kW), Fast DR ($65-$80/kW), and Fast ADR with bonus ($265-$280/kW first year), (3) Program is summer-only (June-Sept) with afternoon peak focus (1-7 PM), (4) Generator prohibition is clear but battery storage not explicitly mentioned - likely allowed, (5) ADR capability with $200/kW upgrade bonus for existing participants suggests strong technology integration, (6) Maximum facility incentive cap of $76,000 limits scalability for large installations, (7) No information found about: baseline calculation methodology, wholesale market participation rules, multi-program stacking restrictions, (8) Enrollment requires using Energy Profiler Online tool - suggests data-driven baseline establishment, (9) Annual performance reports provided to participants. CONCERN: Performance-based payment structure may create uncertainty for battery project economics compared to capacity-based programs. Recommendation: Contact Austin Energy directly (512-482-5346) for: baseline methodology details, battery storage clarification, wholesale market participation rules, multi-year contract terms.",
  "research_date": "2025-10-11",
  "research_quality_score": 6,
  "research_quality_notes": "Moderate quality. Website provides clear event parameters, notification times, incentive rates, and eligibility requirements. However, critical information missing: baseline methodology, explicit battery storage language, wholesale market restrictions, contract duration, performance measurement details. Payment structure is unusual (annual lump sum vs. ongoing payments) which may affect battery economics. Would need direct utility contact or tariff sheet review to fill gaps."
}
