{
  "program_id": "program_batch11_009_xcel_nd_rate_savings",
  "program_name": "Electric Rate Savings",
  "program_type": "utility_retail",
  "status": "active",
  "description": "Commercial and industrial demand response program offering monthly bill credits to customers who commit to reducing load by at least 50 kW during peak demand periods. Launched in 1990, this program provides financial incentives for peak load reduction through demand charge discounts. Customers receive a per-kW discount on controllable demand every month in exchange for curtailing to pre-determined levels when called by the utility, primarily during summer peak periods (June-September).",
  "geography": {
    "states": ["ND"],
    "utilities": ["Xcel Energy"],
    "iso_rto_territory": "MISO",
    "iso_territory_clarification": "Xcel Energy serves North Dakota customers in MISO territory. Service area includes approximately 89,000 electric customers across communities in three main hubs: Minot, Grand Forks, and Fargo in North Dakota.",
    "service_territories": ["North Dakota"],
    "customers_served": 89000,
    "major_cities": ["Fargo", "Grand Forks", "Minot"]
  },
  "relationship_to_other_programs": {
    "xcel_multi_state_program": {
      "relationship": "same_program_multiple_states",
      "description": "Electric Rate Savings is offered across multiple Xcel Energy service territories including Minnesota, Wisconsin, and North Dakota. Program structure is similar across states but tariff details may vary by jurisdiction.",
      "other_states": ["MN", "WI", "CO"],
      "notes": "Program launched in 1990 and has been operating for 35+ years across Xcel Energy territories"
    },
    "isoc_interruptible_program": {
      "relationship": "complementary_for_larger_loads",
      "description": "Interruptible Service Option Credit (ISOC) is an alternative interruptible tariff program for larger C&I customers. Provides bill savings for curtailing to pre-established levels when called by utility.",
      "notes": "ISOC may be more suitable for very large industrial facilities while Electric Rate Savings targets broader C&I market"
    },
    "time_of_day_service": {
      "relationship": "stackable_option",
      "description": "Customers can add time-of-day service to save more on energy costs by shifting part of load to off-peak hours (9 p.m. - 9 a.m.)",
      "stackable": true
    }
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "minimum_capacity_kw": 50
    },
    "behind_the_meter": true,
    "front_of_meter": false,
    "resource_types": ["controllable load", "backup generators", "battery storage"],
    "resource_notes": "Program participants reduce electricity use by various methods including: shutting off lights, air conditioning, manufacturing processes, OR using backup generators. Battery storage participation not explicitly mentioned but appears compatible given program structure.",
    "requires_aggregator": false,
    "enrollment_notes": "Businesses, schools, government agencies and other large electricity users can participate by committing to reduce electricity use to a contracted level of their own choosing during peak-use periods"
  },
  "notification": {
    "day_ahead_notice": "not specified",
    "minimum_notice_hours": null,
    "notification_methods": ["utility dispatch call"],
    "notes": "Utility calls upon participants to reduce load during peak demand events. Specific notification timing not disclosed in public documentation."
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": null,
      "unit": "$/kW-month",
      "structure": "monthly bill credit",
      "notes": "Customers receive a per-kW discount on controllable demand every month. Exact rate per kW not disclosed in publicly accessible documentation. Described as 'reduced demand charges' and 'monthly discounts' for load reduction commitments."
    },
    "performance_rate": {
      "value": null,
      "unit": null,
      "notes": "Program provides monthly capacity-style payments, not event-based performance payments"
    },
    "penalty_structure": {
      "has_penalties": true,
      "description": "Under their agreements with Xcel Energy, participants who don't reduce electricity use at Xcel Energy's request pay a penalty",
      "penalty_amount": null,
      "penalty_details": "Exact penalty amounts not disclosed in public documentation but penalties are confirmed to apply for non-compliance"
    },
    "payment_timing": "monthly",
    "tariff_access": "Details available in North Dakota Electric Rate Book. Specific tariff section not identified through web research."
  },
  "event_parameters": {
    "typical_duration_hours": null,
    "minimum_duration_hours": null,
    "maximum_duration_hours": null,
    "max_events_per_year": 150,
    "max_hours_per_year": 150,
    "typical_season": "summer",
    "peak_months": ["June", "July", "August", "September"],
    "event_triggers": "Very hot, humid summer days, especially when temperatures are in the 90s for consecutive days",
    "notes": "Customers can be called on to reduce anytime during the year, but the great majority of events occur in summer. Maximum 150 hours of curtailment per year. Program activated during peak demand periods to help manage electrical grid during high-demand situations."
  },
  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_structure": "contracted_capacity",
    "contracted_level_description": "Customers commit to reduce electricity use to a contracted level of their own choosing during peak-use periods",
    "allows_price_bidding": false,
    "enrollment_period": {
      "start_date": null,
      "end_date": null,
      "notes": "Ongoing enrollment - specific enrollment windows not disclosed"
    }
  },
  "special_programs": {
    "is_rec_based": false,
    "scheduled_dispatch": false,
    "dispatch_type": "economic_dispatch",
    "special_attributes": [
      "long_running_program_since_1990",
      "self_selected_contracted_capacity",
      "summer_focused_events",
      "multiple_curtailment_methods_allowed"
    ]
  },
  "program_history": {
    "launch_year": 1990,
    "program_evolution": [
      {
        "year": 1990,
        "change": "Electric Rate Savings program launched"
      }
    ],
    "status_notes": "Active program operating for 35+ years across Xcel Energy service territories"
  },
  "battery_suitability": {
    "overall_rating": 7,
    "rating_rationale": "Good suitability for battery participation with several positive factors: (1) Monthly capacity-style payments provide predictable revenue, (2) Self-selected contracted capacity allows operators to size commitment appropriately, (3) Limited to 150 hours/year keeps cycling manageable, (4) Summer-focused events align with high-value periods, (5) No explicit prohibition on battery storage. Rating limited to 7/10 due to: (1) Payment rates not publicly disclosed making financial analysis difficult, (2) Penalties for non-performance create operational risk, (3) Uncertain notification timing requires operational flexibility, (4) Program designed for traditional load curtailment (may need clarification for battery discharge), (5) Minimum 50 kW threshold is relatively low but still requires commercial-scale battery.",
    "positive_factors": [
      "Monthly capacity payments provide stable revenue stream",
      "Self-selected contracted capacity allows tailored participation levels",
      "Limited to 150 hours per year (low cycling requirements)",
      "Summer peak focus aligns with highest value periods",
      "No explicit exclusion of battery storage",
      "Long program history (35+ years) indicates stability",
      "Behind-the-meter resource appropriate for battery systems",
      "Multiple curtailment methods accepted (generators mentioned, batteries likely similar)"
    ],
    "negative_factors": [
      "Payment rates not disclosed publicly - financial analysis uncertain",
      "Penalties for non-performance create risk",
      "Notification timing unclear - may limit ability to prepare",
      "Program language focused on 'load reduction' not 'generation' - may need clarification for battery discharge operations",
      "50 kW minimum requires commercial-scale battery (not residential)",
      "North Dakota has smaller customer base (89k) compared to other Xcel territories - may limit program scale/budget"
    ],
    "operational_considerations": {
      "cycling_impact": "Low - maximum 150 hours per year represents minimal battery degradation",
      "state_of_charge_management": "Manageable - summer-focused events allow advance charging preparation during known high-risk periods",
      "dispatch_predictability": "Moderate - events triggered by weather (90+ degree days) provide some predictability but exact timing uncertain",
      "notification_requirements": "Unknown - notification timing not disclosed, may require rapid response capability"
    },
    "revenue_stacking_potential": {
      "description": "Time-of-day service can be stacked with Electric Rate Savings program for additional savings. Battery could also potentially participate in MISO wholesale markets while providing retail DR, but this requires verification of program rules.",
      "stackable_programs": ["time_of_day_service"],
      "potential_programs_to_verify": ["miso_wholesale_dr"],
      "confidence": "moderate - time-of-day stacking explicitly mentioned, wholesale market participation needs verification"
    },
    "clarification_needed": [
      "Battery discharge to grid qualifies as 'load reduction' for program purposes",
      "Battery can participate alongside time-of-day rate for stacking",
      "Battery can participate in MISO wholesale markets while enrolled in retail program",
      "Notification timing and procedures for events",
      "Exact payment rate per kW-month",
      "Penalty structure and amounts for non-compliance",
      "Telemetry or metering requirements for battery systems"
    ]
  },
  "data_sources": [
    {
      "url": "https://www.piclo.energy/organisations/xcel-energy",
      "description": "Third-party energy platform describing Xcel Energy Electric Rate Savings program structure",
      "status": "accessible",
      "access_date": "2025-10-12",
      "key_findings": "50 kW minimum, reduced demand charges, monthly discounts, summer peak focus, June-September primary season, bill credits for curtailment"
    },
    {
      "url": "https://www.tdworld.com/distributed-energy-resources/demand-side-management/article/20955919/xcel-energys-savers-switch-program-reduces-demand",
      "description": "T&D World article on Xcel Energy demand response programs",
      "status": "accessible",
      "access_date": "2025-10-12",
      "key_findings": "Electric Rate Savings participants reduce electricity by shutting off equipment or using backup generators. Penalties apply for non-compliance. Program activated on hot, humid summer days with temperatures in 90s for consecutive days."
    },
    {
      "url": "https://www.energy.gov/eere/femp/demand-response-and-time-variable-pricing-programs-western-states",
      "description": "US Department of Energy listing of demand response programs",
      "status": "accessible",
      "access_date": "2025-10-12",
      "key_findings": "Electric Rate Savings program: customers willing to curtail load by at least 50 kW receive monthly credit on utility bills. Participating customers receive per-kW discount on controllable demand every month but must commit to reducing load to pre-determined level for up to 150 hours per year. Can be called anytime but majority of events occur in summer. Can add time-of-day service to save more."
    },
    {
      "url": "https://www.xcelenergy.com/company/rates_and_regulations/rates/rate_books",
      "description": "Xcel Energy Rate Books page",
      "status": "accessible",
      "access_date": "2025-10-12",
      "notes": "North Dakota Electric Rate Book referenced but specific tariff section for Electric Rate Savings not identified through web research. PDFs must be downloaded to view complete tariff details."
    },
    {
      "url": "https://mn.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings",
      "description": "Xcel Energy Minnesota business services page for Electric Rate Savings",
      "status": "page exists but content not accessible through web tools",
      "access_date": "2025-10-12",
      "notes": "Direct program page exists confirming active status but detailed content not extractable"
    },
    {
      "url": "https://wi.my.xcelenergy.com/s/business/rate-plans/electric-rate-savings",
      "description": "Xcel Energy Wisconsin business services page for Electric Rate Savings",
      "status": "page exists but content not accessible through web tools",
      "access_date": "2025-10-12",
      "notes": "Wisconsin version of program page exists, indicating multi-state program"
    },
    {
      "url": "https://corporate.my.xcelenergy.com/s/energy/service-areas/north-dakota",
      "description": "Xcel Energy North Dakota service area information",
      "status": "accessible",
      "access_date": "2025-10-12",
      "key_findings": "Xcel Energy serves less than 89,000 electric customers in North Dakota across communities in Minot, Grand Forks, and Fargo hubs"
    }
  ],
  "research_notes": "RESEARCH FINDINGS:\n\n1. PROGRAM CONFIRMATION: Electric Rate Savings program is CONFIRMED ACTIVE across multiple Xcel Energy service territories including North Dakota. Program has operated since 1990 (35+ years) indicating strong stability and track record.\n\n2. PROGRAM STRUCTURE: Classic capacity-based demand response program with monthly payments for committed load reduction capability. Customers self-select their contracted capacity commitment, receive monthly credits, and must perform when called during peak events (primarily summer).\n\n3. PAYMENT INFORMATION LIMITED: While program structure is well-documented, specific payment rates ($/kW-month) are not disclosed in publicly accessible sources. Described as 'reduced demand charges', 'monthly discounts', and 'per-kW credits' but exact dollar amounts require access to North Dakota Electric Rate Book tariff schedules or direct utility contact.\n\n4. OPERATIONAL DETAILS: \n   - Minimum 50 kW commitment\n   - Maximum 150 hours of curtailment per year\n   - Events primarily June-September (summer peaks)\n   - Triggered by hot weather (90+ degree days)\n   - Penalties apply for non-compliance\n   - Multiple curtailment methods accepted (load reduction, backup generation)\n\n5. BATTERY COMPATIBILITY: Program does not explicitly mention battery storage but structure appears compatible:\n   - Behind-the-meter resource model fits battery systems\n   - Monthly capacity payments align with battery economics\n   - Limited annual hours (150) minimize cycling/degradation\n   - Program accepts multiple curtailment methods (generators mentioned)\n   - No explicit prohibition on battery participation\n   - CLARIFICATION NEEDED: Battery discharge as 'load reduction' vs 'generation'\n\n6. STACKING OPPORTUNITIES: Program explicitly allows stacking with time-of-day rates for additional savings. Potential for MISO wholesale market participation requires verification.\n\n7. NORTH DAKOTA CONTEXT: Xcel Energy serves relatively small North Dakota customer base (~89k customers) compared to other service territories. Program operates in MISO territory.\n\n8. MULTI-STATE PROGRAM: Electric Rate Savings operates in Minnesota, Wisconsin, North Dakota, and Colorado with similar structure across territories. Core program design consistent but tariff details vary by jurisdiction.\n\n9. DATA QUALITY: Moderate to good data quality. Program existence, structure, eligibility, and operational parameters are well-documented through multiple sources. Primary gap is specific payment rates which require tariff access.\n\n10. PROGRAM LONGEVITY: 35+ year operating history (since 1990) demonstrates program stability and utility commitment to demand response. This long track record reduces regulatory/program continuity risk.",
  "research_date": "2025-10-12",
  "research_quality_score": 6,
  "quality_score_rationale": "Moderate-good score (6/10) reflects: POSITIVE - Program existence confirmed through multiple independent sources, operational structure well-documented, eligibility requirements clear, event parameters detailed, multi-state operation verified, 35-year program history documented. NEGATIVE - Payment rates not disclosed in public documentation, notification procedures not detailed, penalty amounts not specified, battery storage compatibility requires clarification, tariff documents not directly accessible. Score of 6 indicates sufficient information for preliminary assessment but specific payment rates needed for detailed financial analysis. Recommend contacting Xcel Energy Business Solutions Center or accessing North Dakota Electric Rate Book for complete tariff details.",
  "verification_status": "CONFIRMED ACTIVE - Program existence and structure verified, payment rates require tariff access",
  "data_integrity_warning": "Payment rates NOT confirmed through web research. Program structure, eligibility, and operational parameters are well-documented from multiple sources. Battery storage compatibility appears favorable but requires clarification with utility that battery discharge qualifies as 'load reduction' for program purposes. DO NOT use for detailed financial modeling without confirming payment rates from North Dakota Electric Rate Book or direct utility contact.",
  "recommended_next_steps": [
    "Contact Xcel Energy Business Solutions Center for North Dakota",
    "Request current Electric Rate Savings payment rate ($/kW-month) for North Dakota customers",
    "Clarify battery discharge qualifies as 'load reduction' for program purposes",
    "Request notification procedures and timing for curtailment events",
    "Request penalty structure and amounts for non-compliance",
    "Access North Dakota Electric Rate Book to review complete tariff schedule",
    "Verify battery systems can stack Electric Rate Savings with time-of-day rates",
    "Verify battery can participate in MISO wholesale markets while enrolled in retail program",
    "Request metering/telemetry requirements for battery systems",
    "Ask about typical frequency of events in recent years (within 150 hour annual maximum)",
    "Request enrollment procedures and any minimum contract terms"
  ]
}
