{
  "program_id": "xcel_nd_savers_switch",
  "program_name": "Xcel Energy North Dakota Saver's Switch Program",
  "program_type": "utility",
  "status": "active",
  "description": "Xcel Energy's Saver's Switch program in North Dakota helps manage peak electricity demand by remotely cycling central air conditioning units and electric water heaters during high-demand periods. The program offers both residential and small business versions. Participants receive monthly credits during the summer season for allowing remote control of their AC units during peak demand events, which typically occur on hot summer days. The program uses a remote switch that cycles AC units on and off for brief 15-20 minute intervals while the fan continues to circulate air. The program operates in the MISO market region serving North Dakota and South Dakota.",
  "geography": {
    "states": ["ND"],
    "utilities": ["Xcel Energy"],
    "isos": ["MISO"],
    "service_territories": [
      "North Dakota portions of Xcel Energy service territory",
      "Primarily serves portions of eastern North Dakota"
    ],
    "critical_geography_note": "Xcel Energy's North Dakota and South Dakota service territories are part of the Midcontinent Independent System Operator (MISO) market, not ERCOT or SPP."
  },
  "eligibility": {
    "customer_classes": {
      "residential": true,
      "commercial": true,
      "industrial": false,
      "residential_max_kw": null,
      "size_threshold_notes": "Program is available to residential customers and small businesses. Business program is available in Minnesota and Wisconsin with requirements for central air conditioning units of at least 5 tons for Texas and New Mexico territories. North Dakota business eligibility not explicitly confirmed but program materials indicate business customers can participate."
    },
    "behind_the_meter": true,
    "front_of_meter": false,
    "minimum_capacity_kw": null,
    "maximum_capacity_kw": null,
    "resource_types": [
      "central_air_conditioning",
      "electric_water_heater"
    ],
    "requires_aggregator": false,
    "additional_requirements": [
      "Must be an Xcel Energy customer in North Dakota",
      "Must have central air conditioning installed (no window units, wall units, or ductless mini-splits)",
      "For renters/apartment/condo residents: property owner consent required",
      "Must provide access to AC unit for professional switch installation",
      "Remote-controlled switch must be installed by authorized licensed electrician at no cost to customer"
    ]
  },
  "notification": {
    "day_ahead_notice": false,
    "minimum_notice_hours": null,
    "maximum_notice_hours": null,
    "notification_methods": [
      "automated_switch_activation"
    ],
    "notice_details": {
      "advance_notice_provided": "No specific advance notice documented - program operates via automated switch activation",
      "notification_to_customer": "Most customers 'don't even notice' when system is activated according to program materials. AC units cycle on and off for 15-20 minute intervals with fan continuing to circulate pre-cooled air."
    }
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": 5,
      "unit": "$/ton/month",
      "varies_by_season": true,
      "seasonal_rates": [
        {
          "season": "Summer (June-September)",
          "rate": 5,
          "unit": "$ per ton per month",
          "notes": "Residential and business customers receive $5 per ton of enrolled air conditioning per month during June through September. A typical 3-ton residential AC unit would receive $15/month or $60 for the summer season."
        }
      ],
      "payment_timing": "Monthly bill credits during June through September"
    },
    "performance_rate": {
      "value": null,
      "unit": null,
      "varies_by_season": false,
      "varies_by_time": false,
      "notes": "No performance-based payment. All compensation is based on enrolled AC tonnage capacity for the summer season."
    },
    "penalty_structure": {
      "has_penalties": false,
      "penalty_rate": null,
      "penalty_unit": null,
      "penalty_description": "No penalties documented for non-performance or override of switch."
    },
    "bonus_payments": [],
    "payment_caps": {
      "maximum_annual_incentive": null,
      "minimum_annual_incentive": null,
      "payment_method": "bill_credit",
      "notes": "Payment based on enrolled AC tonnage. For business customers in Minnesota/Wisconsin, the rate is documented as $5/ton/month from June-September. Assuming similar rates apply in North Dakota (not explicitly confirmed). Typical residential 3-ton unit: $60/summer. Typical commercial 10-ton unit: $200/summer."
    },
    "forward_curve_available": false,
    "forward_curve_url": null
  },
  "seasons": [
    {
      "season_name": "Summer Peak Season",
      "start_date": "06-01",
      "end_date": "09-30",
      "max_events": null,
      "max_hours": null,
      "notes": "Primary season for AC cycling events. Program is typically activated during times when electricity demand approaches peak levels on hot summer days."
    }
  ],
  "call_windows": [
    {
      "window_id": "summer_afternoon_peak",
      "start_hour": 14,
      "end_hour": 19,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday",
        "Saturday",
        "Sunday"
      ],
      "seasons": ["Summer Peak Season"],
      "timezone": "America/Chicago",
      "notes": "Saver's Switch is generally activated during afternoon and early evening hours on high-demand days. AC compressor cycles off for brief 15-20 minute intervals while fan continues circulating air. Average event duration is approximately 4 hours."
    }
  ],
  "event_parameters": {
    "typical_duration_hours": 4,
    "minimum_duration_hours": null,
    "maximum_duration_hours": null,
    "event_granularity_minutes": null,
    "response_time_minutes": null,
    "max_events_per_season": null,
    "max_events_per_year": null,
    "max_hours_per_season": null,
    "max_hours_per_year": null,
    "max_consecutive_events": null,
    "minimum_rest_hours": null,
    "cycling_specifications": {
      "ac_cycling_pattern": "Brief 15-20 minute intervals (compressor cycled off)",
      "fan_operation": "Fan stays on continuously during cycling to circulate pre-cooled air",
      "customer_impact": "Most customers don't even notice the system's activation"
    },
    "historical_frequency": {
      "notes": "Specific historical event frequency for North Dakota not documented in public sources. Program is activated during peak demand periods on hot summer days."
    }
  },
  "nomination_bidding": {
    "requires_nomination": false,
    "nomination_frequency": "none",
    "nomination_deadline": null,
    "allows_price_bidding": false,
    "bidding_structure": null,
    "enrollment_period": {
      "start_date": null,
      "end_date": null,
      "recurring": true,
      "notes": "Rolling enrollment available. Customers can enroll at any time through Xcel Energy website or by contacting customer service. Must commit to one-year participation."
    },
    "enrollment_process": [
      "Complete online enrollment or contact Xcel Energy",
      "Xcel Energy schedules switch installation appointment",
      "Authorized licensed electrician installs remote-controlled switch on AC unit",
      "Customer begins receiving monthly summer bill credits"
    ]
  },
  "performance_measurement": {
    "baseline_methodology": "not_applicable",
    "measurement_granularity": "program_participation",
    "performance_verification": "payment_based_on_enrolled_capacity_not_measured_performance",
    "reporting": "no_individual_performance_reporting",
    "notes": "This is a traditional direct load control program. Customers receive payment based on enrolled AC tonnage for allowing control, regardless of actual load reduction achieved during events. No individual metering or performance measurement required."
  },
  "special_programs": {
    "is_rec_based": false,
    "rec_type": null,
    "scheduled_dispatch": false,
    "clean_peak_standard": false,
    "special_attributes": [
      "traditional_direct_load_control",
      "hardware_switch_required",
      "multi_state_program",
      "miso_territory"
    ],
    "multi_state_participation": {
      "total_customers_all_states": 398000,
      "states_included": ["Minnesota", "Colorado", "Wisconsin", "Michigan", "North Dakota", "South Dakota", "New Mexico", "Texas"],
      "program_consistency": "Program operates across multiple Xcel Energy service territories with similar structure but state-specific regulatory frameworks and potentially different payment rates"
    },
    "grid_operator_integration": {
      "grid_operator": "Midcontinent Independent System Operator (MISO)",
      "ercot_integration": false,
      "miso_coordination": "Xcel Energy coordinates load management with MISO regional transmission organization for North Dakota and South Dakota territories",
      "critical_note": "This program operates in MISO territory, not ERCOT. North Dakota and South Dakota are part of MISO market."
    }
  },
  "program_history": {
    "launch_year": 1990,
    "program_evolution": [
      {
        "year": 1990,
        "change_description": "Saver's Switch program originally launched by Xcel Energy (Northern States Power at the time)"
      },
      {
        "year": 2024,
        "change_description": "Program continues operating with approximately 382,500 residential and 15,500 small business customers enrolled across Upper Midwest territories"
      }
    ],
    "budget_committed_through": null,
    "total_annual_budget": null,
    "total_enrolled_customers": 398000,
    "enrollment_note": "Approximately 398,000 customers enrolled across all Xcel Energy service territories. Upper Midwest (Minnesota, Wisconsin, North Dakota, South Dakota, Michigan) has approximately 382,500 residential and 15,500 small business participants. North Dakota-specific enrollment numbers not disclosed separately."
  },
  "historical_events": [],
  "program_operations": {
    "control_mechanism": "Remote-controlled hardware switch installed on AC unit by authorized licensed electrician",
    "cycling_method": "Automated cycling of AC compressor (brief 15-20 min intervals) while fan continues operating",
    "customer_comfort": "Program designed to minimize customer discomfort - fan continues circulating pre-cooled air, most customers don't notice activation",
    "override_capability": null,
    "installation": "Professional installation by authorized licensed electrician at no cost to customer",
    "aggregate_capacity": "Program could reduce electricity demand by approximately 388 megawatts across Upper Midwest territories during peak events"
  },
  "data_sources": [
    {
      "source_name": "Xcel Energy Residential Saver's Switch Page",
      "url": "https://my.xcelenergy.com/s/residential/heating-cooling/savers-switch",
      "last_updated": "2025-10-12",
      "data_type": "program_rules",
      "verification_status": "primary_source",
      "notes": "Official Xcel Energy program page confirming availability across service territories including North Dakota."
    },
    {
      "source_name": "Xcel Energy Business Saver's Switch Sign-up Page",
      "url": "https://www.xcelenergy.com/business_saver's_switch",
      "last_updated": "2025-10-12",
      "data_type": "program_rules",
      "verification_status": "primary_source",
      "notes": "Business enrollment page confirming program available in Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. For Texas and New Mexico, enrolled commercial AC units must be at least 5 tons."
    },
    {
      "source_name": "T&D World Article - Xcel Energy Saver's Switch Program Reduces Demand",
      "url": "https://www.tdworld.com/distributed-energy-resources/demand-side-management/article/20955919/xcel-energys-savers-switch-program-reduces-demand",
      "last_updated": "2025-10-12",
      "data_type": "program_rules",
      "verification_status": "secondary_source",
      "notes": "Industry publication describing program operations, enrollment numbers, and capacity reduction potential."
    },
    {
      "source_name": "FMLink Article - Xcel Energy Customers Help Reduce Demand",
      "url": "https://www.fmlink.com/articles/xcel-energy-customers-help-reduce-electricity-demand-with-saver%EF%BF%BDs-switch-program/",
      "last_updated": "2025-10-12",
      "data_type": "program_rules",
      "verification_status": "secondary_source",
      "notes": "Article describing program structure including 382,500 residential and 15,500 small business customers enrolled in Upper Midwest, cycling intervals, and aggregate 388 MW demand reduction potential."
    },
    {
      "source_name": "Web Search Results on Xcel Business Saver's Switch Eligibility",
      "url": "https://mn.my.xcelenergy.com/s/business/rate-plans/savers-switch",
      "last_updated": "2025-10-12",
      "data_type": "program_rules",
      "verification_status": "secondary_source",
      "notes": "Business program details for Minnesota and Wisconsin indicating $5/ton/month June-September payment rate and eligibility requirements."
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": false,
    "api_available": false,
    "api_documentation_url": null,
    "data_quality_score": 5.0,
    "last_verified_date": "2025-10-12",
    "notes": "CRITICAL LIMITATION: This program operates in MISO territory, NOT ERCOT. It cannot be integrated with ERCOT battery optimization strategies. Program is traditional direct load control with hardware switch installation. Limited optimization value due to: (1) non-ERCOT territory, (2) payment structure based on enrolled AC tonnage with no performance measurement, (3) automated switch control with no customer dispatch flexibility, (4) no real-time price signals, (5) residential/small business focus not designed for commercial battery systems.",
    "optimization_considerations": [
      "NOT APPLICABLE TO ERCOT BATTERY OPTIMIZATION - Program is in MISO territory serving North Dakota",
      "Traditional direct load control program - not suitable for commercial battery dispatch optimization",
      "No dispatch flexibility - automated switch control only",
      "Payment is flat monthly credit based on AC tonnage, not performance-based",
      "No real-time price signals or market integration",
      "Hardware switch controls load directly - no customer decision-making or bidding",
      "Program designed for traditional residential and small business AC load, not batteries"
    ],
    "ercot_relevance": "NONE - This program operates in MISO territory serving North Dakota, completely separate from ERCOT jurisdiction. It has no integration with ERCOT markets, ERCOT demand response programs, or ERCOT price signals.",
    "battery_applicability": "Not applicable. This is a traditional residential and small business direct load control program for AC units with hardware switch installation. It does not support behind-the-meter battery participation and provides no economic optimization opportunities for battery storage systems. Payments are based on enrolled AC tonnage capacity, not on actual dispatch or performance of energy storage resources.",
    "research_caveats": [
      "North Dakota-specific payment rates not explicitly confirmed - assuming similar to Minnesota/Wisconsin rate of $5/ton/month June-September",
      "North Dakota-specific enrollment numbers not disclosed separately - only aggregate Upper Midwest numbers available",
      "Business program eligibility in North Dakota confirmed but specific size requirements not documented (5-ton minimum applies to Texas and New Mexico only)",
      "Advanced notice hours not specified - program appears to operate via automated switch with no customer notification",
      "Maximum events per year and maximum control hours not explicitly stated in public materials",
      "Historical event frequency for North Dakota not available from public sources",
      "Individual event dates and historical event log not publicly available"
    ]
  },
  "critical_program_details": {
    "utility_type": "investor_owned_utility",
    "operating_company": "Xcel Energy - Northern States Power Company",
    "grid_operator": "Midcontinent Independent System Operator (MISO) - NOT ERCOT",
    "regulatory_jurisdiction": "North Dakota Public Service Commission (for retail programs), FERC (for wholesale/transmission)",
    "service_territory_specifics": "Eastern North Dakota portions of Xcel Energy service territory in MISO market",
    "program_type_classification": "Traditional direct load control (DLC)",
    "payment_model": "Capacity-based monthly credits during summer season based on enrolled AC tonnage",
    "customer_value_proposition": "Monthly bill credits ($5/ton/month June-September) in exchange for allowing occasional automated AC cycling during peak demand periods. Typical 3-ton residential AC earns $60/summer.",
    "grid_benefit": "Provides capacity resource to MISO for managing peak demand and grid reliability. Approximately 388 MW aggregate demand reduction potential across Upper Midwest territories.",
    "multi_state_context": "Part of broader Xcel Energy Saver's Switch program operating across 8 states with approximately 398,000 enrolled customers including 382,500 residential and 15,500 small business in Upper Midwest"
  },
  "research_notes": {
    "data_integrity": "Program eligibility and structure verified from official Xcel Energy sources. Business program confirmed available in North Dakota through business enrollment page listing North Dakota among eligible states. Payment rate of $5/ton/month for Minnesota/Wisconsin business customers documented but North Dakota-specific rate not explicitly confirmed. Grid operator context (MISO) verified. Enrollment numbers are aggregate across Upper Midwest with North Dakota-specific breakdown not disclosed. No data was invented - where specific North Dakota details were not available, this is explicitly noted.",
    "missing_information": [
      "North Dakota-specific payment rate (assumed similar to Minnesota/Wisconsin at $5/ton/month but not explicitly confirmed)",
      "North Dakota-specific enrollment numbers (only aggregate Upper Midwest numbers available)",
      "Business program size requirements for North Dakota (5-ton minimum documented for Texas/New Mexico only)",
      "Exact maximum events per year and maximum control hours",
      "Advance notification hours (appears program operates via automated switch)",
      "Historical event frequency specific to North Dakota",
      "Detailed historical event log (dates, times, durations) not publicly available",
      "Customer override capabilities not specified",
      "API or automated integration capabilities not documented"
    ],
    "clarifications": {
      "miso_not_ercot": "CRITICAL: Xcel Energy's North Dakota service territory operates in the Midcontinent Independent System Operator (MISO) regional transmission organization, NOT in ERCOT. This means the program has NO integration with ERCOT markets, ERCOT demand response programs, or ERCOT operational mechanisms.",
      "residential_and_business": "Unlike some jurisdictions where Saver's Switch is residential-only, the program in the Upper Midwest region (including North Dakota) is available to both residential customers and small businesses. Business enrollment page explicitly lists North Dakota as eligible state.",
      "payment_structure": "This is a capacity payment program based on enrolled AC tonnage. Customers receive monthly credits during June-September for allowing control. Minnesota/Wisconsin business rate is documented as $5/ton/month. Residential program materials mention 15% discount or $5/ton but specific North Dakota residential rate not clearly stated.",
      "hardware_requirement": "Unlike modern smart thermostat programs, this program requires physical installation of a remote-controlled switch by authorized licensed electricians. This is traditional direct load control technology.",
      "customer_experience": "Program marketing emphasizes that 'most customers don't even notice' when the switch is activated because the fan continues running and cycling occurs in brief 15-20 minute intervals.",
      "multi_state_program": "Saver's Switch operates across multiple Xcel Energy service territories. Total enrollment across all states is approximately 398,000 customers with Upper Midwest (Minnesota, Wisconsin, North Dakota, South Dakota, Michigan) having approximately 382,500 residential and 15,500 small business participants.",
      "aggregate_capacity": "The program could reduce electricity demand by approximately 388 megawatts across Upper Midwest territories during peak demand events."
    },
    "research_duration_minutes": 35,
    "researcher_confidence": "medium-high",
    "confidence_note": "High confidence in program availability and general structure. Medium confidence in specific payment rates and requirements for North Dakota due to limited state-specific documentation. Payment rate of $5/ton/month assumed based on Minnesota/Wisconsin business program but not explicitly confirmed for North Dakota.",
    "verification_date": "2025-10-12",
    "critical_limitation_for_ercot_battery_optimization": "THIS PROGRAM IS NOT RELEVANT FOR ERCOT BATTERY OPTIMIZATION. It operates in MISO territory (North Dakota), not ERCOT territory. It is a traditional direct load control program for residential and small business AC units with capacity-based payments, not a market-based demand response program suitable for commercial battery storage optimization. The program has no integration with ERCOT markets, prices, or operational systems."
  }
}
