{
  "program_id": "AMEREN-MO-DR-002",
  "program_name": "Ameren Missouri Demand Response Program (Utility Bilateral Program)",
  "program_type": "utility_bilateral",
  "status": "active",
  "description": "Ameren Missouri's Demand Response Program is a utility-level bilateral program delivered exclusively through Enel North America (formerly Enel X). This is a RETAIL DEMAND RESPONSE PROGRAM separate from MISO wholesale market programs, though it provides resources to the MISO transmission system. The program targets commercial and industrial customers who can earn recurring capacity payments for agreeing to curtail load during periods of high grid demand. Events are triggered when real-time operations forecast demand within 1% of system peak. The program is part of Ameren Missouri's MEEIA (Missouri Energy Efficiency Investment Act) portfolio approved by the Missouri Public Service Commission, with $51 million invested annually in 2025-2026 and $22 million in 2027 toward demand response programs. This bilateral approach provides more stable pricing compared to the volatility of MISO's LMR capacity auction.",
  "geography": {
    "states": ["MO"],
    "utilities": ["Ameren Missouri"],
    "isos": ["MISO"],
    "service_territories": ["Ameren Missouri service territory in eastern Missouri (MISO Zone 5)", "St. Louis metropolitan area", "Eastern Missouri municipalities", "Does NOT include western Missouri (SPP territory)"]
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "commercial_min_kw": 1000,
      "size_threshold_notes": "Program targets commercial and industrial customers with peak demands above 1 MW in summer months. Eligible customers include manufacturers, schools, data centers, cold storage facilities. All C&I Ameren Missouri customers can apply - Enel evaluates suitability based on load profile and curtailment capability."
    },
    "behind_the_meter": true,
    "front_of_meter": false,
    "minimum_capacity_kw": 1000,
    "maximum_capacity_kw": null,
    "resource_types": [
      "load curtailment",
      "HVAC adjustments",
      "lighting reductions",
      "production line modifications",
      "equipment rescheduling",
      "backup generation",
      "behind-the-meter battery storage (eligibility not explicitly documented)"
    ],
    "requires_aggregator": true
  },
  "notification": {
    "day_ahead_notice": false,
    "minimum_notice_hours": 1,
    "maximum_notice_hours": 6,
    "notification_methods": [
      "SMS",
      "email",
      "phone",
      "Enel North America dispatch system"
    ]
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": null,
      "unit": "$/kW-year",
      "varies_by_season": false,
      "notes": "Capacity payment rates are NOT publicly disclosed. Customers receive recurring capacity payments for agreeing to be on standby. Enel secures blocks of capacity in the bilateral market at a set rate to ensure strong and dependable capacity pricing year-over-year. Payment structure is customized per participant based on load reduction capability and contracted terms. Because Ameren Missouri participates in MISO Zone 5, the program benefits indirectly from MISO capacity auction prices but provides more stable payments than direct LMR participation. Missouri Zone 5 capacity prices have been highly volatile: $236.66/MW-day (2022-2023), $10/MW-day (2023-2024 Spring), $719.81/MW-day (2024-2025 Fall/Spring), $666.50/MW-day (2025-2026 Summer). Bilateral program shields customers from this volatility."
    },
    "performance_rate": {
      "value": null,
      "unit": "$/kWh",
      "varies_by_season": false,
      "varies_by_time": false,
      "notes": "Program appears to be capacity-only without separate performance payments during events. Enel manages all performance obligations and protects customers from underperformance penalties."
    },
    "penalty_structure": {
      "has_penalties": false,
      "penalty_rate": null,
      "penalty_unit": null,
      "penalty_description": "Enel North America protects customers from underperformance penalties. Aggregator manages performance risk and shields individual participants from MISO market penalties."
    },
    "bonus_payments": [],
    "forward_curve_available": false,
    "forward_curve_url": null
  },
  "seasons": [
    {
      "season_name": "Program Year",
      "start_date": "06-01",
      "end_date": "05-31",
      "max_events": null,
      "max_hours": null
    }
  ],
  "call_windows": [
    {
      "window_id": "peak_demand_periods",
      "start_hour": 15,
      "end_hour": 19,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": [
        "Summer"
      ],
      "timezone": "America/Chicago",
      "notes": "Events typically occur on afternoons (3 PM - 7 PM) with record high temperatures when systemwide demand approaches critical peak levels."
    }
  ],
  "event_parameters": {
    "typical_duration_hours": 3,
    "minimum_duration_hours": 1,
    "maximum_duration_hours": 4,
    "event_granularity_minutes": 60,
    "response_time_minutes": 60,
    "max_events_per_season": null,
    "max_events_per_year": null,
    "max_hours_per_season": null,
    "max_hours_per_year": null,
    "max_consecutive_events": null,
    "minimum_rest_hours": null,
    "notes": "Events occur only a few times per year when utility forecasts demand within 1% of system peak. Minimum 1 hour notice, maximum 6 hours notice. Event duration 1-4 hours. Actual event frequency for 2022-2024 not publicly disclosed."
  },
  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_frequency": "annual",
    "nomination_deadline": "Rolling enrollment - interested customers complete online inquiry form with Enel North America",
    "allows_price_bidding": false,
    "bidding_structure": "Aggregator-managed bilateral program. Customers do not bid - Enel negotiates fixed capacity payment contracts. Ameren Missouri team works with Enel to establish customized energy savings plans for each participant. No customer-facing bidding or price negotiations.",
    "enrollment_period": {
      "start_date": "Rolling enrollment year-round",
      "end_date": "Ongoing",
      "recurring": true
    }
  },
  "special_programs": {
    "is_rec_based": false,
    "rec_type": null,
    "scheduled_dispatch": false,
    "clean_peak_standard": false,
    "special_attributes": [
      "EXCLUSIVE PARTNERSHIP: Enel North America is the sole aggregator for Ameren Missouri DR program",
      "BILATERAL PROGRAM: This is a utility bilateral program, NOT direct MISO market participation",
      "100 MW TARGET: Enel manages 100 MW portfolio for Ameren Missouri (2019-2021+ agreement)",
      "STABLE PRICING: Program provides stable capacity payments vs volatile MISO LMR auction prices",
      "FULL SERVICE: Enel manages enrollment, M&V, dispatch, settlements, performance risk",
      "DUAL BENEFIT: Reduces peak demand on Ameren distribution network AND provides resources to MISO transmission system",
      "MEEIA PORTFOLIO: Part of Missouri Public Service Commission approved MEEIA Cycle 4 programs (Case EO-2023-0136)",
      "EVALUATION: Opinion Dynamics provides independent evaluation and optimization guidance",
      "BUDGET: $51M annually 2025-2026, $22M in 2027 for DR programs",
      "LAUNCHED: Program effective January 1, 2025 following PSC approval"
    ]
  },
  "program_history": {
    "launch_year": 2019,
    "program_evolution": [
      {
        "year": 2019,
        "change_description": "Enel X (now Enel North America) signed exclusive 100 MW demand response agreement with Ameren Missouri covering 2019-2021 program period"
      },
      {
        "year": 2023,
        "change_description": "Ameren Missouri filed MEEIA Cycle 4 application (Case EO-2023-0136) on March 27, 2023 with $366.75 million budget for 2024-2026 demand-side programs"
      },
      {
        "year": 2024,
        "change_description": "Missouri Public Service Commission approved revised multiyear energy efficiency and demand response plan following settlement negotiations. Evidentiary hearings held July 22-25, 2024. Joint Motion to Suspend filed October 11, 2024 notifying settlement reached."
      },
      {
        "year": 2025,
        "change_description": "Approved MEEIA Cycle 4 programs went into effect January 1, 2025 with $51 million annual investment in DR and EE programs for 2025-2026"
      },
      {
        "year": 2027,
        "change_description": "Planned reduction to $22 million annual investment specifically for demand response programs in 2027"
      }
    ],
    "budget_committed_through": 2027,
    "total_annual_budget": 51000000
  },
  "historical_events": [],
  "relationship_to_wholesale_markets": {
    "market_type": "MISO Zone 5 (Missouri)",
    "program_distinction": "UTILITY BILATERAL vs WHOLESALE MARKET",
    "stacking_rules": {
      "can_stack_with_miso_lmr": "UNKNOWN - not explicitly documented",
      "can_stack_with_miso_drr": "UNKNOWN - not explicitly documented",
      "can_stack_with_miso_orm": "UNKNOWN - not explicitly documented",
      "stacking_notes": "CRITICAL UNCERTAINTY: Research found no explicit documentation on whether customers can simultaneously participate in Ameren Missouri's bilateral DR program AND MISO wholesale programs (LMR, DRR, ORM) with the same load. Enel North America offers BOTH Ameren bilateral programs AND direct MISO market participation, describing bilateral programs as providing 'additional value' and 'more stable alternative' to LMR's volatility. This suggests programs may be mutually exclusive OR stacking may be allowed with load allocation rules. MISO rules prohibit dual registration of LMR as DRR with same load. For battery storage systems evaluating options, this stacking uncertainty creates planning risk. RECOMMENDATION: Direct inquiry to Enel North America and Ameren Missouri is required to clarify stacking rules."
    },
    "aggregator_role": "Enel North America manages both Ameren bilateral program AND direct MISO market participation for Missouri customers. Customers must choose participation path through Enel.",
    "resource_settlement": "Bilateral program resources help reduce peak demand on Ameren distribution network and provide additional resources to MISO transmission system. Enel manages all MISO market interactions - customers do not directly interface with MISO."
  },
  "data_sources": [
    {
      "source_name": "Ameren Missouri Demand Response Program Page",
      "url": "https://www.ameren.com/missouri/business/demand-response",
      "last_updated": "2025",
      "data_type": "program_rules"
    },
    {
      "source_name": "Enel North America - Ameren Missouri Demand Response",
      "url": "https://www.enelnorthamerica.com/solutions/energy-solutions/demand-response/ameren-missouri-demand-response",
      "last_updated": "2025",
      "data_type": "program_rules"
    },
    {
      "source_name": "Enel North America - Inside Ameren Missouri's New Demand Response Program",
      "url": "https://www.enelnorthamerica.com/insights/blogs/inside-launch-ameren-missouris-new-demand-response-program",
      "last_updated": "not available",
      "data_type": "program_rules"
    },
    {
      "source_name": "Enel North America - 100 MW DR Agreement Press Release",
      "url": "https://www.enelnorthamerica.com/about-us/newsroom/search-press/press/2019/05/enel-x-signs-100mw-demand-response-agreement-ameren-missouri",
      "last_updated": "2019-05",
      "data_type": "program_rules"
    },
    {
      "source_name": "Ameren Missouri - Multiyear Cost Saving Programs Launch",
      "url": "https://ameren.mediaroom.com/2025-01-09-Ameren-Missouri-launches-multiyear-cost-saving-programs-for-customers",
      "last_updated": "2025-01-09",
      "data_type": "program_rules"
    },
    {
      "source_name": "Missouri PSC Case EO-2023-0136 (MEEIA Cycle 4)",
      "url": "https://efis.psc.mo.gov/Case/Display/11093",
      "last_updated": "2024",
      "data_type": "regulatory_filing"
    },
    {
      "source_name": "Enel North America - MISO Demand Response",
      "url": "https://www.enelnorthamerica.com/solutions/energy-solutions/demand-response/miso-demand-response",
      "last_updated": "2025",
      "data_type": "program_rules"
    },
    {
      "source_name": "Midwest Energy Efficiency Alliance - Missouri MEEIA Cycle 4 Analysis",
      "url": "https://www.mwalliance.org/blog/missouri-energy-efficiency-dis-investment-actions-meeia-cycle-4-dockets",
      "last_updated": "not available",
      "data_type": "analysis"
    },
    {
      "source_name": "Opinion Dynamics - Ameren Missouri EE and DR Portfolio Evaluation",
      "url": "https://opiniondynamics.com/ameren-missouri-energy-efficiency-and-demand-response-portfolio-evaluation/",
      "last_updated": "not available",
      "data_type": "evaluation"
    },
    {
      "source_name": "Ameren Missouri 2023 Integrated Resource Plan",
      "url": "https://www.ameren.com/missouri/company/environment-and-sustainability/integrated-resource-plan",
      "last_updated": "2023",
      "data_type": "planning_document"
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": true,
    "api_available": false,
    "api_documentation_url": null,
    "data_quality_score": 6.0,
    "last_verified_date": "2025-10-11",
    "research_batch": "Batch 6",
    "research_date": "2025-10-11",
    "notes": "BATTERY ENERGY STORAGE SYSTEM (BESS) SUITABILITY ASSESSMENT:\n\nPROGRAM DISTINCTION - CRITICAL CONTEXT:\nThis is Ameren Missouri's UTILITY-LEVEL BILATERAL demand response program, which is SEPARATE from MISO wholesale market programs (LMR, DRR, ORM). In Batch 5, we researched MISO Missouri wholesale programs. This Batch 6 research focuses on the retail utility program delivered through Enel North America.\n\nBESS ELIGIBILITY:\n- BEHIND-THE-METER batteries: Eligibility NOT EXPLICITLY DOCUMENTED but backup generation is listed as acceptable resource type\n- FRONT-OF-METER batteries: NOT ELIGIBLE - program is for C&I customer load reduction only\n- Stand-alone batteries: UNLIKELY to qualify unless integrated with customer facility as behind-the-meter resource\n- Minimum size: 1 MW peak demand target suggests commercial-scale batteries (500 kW - 2 MW) would be most suitable\n\nPOSITIVE FACTORS FOR BESS:\n1. Aggregator-managed program removes complexity of direct market participation\n2. Enel North America is world's largest DR aggregator with extensive battery integration experience\n3. Stable bilateral capacity payments shield from MISO LMR price volatility ($10/MW-day to $719.81/MW-day swings)\n4. Strong utility financial commitment ($51M annually 2025-2026) indicates program stability\n5. 1-6 hour notification time allows adequate planning for battery dispatch\n6. 1-4 hour event duration aligns well with typical battery storage durations (2-4 hours)\n7. Limited event frequency (few times per year) minimizes battery cycling degradation\n8. Enel protects customers from underperformance penalties\n9. Program effective January 1, 2025 - recently approved by Missouri PSC\n\nLIMITING FACTORS FOR BESS:\n1. EXCLUSIVE AGGREGATOR: Must work through Enel - no direct utility contracts or alternative aggregators\n2. PAYMENT RATES NOT DISCLOSED: Capacity payment rates not publicly available - must negotiate with Enel\n3. BATTERY ELIGIBILITY UNCLEAR: No explicit documentation of battery storage acceptance or technology-specific requirements\n4. STACKING RULES UNKNOWN: Critical uncertainty about whether customers can participate in BOTH Ameren bilateral program AND MISO wholesale programs with same battery\n5. EVENT FREQUENCY UNCLEAR: Actual 2022-2024 event history not publicly disclosed\n6. MINIMUM 1 MW TARGET: Smaller batteries (<500 kW) may not meet program focus\n7. Aggregated portfolio approach may limit individual project revenue visibility\n8. Program appears focused on traditional C&I load curtailment - battery integration may require customized approach\n\nCRITICAL UNCERTAINTY - PROGRAM STACKING:\nRESEARCH FOUND NO EXPLICIT DOCUMENTATION on whether the same battery (or load resource) can simultaneously participate in:\n- Ameren Missouri bilateral DR program (this program) AND\n- MISO LMR (wholesale capacity) AND/OR\n- MISO DRR (wholesale demand response) AND/OR\n- MISO Operating Reserves Market\n\nEnel offers BOTH bilateral programs AND direct MISO participation, describing bilateral as 'additional value' and 'more stable alternative' to LMR. This language suggests mutual exclusivity but is not definitive.\n\nMISO rules prohibit dual registration of LMR as DRR with same load. Whether bilateral utility programs count as separate load or conflict with MISO registrations is UNKNOWN.\n\nCOMPARISON TO MISO WHOLESALE:\nAmeren Bilateral Program vs MISO LMR (from Batch 5 research):\n- Notification: 1-6 hours (Ameren) vs 6 hours min (MISO LMR)\n- Duration: 1-4 hours (Ameren) vs 4 hours min (MISO LMR)\n- Payment: NOT DISCLOSED, stable (Ameren) vs $10-$719.81/MW-day, volatile (MISO LMR)\n- Penalties: None, Enel protects (Ameren) vs 3x LMP, soon VOLL (MISO LMR)\n- Events: Few per year (Ameren) vs Up to 16/year (MISO LMR)\n- Minimum: 1 MW target (Ameren) vs 100 kW (MISO LMR)\n- Aggregator: Required, Enel only (Ameren) vs Optional (MISO LMR)\n\nRECOMMENDATIONS FOR BATTERY DEVELOPERS IN AMEREN MISSOURI TERRITORY:\n\n1. DUAL INQUIRY REQUIRED: Contact BOTH Enel North America AND Ameren Missouri to:\n   a. Confirm battery storage eligibility for bilateral program\n   b. Obtain specific capacity payment rates\n   c. Clarify program stacking rules with MISO wholesale programs\n   d. Understand event frequency expectations\n\n2. COMPARE REVENUE PATHWAYS:\n   - Bilateral only: Stable but potentially lower payments\n   - MISO LMR only: Volatile but potentially higher payments in deficit years\n   - Stacked (if allowed): Best of both but complex administration\n\n3. SITE SELECTION:\n   - Behind-the-meter C&I batteries: Best fit for bilateral program (schools, data centers, cold storage with demand >1 MW)\n   - Stand-alone batteries: Direct MISO ESR or LMR participation likely more suitable\n   - Front-of-meter batteries: Not eligible for this bilateral program\n\n4. SIZE OPTIMIZATION:\n   - Target 500 kW - 2 MW range to align with 1 MW+ program focus\n   - Smaller batteries (<500 kW) better suited for MISO LMR (100 kW minimum)\n\n5. CONSIDER AMEREN MISSOURI'S BESS EXPANSION:\n   - Ameren plans 800 MW utility-scale battery storage by 2035 (400 MW by 2030)\n   - Potential partnerships or interconnection opportunities may emerge\n   - Monitor IRP updates for distribution-connected battery opportunities\n\nDATA QUALITY ASSESSMENT (6.0/10):\nScore reflects SIGNIFICANT GAPS in public information:\n- Capacity payment rates: NOT DISCLOSED\n- Performance payment structure: NOT DISCLOSED\n- Battery storage eligibility: NOT EXPLICITLY DOCUMENTED\n- Program stacking rules: NOT DOCUMENTED\n- Historical event frequency 2022-2024: NOT DISCLOSED\n- Event duration statistics: NOT DISCLOSED\n- Penalty structure: NOT DISCLOSED\n- Minimum/maximum participation sizes: NOT PRECISELY DEFINED\n\nConfirmed information:\n+ Program exists and is active (effective January 1, 2025)\n+ Enel North America is exclusive aggregator\n+ Program part of MEEIA Cycle 4 portfolio\n+ $51M annual budget 2025-2026, $22M in 2027\n+ 1-6 hour notification, 1-4 hour events\n+ Few events per year\n+ C&I customers with >1 MW peak demand targeted\n+ PSC Case EO-2023-0136 provides regulatory foundation\n\nFINAL ASSESSMENT:\nModerate-to-low BESS suitability due to critical information gaps. Battery developers MUST conduct direct inquiry with Enel and Ameren Missouri before including this program in project financial models. The exclusive aggregator relationship and lack of public pricing create significant due diligence requirements. For behind-the-meter batteries at large C&I facilities in Ameren Missouri territory, this program may provide stable supplemental revenue if payment rates are competitive, but cannot be evaluated without direct negotiation with Enel.\n\nCROSS-REFERENCE:\nSee Batch 5 research for MISO Missouri wholesale programs:\n- program_batch5_010_miso_missouri_enriched.json (MISO LMR)\n- program_batch5_011_miso_missouri_drr_enriched.json (MISO DRR)\n- program_batch5_012_miso_missouri_edr_enriched.json (MISO EDR)\n- program_batch5_013_ameren_missouri_enel_enriched.json (Earlier Ameren-Enel research)\n\nThis Batch 6 research updates and supersedes Batch 5 program_batch5_013 with focus on retail utility program vs wholesale market distinction."
  }
}
