{
  "program_id": "CALIFORNIA-SDGE-CAPACITY-BIDDING-PROGRAM",
  "program_name": "Capacity Bidding Program (CBP)",
  "utility": "San Diego Gas & Electric (SDG&E)",
  "state": "California",
  "iso_rto_territory": "CAISO",
  "program_type": "utility",
  "status": "active",
  "payment_structure": {
    "capacity_payment": {
      "rate": "CPUC-approved rate in Schedule CBP tariff, paid at $/kW-month fluctuating monthly with most valuable months being July-September. Specific rates not publicly disclosed in web sources. Older reference indicates range of $7-$9/kW-month. Day-of option has higher capacity payments than day-ahead option.",
      "billing_frequency": "monthly",
      "recipient": "paid to aggregator (Voltus, Enel X) or direct to customer if self-aggregated; aggregator determines customer compensation independently",
      "calculation": "Payment based on average performance across all dispatch and audit hours in a month; if no dispatch or audit within a month, paid on full enrollment value"
    },
    "performance_payment": {
      "rate": "Energy payment equal to utility's city gate natural gas price × trigger heat rate of 15,000 BTU/kWh (specific $/kWh varies with gas prices)",
      "conditions": "Paid when event is called, up to 150% of nominated demand reduction",
      "payment_tiers": {
        "100%": "100% capacity payment for 100% demand reduction",
        "90-99.99%": "Proportional capacity payment for 90-100% demand reduction",
        "75-89.99%": "50% capacity payment for 75-89.99% demand reduction",
        "50-74.99%": "0% capacity payment for 50-74.99% demand reduction",
        "below_50%": "Penalty for <50% demand reduction"
      }
    },
    "penalty": {
      "rate": "$6.00/kWh",
      "conditions": "Charged for energy usage over FSL (Firm Service Level) during curtailment; penalty proportional to shortfall magnitude for <50% of nominated reduction"
    }
  },
  "event_parameters": {
    "notification_options": {
      "day_ahead": {
        "notification_time": "Day-ahead notification by 3 PM previous business day",
        "capacity_payment": "Lower than day-of option"
      },
      "day_of": {
        "notification_time": "Day-of notification 1 hour in advance of event (UNIQUE TO SDG&E - not offered by PG&E or SCE)",
        "capacity_payment": "Higher than day-ahead option"
      }
    },
    "event_duration_options": [
      "1-4 hour call option",
      "2-6 hour call option",
      "4-8 hour call option"
    ],
    "operational_hours": "Weekdays 11 AM - 7 PM",
    "max_events_per_day": "1 event maximum",
    "max_events_per_month": "Maximum 24 hours of events per month",
    "max_events_per_season": "not specified",
    "max_hours_per_season": "not specified",
    "seasons": ["Summer (May 1 - October 31)"],
    "event_trigger": "Triggered when natural gas price exceeds 15,000 BTU/kWh heat rate threshold; tied to CAISO PDR (Proxy Demand Resource) market awards based on aggregator's offer price"
  },
  "eligibility": {
    "customer_classes": [
      "commercial",
      "industrial",
      "agricultural"
    ],
    "minimum_load": "Over 20 kW per customer (100 kW aggregate per PDR when combined by aggregator to meet CAISO requirement)",
    "meter_requirements": "Interval meter recording data at regular intervals, remotely readable by SDG&E (assumed 15-minute intervals consistent with CAISO requirements)",
    "eligible_customer_types": [
      "Bundled customers (non-residential)",
      "Direct Access (DA) - must participate through aggregator",
      "Community Choice Aggregation (CCA) - must participate through aggregator"
    ],
    "excluded_customers": "not specified in available sources",
    "enrollment_options": [
      "Third-party aggregators (Voltus, Enel X)",
      "Self-aggregation with direct SDG&E management"
    ]
  },
  "baseline_methodology": "FSL (Firm Service Level) methodology - specific calculation details not publicly disclosed. Standard CBP programs typically use methodology where FSL cannot exceed 85% of customer's highest monthly maximum demand during summer on-peak and winter partial-peak periods over past 12 months. Performance measured against nominated capacity commitment.",
  "program_structure": {
    "enrollment": {
      "aggregator_managed": "Most customers enroll through third-party aggregators (Voltus 1-415-463-4236, Enel X)",
      "self_aggregation": "Businesses can work directly with SDG&E via drp@sdge.com or 1-866-377-4735",
      "process": "Submit documents, review, receive portal access and training"
    },
    "aggregator_role": "Aggregator determines customer incentives, manages portfolio, submits offer prices to CAISO PDR market, coordinates nominations, bears penalty risk for underperformance",
    "caiso_integration": "Tied to CAISO PDR (Proxy Demand Resource) market; events triggered by day-ahead market results when aggregator receives market award",
    "nomination_flexibility": "Customer determines own energy reduction commitment working with aggregator"
  },
  "unique_sdge_features": [
    "Day-of notification option (1 hour advance) - UNIQUE among CA IOUs",
    "Three product choices with different event duration ranges (1-4hr, 2-6hr, 4-8hr)",
    "Higher capacity payments for day-of option vs day-ahead",
    "Slightly different capacity payment rate schedule compared to PG&E and SCE"
  ],
  "comparison_to_pge_cbp": {
    "similarities": [
      "Both use CAISO PDR framework for wholesale market integration",
      "Same $6.00/kWh penalty rate for over-consumption",
      "Same energy payment formula (gas price × 15,000 BTU/kWh heat rate)",
      "Same May-October season",
      "Both allow aggregator-managed and self-aggregation options",
      "Similar FSL baseline methodology",
      "Same performance payment tiers (100%, proportional 90-100%, 50% for 75-89.99%, 0% for 50-74.99%)",
      "Both paid to aggregator who determines customer compensation",
      "Same weekday operational hours (11 AM - 7 PM)",
      "Both allow bundled, DA, and CCA customers"
    ],
    "differences": [
      "SDG&E offers DAY-OF NOTIFICATION (1 hour advance) - PG&E only offers day-ahead (by 5 PM)",
      "SDG&E has three event duration options (1-4hr, 2-6hr, 4-8hr) - PG&E has maximum 4 hours",
      "SDG&E notification at 3 PM (day-ahead) - PG&E at 5 PM (day-ahead)",
      "SDG&E minimum 20 kW per customer - PG&E 100 kW aggregate only",
      "SDG&E max 24 hours events/month - PG&E allows >6 events/month under Elect option",
      "SDG&E capacity payments likely different from PG&E rates (both CPUC-approved but utility-specific)"
    ],
    "strategic_notes": "SDG&E's day-of notification option is UNIQUE and offers higher payments but requires faster response capability. This may be CHALLENGING for batteries compared to day-ahead option which allows better SOC planning."
  },
  "battery_suitability": {
    "rating": "Excellent (day-ahead option) / Good (day-of option)",
    "justification": "Battery storage is highly suitable for SDG&E CBP due to: (1) Day-ahead option (3 PM notification) provides sufficient time for battery scheduling and SOC management; (2) Multiple event duration options (1-4hr, 2-6hr, 4-8hr) provide flexibility - 1-4hr option aligns perfectly with typical commercial batteries (2-4 hour duration); (3) Day-of option (1 hour advance) offers higher payments but requires rapid response - batteries can technically respond but SOC management is more challenging; (4) Minimum 20 kW threshold enables smaller batteries to participate individually; (5) Program explicitly allows commercial/industrial customers with no exclusion of battery storage or behind-the-meter resources; (6) Battery can precisely control discharge to stay below FSL, minimizing penalty risk with $6/kWh penalty; (7) Integration with CAISO wholesale markets (PDR) means batteries can potentially stack value with energy arbitrage and ancillary services; (8) Summer-only program (May-Oct) aligns with peak demand season when battery economics are strongest; (9) Aggregator model (Voltus, Enel X) provides professional management of complex CAISO market interactions; (10) Interval metering requirement matches battery telemetry capabilities; (11) Performance payment up to 150% of nominated reduction rewards accurate forecasting; (12) Weekday 11 AM-7 PM operational window is predictable for battery operations; (13) FSL baseline methodology appears favorable for batteries which can reliably deliver full nameplate capacity. STRATEGIC CONSIDERATION: Day-ahead option is RECOMMENDED for batteries due to better SOC planning capability, despite lower payments than day-of option. Day-of option requires sophisticated real-time dispatch logic.",
    "optimal_strategy": "Enroll in day-ahead option with 1-4 hour duration product for maximum compatibility with typical battery systems. Day-of option should only be considered for batteries with real-time dispatch automation and SOC buffer management.",
    "stacking_opportunities": [
      "CAISO energy arbitrage during non-event days",
      "CAISO ancillary services (regulation, spinning reserves)",
      "Retail TOU arbitrage (SDG&E has high TOU differentials)",
      "SGIP (Self-Generation Incentive Program) upfront rebates",
      "Potential dual enrollment in other SDG&E DR programs (verify compatibility)"
    ]
  },
  "data_sources": [
    "https://www.sdge.com/businesses/savings-center/energy-management-programs/demand-response/capacity-bidding-program",
    "https://docs.cpuc.ca.gov/published/Final_resolution/61087.htm",
    "Enel X aggregator documentation (attempted access - 403 error)",
    "Web search results: SDG&E CBP program details, CPUC resolutions, aggregator listings"
  ],
  "research_notes": "Key findings: (1) SDG&E's CBP is fundamentally similar to PG&E's CBP but with UNIQUE day-of notification option (1 hour advance) that offers higher capacity payments - this is NOT available from PG&E or SCE; (2) Three event duration options (1-4hr, 2-6hr, 4-8hr) provide flexibility not explicitly stated in PG&E program; (3) Specific $/kW capacity rates are CPUC-approved but not publicly disclosed in web sources - older reference suggests $7-$9/kW-month range; (4) Energy payments tied to natural gas prices (city gate price × 15,000 BTU/kWh heat rate); (5) FSL penalty structure ($6/kWh) identical to PG&E creates strong incentive for precise load reduction - batteries excel at this precision; (6) Program operates May-October only on weekdays 11 AM-7 PM; (7) Aggregators (Voltus, Enel X) bear financial risk and manage CAISO complexity; (8) CAISO PDR minimum 100 kW aggregate enables small batteries to participate; (9) Day-of option is STRATEGICALLY INTERESTING but operationally challenging - requires 1-hour response with limited SOC planning time; (10) No explicit battery storage exclusions found; commercial/industrial eligibility suggests behind-the-meter systems allowed; (11) Comparison to PG&E shows high similarity in structure but critical difference in notification options; (12) Payment tier structure rewards high performance (100% payment for 100% reduction) but has sharp drop-offs (0% payment for 50-75% reduction) - batteries should be conservative in nominations to ensure meeting targets; (13) 150% energy payment cap for over-performance is unique incentive. CRITICAL GAP: Specific 2024/2025 capacity payment rates not accessible - would require direct contact with SDG&E or aggregators for ROI analysis.",
  "research_date": "2025-10-12",
  "research_quality_score": 7,
  "research_quality_notes": "Good completeness: (1) Program structure, eligibility, and event parameters well documented from SDG&E website and CPUC resolution; (2) Unique features (day-of notification, three duration options) clearly identified; (3) Critical gap: specific capacity payment rates ($/kW-month by month) not accessible in public sources - Schedule CBP PDF could not be extracted; (4) Critical gap: exact FSL baseline calculation methodology not confirmed (inferred from PG&E structure); (5) Comparison to PG&E CBP comprehensive and highlights key differences; (6) Payment structure and penalty framework well documented; (7) Battery eligibility inferred from program design and lack of exclusions rather than explicit statement; (8) Aggregator information confirmed (Voltus, Enel X listed); (9) CAISO PDR integration well understood; (10) Strategic implications for batteries analyzed including day-ahead vs day-of trade-offs; (11) No customer case studies or actual participation data found; (12) Event trigger mechanism (15,000 BTU/kWh heat rate) documented; (13) Score of 7/10 reflects good understanding of program mechanics and unique features, with comparison to PG&E, but missing critical financial details (exact rates by month) needed for precise ROI analysis. Research sufficient for program characterization and battery suitability assessment but would require direct utility/aggregator contact for financial modeling."
}
