{
  "program_id": "aep_tx_load_mgmt_2024",
  "program_name": "AEP Texas Load Management Standard Offer Program",
  "program_type": "utility",
  "status": "active",
  "description": "AEP Texas Load Management Standard Offer Program is an emergency demand response program designed to maintain electric grid reliability during system-wide or local emergencies and critical peak demand periods. The program operates with separate Summer (June-September) and Winter (December-February) seasons, with different payment rates and minimum curtailment requirements for each season. Participants receive 30-minute advance notice and can meet load reduction requirements through load curtailment, qualified backup generators, or battery storage systems. Winter program offers $35/kW with 100 kW minimum reduction, while Summer program offers $9/kW with 5 kW minimum reduction. Performance is measured using 15-minute interval data from IDR or AMI meters against an adjusted baseline. Maximum event duration is 4 hours, with Summer events called within 1:00-7:00 PM CPT window and Winter events available 24x7.",
  "geography": {
    "states": ["TX"],
    "utilities": ["AEP Texas"],
    "isos": ["ERCOT"],
    "service_territories": [
      "AEP Texas Central (ESIID begins with 100327894)",
      "AEP Texas North (ESIID begins with 102040497)"
    ]
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "residential_max_kw": null,
      "commercial_min_kw": 500,
      "size_threshold_notes": "Non-residential AEP Texas customers must have peak electric demand of 500 kW or more. Summer program requires ability to reduce by 5 kW or more, while Winter program requires ability to reduce by 100 kW or more. These thresholds apply to the combined peak demand and reduction capability across customer sites."
    },
    "behind_the_meter": true,
    "front_of_meter": "not specified",
    "minimum_capacity_kw": 5,
    "maximum_capacity_kw": null,
    "resource_types": [
      "load curtailment",
      "qualified backup generator",
      "battery energy storage system"
    ],
    "requires_aggregator": false,
    "additional_notes": "Participants must have Interval Data Recording (IDR) meter or Advanced Meter Infrastructure (AMI) to enable 15-minute interval measurement. Program is available through energy efficiency service providers (aggregators) or directly to non-residential AEP Texas customers. Participants can curtail electrical load or transfer load to qualified back-up generation or storage systems."
  },
  "notification": {
    "day_ahead_notice": false,
    "minimum_notice_hours": 0.5,
    "maximum_notice_hours": null,
    "notification_methods": [
      "not specified"
    ],
    "notification_details": "AEP Texas notifies Project Sponsor to interrupt customer load with at least 30-minute advance notice before event begins. Notification methods are managed through the program sponsor/aggregator or directly to customer depending on enrollment structure. Winter program requires participants to be available 24 hours a day, seven days a week. Summer program events are called within defined dispatch windows."
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": null,
      "unit": "$/kW-season",
      "varies_by_season": true,
      "seasonal_rates": [
        {
          "season": "Summer",
          "rate": 9.00,
          "unit": "$/kW-season",
          "notes": "Summer Load Management Program (June - September). Minimum curtailment 5 kW. Dispatch window 1:00 PM - 7:00 PM CPT, non-holiday weekdays. Maximum event duration 4 hours."
        },
        {
          "season": "Winter",
          "rate": 35.00,
          "unit": "$/kW-season",
          "notes": "Winter Load Management Program (December - February). Minimum curtailment 100 kW. Available 24x7 including holidays. Typical peak conditions 6:00 AM - 10:00 AM CPT and 6:00 PM - 10:00 PM CPT. Maximum event duration 4 hours. For 2024-2025 Winter program period (December 1, 2024 - February 28, 2025), Central area budget is $650,700 and North area budget is $87,000."
        }
      ],
      "payment_timing": "AEP Texas verifies actual demand savings from interruptions through Verification Process. Payment is submitted to Project Sponsor based on verified savings achieved by interruptions. Payment equals average delivered kW multiplied by capacity payment rate as outlined in participant's agreement.",
      "verification_method": "Performance measured for every 15-minute interval during dispatch by averaging difference between demand and adjusted baseline. Baseline uses two components: (1) Shape - highest 8 usage days of 10 business days prior to dispatch, averaged in 15-minute intervals, (2) Height - baseline adjusted to reflect real-time consumption during 2-hour window prior to dispatch notification time."
    },
    "performance_rate": null,
    "penalty_structure": {
      "has_penalties": "not specified",
      "penalty_rate": null,
      "penalty_unit": null,
      "penalty_description": "Penalty structure for non-performance is not explicitly documented in available sources. Program focuses on achieving full earning potential by maintaining energy reduction target throughout every dispatch in a season. Enrollment values can be adjusted based on dispatch performance history and other feedback, suggesting performance-based consequences rather than explicit penalties."
    },
    "bonus_payments": [],
    "forward_curve_available": false,
    "forward_curve_url": null,
    "payment_details": "To achieve full earning potential, participants must maintain their energy reduction target throughout every dispatch in a season. Project sponsors (aggregators like Enel) work with participants to determine site enrollment value based on electrical load pattern, performance in dispatch readiness test, and site operations information. Payment is based on verified curtailed load as measured by interval meter data compared to adjusted baseline."
  },
  "seasons": [
    {
      "season_name": "Summer",
      "start_date": "06-01",
      "end_date": "09-30",
      "max_events": null,
      "max_hours": null,
      "notes": "Summer Load Management Program operates June through September. Events are called anytime within 1:00 PM - 7:00 PM CPT window on non-holiday weekdays. Maximum event duration is 4 hours. Minimum curtailment requirement is 5 kW. Incentive rate is $9/kW for the season."
    },
    {
      "season_name": "Winter",
      "start_date": "12-01",
      "end_date": "02-28",
      "max_events": null,
      "max_hours": null,
      "notes": "Winter Load Management Program operates December through February (last day). Events may be called anytime 24x7 including holidays. Typical peak conditions on ERCOT system during winter are between 6:00 AM - 10:00 AM CPT and 6:00 PM - 10:00 PM CPT. Maximum event duration is 4 hours. Minimum curtailment requirement is 100 kW. Incentive rate is $35/kW for the season. For 2024-2025 period: December 1, 2024 through February 28, 2025."
    }
  ],
  "call_windows": [
    {
      "window_id": "summer_afternoon",
      "start_hour": 13,
      "end_hour": 19,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": ["Summer"],
      "timezone": "America/Chicago",
      "notes": "Summer Load Management Program dispatch window: 1:00 PM - 7:00 PM Central Time, non-holiday weekdays only. Events may occur anytime within this window."
    },
    {
      "window_id": "winter_24x7",
      "start_hour": 0,
      "end_hour": 23,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday",
        "Saturday",
        "Sunday"
      ],
      "seasons": ["Winter"],
      "timezone": "America/Chicago",
      "notes": "Winter Load Management Program operates 24 hours a day, 7 days a week including holidays. Events may be called anytime. Typical ERCOT peak conditions are 6:00 AM - 10:00 AM CPT and 6:00 PM - 10:00 PM CPT, but events can occur outside these windows during grid emergencies."
    }
  ],
  "event_parameters": {
    "typical_duration_hours": null,
    "minimum_duration_hours": null,
    "maximum_duration_hours": 4.0,
    "event_granularity_minutes": 15,
    "response_time_minutes": 30,
    "max_events_per_season": null,
    "max_events_per_year": null,
    "max_hours_per_season": null,
    "max_hours_per_year": null,
    "max_consecutive_events": null,
    "minimum_rest_hours": null,
    "event_trigger_details": "Emergency demand response program triggered during system-wide or local emergencies and times of critical peak demand on the ERCOT grid. AEP Texas issues dispatches to maintain electric grid reliability. Events are called with 30-minute advance notice to Project Sponsor.",
    "load_reduction_requirements": "Summer: Minimum 5 kW reduction. Winter: Minimum 100 kW reduction. Performance measured in 15-minute intervals by comparing actual demand to adjusted baseline. To achieve full earning potential, participants must maintain energy reduction target throughout every dispatch in a season.",
    "performance_measurement": "AEP Texas measures performance for every 15-minute interval during dispatch by averaging the difference between demand and adjusted baseline. Baseline methodology: (1) Shape component uses highest 8 usage days of 10 business days prior to dispatch, calculating average demand in 15-minute intervals. (2) Height component adjusts baseline to reflect real-time consumption during 2-hour window prior to dispatch notification time."
  },
  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_frequency": "seasonal",
    "nomination_deadline": "not specified",
    "allows_price_bidding": false,
    "bidding_structure": "not applicable",
    "enrollment_period": {
      "start_date": "not specified",
      "end_date": "not specified",
      "recurring": true
    },
    "nomination_details": "Interested service providers or AEP Texas non-residential customers can register on program website. Two registration platforms: South TX (TCC): https://www.ecurtail.com/AEP/TCC/ and West TX (TNC): https://www.ecurtail.com/AEP/TNC/. Project sponsors (aggregators) work with participants to determine site enrollment value based on electrical load pattern, performance in dispatch readiness test, and site operations information. Program requires single program-wide audit during each season to demonstrate collective ability to deliver aggregated energy reduction target, scheduled at AEP Texas discretion within program hours."
  },
  "baseline_methodology": {
    "baseline_type": "Two-component adjusted baseline",
    "baseline_calculation": "Baseline uses two components: (1) SHAPE: Looks at highest 8 usage days of 10 business days prior to dispatch. Average demand is calculated in 15-minute intervals. (2) HEIGHT: AEP Texas adjusts baseline to reflect real-time consumption during 2-hour window prior to dispatch notification time. This two-part approach creates a more accurate baseline that accounts for both historical patterns and day-of conditions.",
    "day_of_adjustment": {
      "enabled": true,
      "optional": false,
      "method": "2-hour window prior to dispatch notification time",
      "cap_percentage": null,
      "direction": "bidirectional (adjusts to reflect actual conditions)"
    },
    "metering_requirements": "Interval Data Recording (IDR) meter or Advanced Meter Infrastructure (AMI) required. These meters provide 15-minute interval data necessary to calculate baseline and measure performance during events."
  },
  "special_programs": {
    "is_rec_based": false,
    "rec_type": null,
    "scheduled_dispatch": false,
    "clean_peak_standard": false,
    "special_attributes": [
      "Separate Summer and Winter programs with different rates and requirements",
      "Emergency-triggered events for grid reliability",
      "Two-component baseline methodology (shape + height)",
      "15-minute interval performance measurement",
      "Winter program operates 24x7 including holidays",
      "Summer program limited to afternoon/evening weekdays",
      "Allows qualified backup generators and battery storage",
      "Available through aggregators or direct enrollment",
      "Program-wide audit requirement each season",
      "Performance-based enrollment value adjustment"
    ]
  },
  "program_history": {
    "launch_year": null,
    "program_evolution": [
      {
        "year": null,
        "change_description": "Program launch date not specified in available documentation. Appears to be established utility demand response program rather than recent pilot."
      },
      {
        "year": 2024,
        "change_description": "2024-2025 Winter program rates: $35/kW for period December 1, 2024 through February 28, 2025. Central area budget: $650,700. North area budget: $87,000."
      }
    ],
    "budget_committed_through": null,
    "total_annual_budget": 737700,
    "total_annual_budget_notes": "Winter 2024-2025 combined budget for Central ($650,700) and North ($87,000) areas is $737,700. Summer program budget not specified. Total Texas IOU efficiency programs expected to reach $141M in 2024 and $151M in 2025, but AEP Texas specific allocation not detailed.",
    "participation_statistics": "not available"
  },
  "historical_events": [],
  "data_sources": [
    {
      "source_name": "AEP Texas Saves - Load Management Standard Offer Program",
      "url": "https://aeptxsaves.com/commercial-programs/load-management/",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "AEP Texas Summer and Winter Load Management Program Manual 2024-2025",
      "url": "https://aeptxsaves.com/wp-content/uploads/2024_-2025_-AEP_Texas_-LM-Manual.pdf",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "AEP Texas 2024 Commercial Standard Offer Program Manual",
      "url": "https://www.aeptexasefficiency.com/downloads/2024/2024%20AEP%20Texas%20CSOP%20Manual.pdf",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "Enel X - AEP Texas Load Management Program Guidelines",
      "url": "https://enel625.zendesk.com/hc/en-us/articles/18494056530839-AEP-Texas-Load-Management-Standard-Offer-Program-Guidelines",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": true,
    "api_available": false,
    "api_documentation_url": null,
    "data_quality_score": 8.0,
    "last_verified_date": "2025-10-11",
    "notes": "AEP Texas Load Management Program is well-suited for battery energy storage systems with several key considerations: (1) WINTER PROGRAM provides higher value at $35/kW but requires 100 kW minimum curtailment and 24x7 availability including holidays - ideal for larger commercial/industrial battery systems that can guarantee availability during cold weather emergencies. (2) SUMMER PROGRAM offers lower rate ($9/kW) but only requires 5 kW minimum, making it accessible to smaller systems - events limited to 1-7 PM weekday window align with typical peak solar + demand periods. (3) 30-MINUTE RESPONSE TIME is achievable for automated battery systems with proper controls. (4) 15-MINUTE INTERVAL MEASUREMENT provides granular performance tracking. (5) TWO-COMPONENT BASELINE (shape + day-of adjustment) is more sophisticated than simple historical average, requiring careful baseline management. (6) MAXIMUM 4-HOUR DURATION is within typical battery duration capabilities (1-4 hour systems). (7) NO EXPLICIT PENALTIES documented, but performance affects future enrollment values. (8) EMERGENCY-TRIGGERED EVENTS likely correlate with high ERCOT real-time prices, enabling dual revenue streams (DR payment + energy arbitrage). KEY UNCERTAINTIES: Event frequency not specified, making annual revenue forecasting difficult. Enrollment values are negotiated with aggregators based on site characteristics. Program-wide audit requirement may affect smaller participants. ERCOT INTEGRATION: Program is triggered by ERCOT system emergencies but does not appear to be directly integrated with ERCOT Emergency Response Service (ERS) wholesale market program. This is a utility-side program rather than wholesale market participation. CONTACT: Oliver Dayton, Program Manager, odayton-kahler@aep.com, 361-285-7677."
  },
  "contact_information": {
    "program_manager": "Oliver Dayton",
    "email": "odayton-kahler@aep.com",
    "phone": "361-285-7677",
    "enrollment_south_tx": "https://www.ecurtail.com/AEP/TCC/",
    "enrollment_west_tx": "https://www.ecurtail.com/AEP/TNC/",
    "general_program_email": "rgbego@AEP.com"
  },
  "data_quality_assessment": {
    "verified_data_points": [
      "$35/kW Winter program incentive rate (Dec-Feb)",
      "$9/kW Summer program incentive rate (Jun-Sep)",
      "500 kW minimum peak demand requirement",
      "100 kW minimum Winter curtailment requirement",
      "5 kW minimum Summer curtailment requirement",
      "30-minute advance notification",
      "4-hour maximum event duration",
      "15-minute interval performance measurement",
      "Summer dispatch window: 1:00 PM - 7:00 PM CPT, non-holiday weekdays",
      "Winter dispatch: 24x7 including holidays",
      "Typical Winter peak: 6:00 AM - 10:00 AM and 6:00 PM - 10:00 PM CPT",
      "IDR or AMI meter required",
      "Two-component baseline methodology (shape + height adjustment)",
      "Shape: Highest 8 of 10 business days prior to dispatch",
      "Height: 2-hour window adjustment prior to notification",
      "Winter 2024-2025 budget: $650,700 (Central) + $87,000 (North)",
      "Non-residential customer eligibility",
      "Qualified backup generators and battery storage allowed",
      "Available through aggregators or direct enrollment",
      "Program-wide audit requirement each season",
      "Contact: Oliver Dayton, 361-285-7677, odayton-kahler@aep.com"
    ],
    "data_gaps": [
      "Maximum events per season/year",
      "Total event hours per season/year",
      "Minimum rest hours between events",
      "Specific notification methods (phone, email, SMS, API)",
      "Historical event frequency and timing data",
      "Explicit penalty structure for non-performance",
      "Maximum capacity limit (if any)",
      "Enrollment deadlines and windows",
      "Program launch year and historical evolution",
      "Summer program budget allocation",
      "Current participation statistics and enrolled MW",
      "Dispatch readiness test procedures and timing",
      "Performance dispute resolution process",
      "Contract term length and renewal process",
      "Specific ERCOT ERS integration details",
      "Front-of-meter resource eligibility",
      "Aggregator commission/fee structure",
      "Whether multiple sites can be aggregated per enrollment"
    ],
    "confidence_level": "high",
    "verification_method": "All data extracted from official AEP Texas program webpages, program manuals (PDF), and aggregator (Enel X) documentation. Payment rates, minimum requirements, dispatch windows, and baseline methodology verified across multiple official sources. Contact information verified from official program webpage. Winter 2024-2025 budget figures extracted from program manual PDF via WebFetch tool. No data invented or estimated.",
    "researcher_notes": "STRICT DATA INTEGRITY MAINTAINED - NO DATA INVENTED. All numeric values, dates, and program parameters extracted from official AEP Texas sources or explicitly marked as 'not specified' or 'not available'. Key findings: (1) Winter program offers significantly higher incentive ($35/kW vs $9/kW) but requires much higher minimum curtailment (100 kW vs 5 kW) and 24x7 availability. (2) Summer program is more accessible to smaller participants but lower value. (3) Two-component baseline methodology is more sophisticated than typical 10-in-10 approach, using both historical shape and day-of height adjustment. (4) Program is emergency-triggered rather than scheduled dispatch, making event frequency unpredictable but likely correlated with extreme weather and high ERCOT prices. (5) 15-minute interval measurement provides granular performance tracking but requires careful baseline management. (6) Program does not appear to be directly integrated with ERCOT wholesale market programs (ERS) - this is a utility-side demand response program compensated through utility efficiency budgets rather than wholesale market clearing prices. (7) Winter 2024-2025 combined budget of $737,700 suggests limited total program capacity - at $35/kW, this represents ~21 MW of enrolled capacity if fully subscribed. (8) Program structure suggests it's designed for customers with flexible loads, backup generation, or battery storage who can respond quickly during grid emergencies. (9) Performance-based enrollment value adjustment (rather than explicit penalties) suggests program focuses on reliable performers rather than punishing non-performance. BATTERY OPTIMIZATION CONSIDERATIONS: Winter program is primary opportunity for larger battery systems (100+ kW curtailment capability). Summer program may be marginal for small batteries given low $9/kW rate unless combined with energy arbitrage opportunities. Key optimization challenge is unknown event frequency - recommend contacting Oliver Dayton to obtain historical event data before committing battery capacity. 30-minute response time and 4-hour duration are well within typical battery system capabilities. Two-component baseline methodology requires careful modeling to estimate expected performance payments. Emergency triggers suggest events correlate with periods when ERCOT real-time prices are elevated, creating potential for dual revenue streams (DR incentive + energy arbitrage), but this requires coordination between utility program participation and wholesale market bidding strategy."
  }
}
