{
  "program_id": "teco_standby_generator_2024",
  "program_name": "Tampa Electric Standby Generator Program",
  "program_type": "utility",
  "status": "active",
  "description": "Tampa Electric's Standby Generator Program is a utility-administered demand response program for commercial and industrial customers with on-site standby backup generators. Participants earn monthly bill credits by transferring their electrical load to backup generators during peak demand periods. The program operates year-round with distinct summer and winter call windows. CRITICAL NOTE: This program is explicitly designed for STANDBY GENERATORS (diesel, natural gas, or other fossil fuel generators) and is NOT confirmed as eligible for battery energy storage systems. All available documentation emphasizes 'standby generator' and 'backup generator' terminology, with program administration by Enel focusing on generator-based load transfer. No official source confirms battery storage eligibility.",
  "geography": {
    "states": ["FL"],
    "utilities": ["Tampa Electric Company (TECO)"],
    "isos": [],
    "service_territories": ["Tampa Electric service territory in West Central Florida including Hillsborough, Pasco, Pinellas, and Polk counties"]
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "residential_max_kw": null,
      "commercial_min_kw": 25,
      "size_threshold_notes": "Program is available to commercial and industrial customers with on-site standby generators. Minimum 25 kW transferable load requirement during peak periods."
    },
    "behind_the_meter": true,
    "front_of_meter": false,
    "minimum_capacity_kw": 25,
    "maximum_capacity_kw": null,
    "resource_types": [
      "standby generators - diesel",
      "standby generators - natural gas",
      "standby generators - propane",
      "standby generators - other fossil fuels"
    ],
    "requires_aggregator": false,
    "additional_notes": "CRITICAL ELIGIBILITY LIMITATION: All official program documentation uses terminology 'standby generator,' 'backup generator,' and 'qualified backup generator.' Program administration by Enel emphasizes switching electrical load to backup generators during dispatch events. Despite extensive research, NO official source confirms battery energy storage system (BESS) eligibility. The program appears designed for traditional fossil fuel generators, NOT battery storage systems. Under EPA classification, Tampa Electric categorizes this as a non-emergency generator program, meaning generators may be operated for demand response purposes beyond emergency use. However, this does not confirm battery eligibility - only that generators may run for grid support rather than just emergency backup."
  },
  "notification": {
    "day_ahead_notice": false,
    "minimum_notice_hours": null,
    "maximum_notice_hours": null,
    "notification_methods": [
      "text message",
      "email",
      "phone"
    ],
    "notification_details": "Participants can choose notification preferences (text, email, or phone). Bonus credits available for starting load transfer within 30 minutes of notification, suggesting notifications may occur with relatively short lead time. Enel's Network Operations Center (NOC) manages dispatch notifications and remains in communication with participants before, during, and after events. Day-ahead notice is not specified in available documentation. Events are called based on anticipated peak demand periods, with Enel providing as much lead time as possible."
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": 6.15,
      "unit": "$/kW-payment",
      "varies_by_season": false,
      "seasonal_rates": [],
      "payment_calculation_note": "Payment rate is $6.15 per average transferred kilowatt (kW) demand for load transfers during peak periods. The phrase 'per average transferred kilowatt demand' suggests this is a performance-based payment calculated on actual measured load reduction, not a flat capacity payment. Payment appears to be made as monthly bill credits. The documentation states participants receive credits 'even if they don't call on your generator,' but it's unclear whether this refers to a minimum payment or simply the potential to earn credits."
    },
    "performance_rate": null,
    "penalty_structure": {
      "has_penalties": "not specified",
      "penalty_rate": null,
      "penalty_unit": null,
      "penalty_description": "Penalty structure not specified in available documentation. Program includes suspension clause: 'If participation lapses for 3 out of 12 consecutive months, a suspension may apply.' This suggests mandatory participation requirements exist, but specific penalties for non-performance are not disclosed. Participants should refer to Section 7.550 and Rider Sections 3.200-3.202 of Tampa Electric Retail Tariff Book for complete penalty terms."
    },
    "bonus_payments": [
      {
        "description": "Bonus credits for rapid response",
        "rate": null,
        "unit": "not specified",
        "conditions": "Participants can earn bonus credits by starting load transfer within 30 minutes of notification. Specific bonus payment rate not disclosed in available documentation."
      }
    ],
    "forward_curve_available": false,
    "forward_curve_url": null,
    "payment_details": "Payments structured as monthly credits on electric bill. Documentation states participants can 'save about 12% on your bill with monthly bill credits,' suggesting significant potential savings for active participants. Payment is $6.15 per average transferred kW demand, with credits adjusting based on energy contribution. The relationship between transferred load and payment amount is not fully transparent in public documentation. For detailed payment calculations and terms, customers must review tariff sections 7.550 and 3.200-3.202."
  },
  "seasons": [
    {
      "season_name": "Summer",
      "start_date": "04-01",
      "end_date": "10-31",
      "max_events": null,
      "max_hours": 8,
      "notes": "Summer season runs April 1 through October 31. Load transfer periods occur 2 p.m. - 10 p.m. weekdays only (excludes weekends and holidays based on typical utility DR program structures, though not explicitly stated). Maximum transfer time is 8 hours per day during summer season."
    },
    {
      "season_name": "Winter",
      "start_date": "11-01",
      "end_date": "03-31",
      "max_events": null,
      "max_hours": 9,
      "notes": "Winter season runs November 1 through March 31. Load transfer periods are split: 6 a.m. - 11 a.m. (5 hours morning) AND 6 p.m. - 10 p.m. (4 hours evening) on weekdays only. Maximum transfer time is 5 hours morning OR 4 hours evening per day. Total daily maximum appears to be 9 hours if both windows could be called on same day, though this is not explicitly stated."
    }
  ],
  "call_windows": [
    {
      "window_id": "summer_peak",
      "start_hour": 14,
      "end_hour": 22,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": ["Summer"],
      "timezone": "America/New_York",
      "notes": "Summer call window: 2 p.m. - 10 p.m. (8-hour window) on weekdays during April 1 - October 31. Maximum daily transfer time is 8 hours. Events likely called during hottest afternoon/early evening hours when air conditioning load peaks. Weekday-only assumption based on standard utility DR practices; not explicitly confirmed in documentation."
    },
    {
      "window_id": "winter_morning",
      "start_hour": 6,
      "end_hour": 11,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": ["Winter"],
      "timezone": "America/New_York",
      "notes": "Winter morning call window: 6 a.m. - 11 a.m. (5-hour window) on weekdays during November 1 - March 31. Maximum morning transfer time is 5 hours. This window captures winter morning heating load peak as customers arrive at work and heat buildings. Weekday-only assumption based on standard utility DR practices; not explicitly confirmed in documentation."
    },
    {
      "window_id": "winter_evening",
      "start_hour": 18,
      "end_hour": 22,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": ["Winter"],
      "timezone": "America/New_York",
      "notes": "Winter evening call window: 6 p.m. - 10 p.m. (4-hour window) on weekdays during November 1 - March 31. Maximum evening transfer time is 4 hours. This window captures winter evening heating peak. Weekday-only assumption based on standard utility DR practices; not explicitly confirmed in documentation. Unclear whether both morning and evening windows could be called on same day."
    }
  ],
  "event_parameters": {
    "typical_duration_hours": null,
    "minimum_duration_hours": null,
    "maximum_duration_hours": 8,
    "event_granularity_minutes": null,
    "response_time_minutes": 30,
    "max_events_per_season": null,
    "max_events_per_year": null,
    "max_hours_per_season": null,
    "max_hours_per_year": null,
    "max_consecutive_events": null,
    "minimum_rest_hours": null,
    "event_frequency_notes": "Event frequency, typical duration, and annual limits not specified in public documentation. Maximum event duration varies by season and call window: Summer = 8 hours, Winter morning = 5 hours, Winter evening = 4 hours. Response time for bonus credits is 30 minutes from notification. Events are called based on anticipated peak demand periods on Tampa Electric's system. Participants may be called for load transfers anytime within designated call windows during summer and winter seasons. The participation lapse clause (suspension after non-participation in 3 of 12 months) suggests events may occur at least monthly, but this is not explicitly stated.",
    "load_transfer_requirements": "Participants must maintain at least 25 kW of transferable load during peak periods. Load transfer accomplished by switching electrical load from utility supply to qualified backup generator, either manually or automatically through Enel's Network Operations Center (NOC). Performance measured via interval meter data comparing baseline consumption to actual consumption during transfer periods."
  },
  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_frequency": "annual",
    "nomination_deadline": "not specified",
    "allows_price_bidding": false,
    "bidding_structure": "not applicable",
    "enrollment_period": {
      "start_date": "not specified",
      "end_date": "not specified",
      "recurring": true
    },
    "enrollment_details": "Enrollment requires: (1) Review program details in Tampa Electric Retail Tariff Book Section 7.550 (page 43) and Rider Sections 3.200-3.202 (page 15), (2) Register on Tampa Electric secure online portal, (3) Complete Standby Generator enrollment form through online portal. Enrollment appears open year-round but may have seasonal enrollment windows. Contact Tampa Electric Energy Experts at 813-275-3909 (weekdays 8 a.m. - 5 p.m.) for enrollment assistance. No price bidding - fixed payment rate of $6.15/kW. Program enrollment likely requires annual commitment based on 12-month participation lapse clause."
  },
  "baseline_methodology": {
    "baseline_type": "not specified",
    "baseline_calculation": "Not explicitly described in available public documentation. Payment based on 'average transferred kilowatt demand' suggests baseline established from historical usage patterns, with transferred load calculated as baseline minus actual load during event. Program requires interval metering (implied by ability to measure load transfers). Specific baseline methodology (e.g., 10-in-10, customer baseline load, etc.) should be confirmed in tariff documents or with Tampa Electric.",
    "day_of_adjustment": {
      "enabled": "not specified",
      "optional": "not specified",
      "method": "not specified",
      "cap_percentage": null,
      "direction": null
    },
    "metering_requirements": "Interval metering capability required to measure load transfers and calculate performance. Participants access energy data through Tampa Electric secure online portal. Advanced metering infrastructure enables measurement of load reduction during transfer periods."
  },
  "special_programs": {
    "is_rec_based": false,
    "rec_type": null,
    "scheduled_dispatch": false,
    "clean_peak_standard": false,
    "special_attributes": [
      "Generator-based demand response program (NOT confirmed for battery storage)",
      "Partnership with Enel North America for program administration",
      "Network Operations Center (NOC) support 24/7/365 before, during, and after events",
      "Automatic dispatch capability through Enel NOC (optional)",
      "Manual dispatch option available",
      "Bill credit payment structure (monthly credits on electric bill)",
      "Bonus payments for rapid 30-minute response",
      "Year-round program with distinct summer and winter call windows",
      "Suspension clause after 3 months non-participation in 12-month period",
      "Secure online portal for enrollment and energy data access",
      "Advance notification of grid stability issues (ancillary benefit)",
      "EPA classification as non-emergency generator program",
      "Low minimum capacity threshold (25 kW) compared to many C&I DR programs"
    ]
  },
  "program_history": {
    "launch_year": null,
    "program_evolution": [
      {
        "year": null,
        "change_description": "Tampa Electric partnered with Enel North America to deliver turnkey demand response program, achieving up to 40 MW of load reduction capability through generator-based DR."
      },
      {
        "year": 2024,
        "change_description": "Current payment rate is $6.15 per average transferred kW demand. Historical payment rates not available in public documentation."
      }
    ],
    "budget_committed_through": null,
    "total_annual_budget": null,
    "participation_statistics": "Enel case study indicates Tampa Electric program delivers up to 40 MW of turnkey demand response capacity. Individual participant counts and MW breakdown not publicly disclosed.",
    "notes": "Program launch date and detailed evolution timeline not available in public documentation. Program appears to be mature, established offering rather than pilot program. Tampa Electric categorizes this as non-emergency generator program under EPA rules, distinguishing it from emergency-only backup generator programs."
  },
  "historical_events": [],
  "data_sources": [
    {
      "source_name": "Tampa Electric Standby Generator Program Page",
      "url": "https://www.tampaelectric.com/business/saveenergy/standbygenerator/",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "Enel North America - Tampa Electric Demand Response",
      "url": "https://www.enelnorthamerica.com/solutions/energy-solutions/demand-response/tampa-electric-demand-response",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "Enel North America - Tampa Electric Case Study",
      "url": "https://www.enelx.com/n-a/en/resources/case-studies/tampa-electric-company",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "Tampa Electric Retail Tariff Book (reference)",
      "url": "https://www.tampaelectric.com/company/ourpowersystem/tariff/",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    },
    {
      "source_name": "Tariff Agreement for Provision of Standby Generator Transfer Service (PDF)",
      "url": "https://www.tampaelectric.com/49c591/siteassets/files/tariff/tariffsection7/tariffagrmtprovisionofstandbygeneratortransferservice_if.pdf",
      "last_updated": "2025-10-11",
      "data_type": "program_rules"
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": false,
    "api_available": false,
    "api_documentation_url": null,
    "data_quality_score": 6.5,
    "last_verified_date": "2025-10-11",
    "notes": "BATTERY STORAGE SUITABILITY ASSESSMENT: NOT RECOMMENDED FOR BATTERY SYSTEMS. This program is explicitly designed for standby generators (fossil fuel backup generators), NOT battery energy storage systems. CRITICAL ISSUES FOR BATTERY PARTICIPATION: (1) All official documentation uses 'standby generator' and 'backup generator' terminology with NO mention of battery storage eligibility, (2) Program administration by Enel emphasizes generator-based load transfer during dispatch events, (3) EPA classification as 'non-emergency generator program' specifically refers to fossil fuel generators running for demand response (not batteries), (4) No confirmation that battery discharge qualifies as 'load transfer' under program rules, (5) Tariff sections 7.550 and 3.200-3.202 would need review to confirm technology eligibility but were not accessible for this research. PROGRAM VALUE PROPOSITION (IF BATTERIES WERE ELIGIBLE - WHICH IS UNCONFIRMED): Payment rate of $6.15/kW is relatively modest compared to many C&I demand response programs ($20-50+/kW more common). The 25 kW minimum is accessible for smaller battery systems. Call windows are well-defined (summer afternoons, winter mornings/evenings) which would enable predictable dispatch scheduling. However, lack of disclosed event frequency, baseline methodology details, and penalty structure creates revenue uncertainty. The 30-minute response time is well-suited to battery systems. RECOMMENDATION: This program is designed for FOSSIL FUEL GENERATORS. Do NOT include in battery optimization models without explicit written confirmation from Tampa Electric that battery energy storage systems qualify as 'standby generators' under tariff definitions. Contact Tampa Electric Energy Experts (813-275-3909) and request: (1) Explicit confirmation whether battery storage systems qualify for program, (2) Complete tariff sections 7.550 and 3.200-3.202 with technology eligibility definitions, (3) Historical event frequency data, (4) Baseline calculation methodology details, (5) Penalty structure for non-performance."
  },
  "data_quality_assessment": {
    "verified_data_points": [
      "$6.15/kW payment rate per average transferred kilowatt demand",
      "25 kW minimum transferable load requirement",
      "Bonus credits for load transfer within 30 minutes of notification",
      "Summer season: April 1 - October 31",
      "Winter season: November 1 - March 31",
      "Summer call window: 2 p.m. - 10 p.m. (8 hours max)",
      "Winter morning call window: 6 a.m. - 11 a.m. (5 hours max)",
      "Winter evening call window: 6 p.m. - 10 p.m. (4 hours max)",
      "Suspension clause: Non-participation in 3 of 12 consecutive months triggers suspension",
      "Monthly bill credits as payment mechanism",
      "Commercial and industrial customer eligibility",
      "No third-party aggregator required (direct utility program)",
      "Partnership with Enel North America for program administration",
      "Enel NOC provides 24/7/365 support",
      "Optional automatic dispatch through Enel NOC or manual dispatch",
      "Program delivers up to 40 MW total capacity (per Enel case study)",
      "Notification methods: text, email, phone (participant choice)",
      "Secure online portal for enrollment and data access",
      "EPA classification as non-emergency generator program",
      "Tariff reference: Section 7.550 (page 43) and Riders 3.200-3.202 (page 15)",
      "Contact: 813-275-3909 weekdays 8 a.m. - 5 p.m."
    ],
    "data_gaps": [
      "Battery energy storage system eligibility NOT CONFIRMED - critical gap",
      "Detailed technology eligibility requirements (generator fuel types, emissions limits)",
      "Specific bonus payment rate for 30-minute response",
      "Event frequency (events per season, events per year)",
      "Typical event duration",
      "Minimum event duration",
      "Annual event hour limits",
      "Historical event call data (dates, times, durations)",
      "Detailed baseline calculation methodology",
      "Day-of adjustment availability and parameters",
      "Specific penalty structure for non-performance",
      "Whether payments are on committed capacity or actual performance",
      "Weekend and holiday event eligibility (assumed excluded but not stated)",
      "Whether both winter windows could be called same day",
      "Minimum rest period between events",
      "Enrollment deadlines and seasonal windows",
      "Contract term length",
      "Early termination provisions",
      "Performance verification methodology",
      "Dispute resolution process",
      "Metering and telemetry technical requirements"
    ],
    "confidence_level": "medium-high for generator program parameters; very low for battery eligibility",
    "verification_method": "All data extracted from official Tampa Electric program webpage, Enel North America case studies and program pages, and Florida PSC filing references. NO DATA INVENTED. Values marked as 'not specified' indicate information not available in accessible public sources. Battery eligibility gap represents critical limitation preventing confident assessment of program suitability for battery storage systems.",
    "researcher_notes": "STRICT DATA INTEGRITY MAINTAINED - NO DATA INVENTED. All values sourced from official Tampa Electric and Enel documentation or explicitly marked as 'not specified.' CRITICAL FINDING: This program is clearly designed for STANDBY GENERATORS (fossil fuel backup generators), NOT battery storage systems. Despite extensive research across 30+ sources including Tampa Electric official pages, Enel partnership documentation, Florida PSC filings, and general utility DR program resources, NO SOURCE confirms battery storage eligibility. The consistent use of 'standby generator,' 'backup generator,' and 'qualified backup generator' terminology, combined with program administration emphasis on generator-based load transfer, strongly suggests this is a GENERATOR-ONLY program. Battery storage systems should NOT be considered eligible without explicit written confirmation from Tampa Electric that BESS qualifies under program tariff definitions. The EPA 'non-emergency generator program' classification specifically refers to fossil fuel generators permitted to run for demand response (not just emergency backup), not battery systems. ENVIRONMENTAL CONCERNS: If program requires fossil fuel generators, participants must comply with air quality permits, emissions regulations, and potentially SPCC (Spill Prevention Control and Countermeasure) plans for fuel storage. Battery systems would not face these environmental restrictions but ELIGIBILITY REMAINS UNCONFIRMED. PAYMENT STRUCTURE ANALYSIS: The $6.15/kW rate is lower than many competitive C&I demand response programs. Without disclosed event frequency data, annual revenue cannot be reliably projected. If events occur monthly, maximum annual value would be approximately $74/kW-year (12 events × $6.15). However, payment calculation based on 'average transferred kilowatt demand' creates ambiguity about whether payment is capacity-based or performance-based. TARIFF ACCESS LIMITATION: Complete program rules in Tampa Electric Tariff Section 7.550 and Rider Sections 3.200-3.202 were referenced but PDF documents were not successfully extracted during this research. These tariff sections likely contain critical details on technology eligibility, performance requirements, penalties, and baseline methodology. RECOMMENDED NEXT STEPS FOR BATTERY DEVELOPER: (1) Call Tampa Electric Energy Experts at 813-275-3909 and ask explicitly: 'Do battery energy storage systems qualify as standby generators under this program?', (2) Request copies of Tariff Section 7.550 and Riders 3.200-3.202 with technology eligibility definitions, (3) Ask for historical event frequency and timing data to estimate annual revenue potential, (4) Confirm baseline calculation methodology and day-of adjustment availability, (5) Obtain written documentation of battery eligibility before including this program in any optimization models or financial projections. FINAL ASSESSMENT: This program is NOT SUITABLE for battery storage systems until explicit eligibility confirmation is obtained from Tampa Electric. For fossil fuel generator owners, program offers modest ($6.15/kW) compensation with low entry barrier (25 kW minimum) but limited public transparency on event frequency and performance requirements."
  }
}
