{
  "program_id": "CENTERPOINT-TX-LMP",
  "program_name": "Commercial Load Management Program",
  "program_type": "demand_response",
  "status": "active",
  "description": "CenterPoint Energy Houston Electric's Commercial Load Management Program is a demand response program where commercial customers curtail load when notified by the utility. The program operates year-round with two distinct periods (Summer: June 1 - November 30, Winter: December 1 - May 31). Participants receive up to $40.00 per kW of verified curtailed load, paid at the end of each program period. The program includes scheduled curtailment tests (1-3 hours each) and unscheduled curtailments (up to 4 hours each) with 30-minute advance notice. Notably, there are NO PENALTIES for opting out of events or for non-participation, making this a low-risk program. The program is designed to reduce peak demand in the CenterPoint Energy service territory in a cost-effective manner to meet demand savings goals established by the Texas Legislature and Public Utility Commission of Texas (PUCT).",
  "geography": {
    "states": ["TX"],
    "utilities": ["CenterPoint Energy Houston Electric"],
    "isos": ["ERCOT"],
    "service_territories": ["Houston Metropolitan Area", "Greater Houston"]
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "commercial_min_kw": 50,
      "size_threshold_notes": "Minimum load curtailment of 50 kW required. Non-residential, distribution, government, and non-profit customers eligible. Must be located within CenterPoint Energy Houston Electric service territory. Must have Interval Data Recorder (IDR) or Smart Meter installed."
    },
    "behind_the_meter": true,
    "front_of_meter": false,
    "minimum_capacity_kw": 50,
    "maximum_capacity_kw": null,
    "resource_types": [
      "Load curtailment",
      "Energy management systems",
      "Building automation",
      "HVAC control",
      "Battery storage (not explicitly mentioned but not prohibited)"
    ],
    "requires_aggregator": false
  },
  "notification": {
    "day_ahead_notice": false,
    "minimum_notice_hours": 0.5,
    "maximum_notice_hours": null,
    "notification_methods": [
      "Electronic notification (email/SMS assumed)",
      "30-minute advance notice for curtailment events"
    ]
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": 40.0,
      "unit": "$/kW-period",
      "varies_by_season": false,
      "seasonal_rates": [
        {
          "season": "Summer",
          "period": "June 1 - November 30",
          "rate": 40.0,
          "unit": "$/kW-period",
          "notes": "Up to $40.00 per kW of verified curtailed load for the 6-month summer period"
        },
        {
          "season": "Winter",
          "period": "December 1 - May 31",
          "rate": 40.0,
          "unit": "$/kW-period",
          "notes": "Up to $40.00 per kW of verified curtailed load for the 6-month winter period"
        }
      ]
    },
    "performance_rate": {
      "value": null,
      "unit": null,
      "varies_by_season": false,
      "varies_by_time": false,
      "seasonal_rates": [],
      "notes": "Payment is solely capacity-based on verified curtailed load. No separate performance or energy payments mentioned."
    },
    "penalty_structure": {
      "has_penalties": false,
      "penalty_rate": null,
      "penalty_unit": null,
      "penalty_description": "NO PENALTIES for opting out of tests/events or for non-participation. This is a key differentiator making the program very low-risk for participants."
    },
    "bonus_payments": [],
    "forward_curve_available": false,
    "forward_curve_url": null,
    "payment_timing": "Paid at end of each program period (semi-annually)"
  },
  "seasons": [
    {
      "season_name": "Summer",
      "start_date": "06-01",
      "end_date": "11-30",
      "notes": "6-month summer period with same payment structure as winter"
    },
    {
      "season_name": "Winter",
      "start_date": "12-01",
      "end_date": "05-31",
      "notes": "6-month winter period with same payment structure as summer"
    }
  ],
  "call_windows": [
    {
      "season": "Year-round",
      "days_of_week": ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"],
      "start_time": "00:00",
      "end_time": "23:59",
      "notes": "Program operates 24/7. Events can be called at any time with 30-minute notice. Historical load management programs in Texas typically focused on summer afternoons (1-7 PM weekdays), but this program appears to have year-round, any-time availability."
    }
  ],
  "event_parameters": {
    "typical_duration_hours": 2.0,
    "minimum_duration_hours": 1.0,
    "maximum_duration_hours": 4.0,
    "event_granularity_minutes": null,
    "response_time_minutes": 30,
    "max_events_per_season": null,
    "max_events_per_year": 6,
    "max_hours_per_season": null,
    "max_hours_per_year": null,
    "max_consecutive_events": null,
    "minimum_rest_hours": null,
    "notes": "Two scheduled curtailment tests (1-3 hours each) plus up to four unscheduled curtailments (up to 4 hours each) per year = total of 6 events annually. 30-minute notification before events."
  },
  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_frequency": "Semi-annual",
    "nomination_deadline": "Not specified",
    "allows_price_bidding": false,
    "bidding_structure": "Fixed payment rate of $40/kW. Participants commit to curtailment capacity.",
    "enrollment_period": {
      "start_date": null,
      "end_date": null,
      "recurring": true,
      "notes": "Ongoing enrollment available. Contact CNPEE@CenterPointEnergy.com for application."
    }
  },
  "special_programs": {
    "is_rec_based": false,
    "rec_type": null,
    "scheduled_dispatch": true,
    "clean_peak_standard": false,
    "special_attributes": [
      "No penalties for non-participation or opting out",
      "Requires Interval Data Recorder (IDR) or Smart Meter",
      "Year-round program with summer and winter periods",
      "24/7 availability for curtailment events",
      "Only 30-minute advance notice required",
      "Payment based on verified curtailed load",
      "Regulated by Texas PUCT",
      "Part of Texas legislative demand savings goals"
    ]
  },
  "program_history": {
    "launch_year": null,
    "program_evolution": [
      {
        "year": 2025,
        "change_description": "Program confirmed active as of October 2025 with $40/kW payment rate per period."
      }
    ],
    "budget_committed_through": null,
    "total_annual_budget": null,
    "notes": "Historical context: Texas load management programs traditionally focused on summer peak (June-Sept, 1-7 PM weekdays). CenterPoint program has expanded to year-round 24/7 operation."
  },
  "historical_events": [],
  "data_sources": [
    {
      "source_name": "CenterPoint Energy Commercial Load Management Program Page",
      "url": "https://www.centerpointenergy.com/en-us/SaveEnergyandMoney/Pages/Load-Management-.aspx?sa=ho&au=bus",
      "last_updated": "2025-10-12",
      "data_type": "program_rules",
      "notes": "Primary source for program details, payment rates, eligibility, and event parameters"
    },
    {
      "source_name": "Texas Efficiency - CenterPoint Energy Programs",
      "url": "https://texasefficiency.com/cnp/",
      "last_updated": "2025-10-12",
      "data_type": "program_overview",
      "notes": "General information about CenterPoint energy efficiency and demand response programs"
    },
    {
      "source_name": "ERCOT Demand Response Overview",
      "url": "https://www.pcienergysolutions.com/2024/07/31/ercot-demand-response-programs-enhancing-grid-reliability-in-texas/",
      "last_updated": "2024-07-31",
      "data_type": "market_context",
      "notes": "Context on ERCOT demand response programs and grid reliability"
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": true,
    "api_available": false,
    "api_documentation_url": null,
    "data_quality_score": 7,
    "last_verified_date": "2025-10-12",
    "notes": "Payment rate and basic program structure verified from official CenterPoint website. Some details missing: exact eligibility criteria for battery storage, specific event timing patterns, maximum annual hours, nomination deadlines. Data quality score of 7/10 reflects verified core information with some gaps in operational details. NO DATA WAS INVENTED - missing information left as null or not specified."
  },
  "ercot_wholesale_market_interaction": {
    "can_participate_in_both": "Not explicitly prohibited",
    "dual_participation_notes": "Program documentation does not explicitly address whether participants can simultaneously participate in ERCOT wholesale markets. In ERCOT, battery energy storage systems typically register as Generation Resources (for discharge) and Load Resources (for charge) and participate directly in Day-Ahead Market (DAM) and Real-Time Market (RTM). CenterPoint's program is a distribution-level utility program focused on load curtailment. Based on ERCOT market structure: (1) Behind-the-meter batteries serving customer load could participate in this utility DR program while also providing wholesale market services, but would need to ensure curtailment obligations are met. (2) Front-of-meter batteries registered with ERCOT would not typically participate in utility-level load management programs. (3) The lack of penalties for non-participation provides flexibility. (4) Customer should consult with CenterPoint Energy and their Qualified Scheduling Entity (QSE) to clarify dual participation rules.",
    "wholesale_market_priority": "ERCOT wholesale markets typically take priority for registered resources",
    "recommendation": "Contact CNPEE@CenterPointEnergy.com to clarify battery storage eligibility and dual participation rules before enrollment."
  },
  "battery_suitability": {
    "rating": "Good with Caveats",
    "technical_fit": {
      "score": "7/10",
      "justification": "Battery energy storage systems can provide load curtailment through several mechanisms: (1) Discharging to serve building load during events, reducing net grid consumption; (2) Shifting charging outside event windows; (3) Pre-charging before events to maximize discharge capability. The 30-minute notice period is VERY SHORT for battery dispatch optimization but manageable with automated systems. Only 6 events per year (2 tests + 4 operational) with 1-4 hour duration is very battery-friendly - low cycle count, low degradation impact. No penalties for non-participation reduces risk significantly."
    },
    "economic_fit": {
      "score": "5/10",
      "justification": "Payment structure analysis: $40/kW per 6-month period = $80/kW-year total. This is relatively LOW compared to other utility DR programs. For comparison: Con Edison CSRP offers $72-216/kW-year (location-based) + $1/kWh performance. However, low event frequency (only 6 events/year) and zero penalties make this a low-effort, low-risk revenue stream. Economics are MARGINAL as standalone program for battery justification but could be attractive as INCREMENTAL revenue stacked with ERCOT wholesale market participation (energy arbitrage, ancillary services). Main economic challenge: 30-minute notice may limit ability to optimize other revenue streams during events."
    },
    "regulatory_fit": {
      "score": "6/10",
      "justification": "Battery eligibility is NOT EXPLICITLY STATED in program documentation. Resource types listed focus on traditional load curtailment (HVAC, building systems). However, batteries are not explicitly prohibited. Key regulatory considerations: (1) Must have IDR or Smart Meter to measure curtailment - batteries behind customer meter would show as reduced load. (2) Located in CenterPoint service territory in ERCOT. (3) Unclear if batteries registered with ERCOT as Generation Resources can also participate in utility program. (4) Need clarification on 'verified curtailed load' measurement methodology for batteries. (5) No mention of dual participation restrictions with wholesale markets. CRITICAL: Contact CenterPoint (CNPEE@CenterPointEnergy.com) to confirm battery eligibility before pursuing."
    },
    "operational_fit": {
      "score": "8/10",
      "justification": "Very favorable operational characteristics: (1) Only 6 events per year = minimal operational burden. (2) NO PENALTIES for opting out or non-performance = can prioritize higher-value opportunities. (3) 30-minute notice is challenging but not impossible with automated dispatch systems. (4) 1-4 hour duration aligns well with typical battery discharge capabilities (2-4 hour systems). (5) Year-round program provides two payment cycles. (6) 24/7 event window creates some uncertainty for scheduling but low event frequency mitigates this. Main operational concern: Short notice period may conflict with day-ahead wholesale market positions."
    },
    "overall_justification": "Battery suitability rated 'Good with Caveats' (overall ~6.5/10) because: POSITIVE FACTORS: (1) Simple capacity payment structure, (2) Very low event frequency (6/year), (3) Zero penalties for non-participation, (4) Compatible event durations, (5) Year-round revenue opportunity. NEGATIVE FACTORS: (1) Relatively low payment rate ($80/kW-year), (2) Battery eligibility not explicitly confirmed, (3) Very short 30-minute notice period, (4) Unclear interaction with ERCOT wholesale market participation, (5) 24/7 event window creates dispatch uncertainty. RECOMMENDATION: This program is best viewed as INCREMENTAL revenue for batteries primarily participating in ERCOT wholesale markets (DAM/RTM energy arbitrage and ancillary services). The low payment rate does not justify standalone battery investment, but the low event frequency and zero penalties make it attractive as supplemental revenue IF dual participation is allowed. CRITICAL NEXT STEP: Confirm battery eligibility and dual participation rules with CenterPoint before enrollment.",
    "key_risks": [
      "Battery eligibility not explicitly confirmed in program documentation",
      "Relatively low payment rate ($80/kW-year total) may not justify participation complexity",
      "30-minute notice period may conflict with ERCOT day-ahead market positions",
      "Unclear if dual participation with ERCOT wholesale markets is allowed",
      "24/7 event window creates uncertainty for battery dispatch scheduling",
      "Methodology for measuring 'verified curtailed load' from battery discharge not specified"
    ],
    "key_opportunities": [
      "Zero penalties allow flexible opt-out if higher-value opportunities arise",
      "Only 6 events per year = minimal battery cycle usage and degradation",
      "Year-round program provides two payment cycles (summer and winter)",
      "Semi-annual payments provide cash flow throughout year",
      "Low event frequency makes program easy to operationalize",
      "Could stack with ERCOT wholesale market revenues if dual participation allowed",
      "Behind-the-meter configuration may qualify if serving building load"
    ],
    "comparison_to_ercot_wholesale": {
      "load_management_program": "$80/kW-year, 6 events, zero risk",
      "ercot_day_ahead_market": "$4,803/MW-year (2024 avg) = $4.80/kW-year energy arbitrage alone",
      "ercot_ancillary_services": "Highly variable, $50-200/kW-year depending on service type and market conditions",
      "ercot_real_time_arbitrage": "Additional revenue from RT price spikes",
      "conclusion": "ERCOT wholesale market participation is FAR MORE LUCRATIVE than utility load management program. However, the two could potentially be stacked if dual participation is allowed. Load management program would be <5% of total battery revenue in optimized ERCOT market operation."
    }
  },
  "research_summary": {
    "time_spent_minutes": 25,
    "key_finding": "CenterPoint Energy's Commercial Load Management Program is a low-frequency (6 events/year), low-risk (zero penalties), capacity-based ($40/kW per 6-month period) demand response program operating year-round with 30-minute advance notice. Payment rate totals $80/kW-year. Battery eligibility is NOT EXPLICITLY CONFIRMED in program documentation, though not explicitly prohibited either.",
    "data_integrity": "All payment rates, eligibility criteria, and program parameters extracted from official CenterPoint Energy website. NO DATA WAS INVENTED. Missing information (battery eligibility, dual participation rules, nomination deadlines, maximum annual hours) left as null or marked 'not specified' rather than inventing values. Original program URL was down (service interruption page), but alternative URL with program details was successfully accessed.",
    "program_classification": "Utility Distribution-Level Demand Response - Capacity Payment Model - Low Frequency",
    "recommendation_for_battery_optimization": "Battery participation is POTENTIALLY VIABLE but requires clarification. RECOMMENDED ACTIONS: (1) Contact CNPEE@CenterPointEnergy.com to confirm battery storage eligibility and methodology for measuring 'verified curtailed load'. (2) Clarify whether batteries registered with ERCOT can simultaneously participate. (3) Understand if behind-the-meter vs front-of-meter configuration matters. ECONOMIC ASSESSMENT: At $80/kW-year, this program provides MARGINAL standalone revenue but could be ATTRACTIVE as incremental revenue stacked with ERCOT wholesale market participation (DAM/RTM arbitrage + ancillary services). The low event frequency (6/year) and zero penalties make this very operationally friendly. PRIORITY LEVEL: MEDIUM - Pursue only after clarifying eligibility and dual participation rules. Do not rely on this program as primary revenue stream for battery justification in ERCOT - wholesale markets are far more lucrative.",
    "missing_information": [
      "Battery storage explicit eligibility confirmation",
      "Dual participation rules with ERCOT wholesale markets",
      "Methodology for measuring 'verified curtailed load' from battery systems",
      "Nomination deadlines and enrollment timeline",
      "Maximum hours per season/year",
      "Specific event timing patterns (historical data)",
      "Behind-the-meter vs front-of-meter eligibility differences",
      "Qualified Scheduling Entity (QSE) requirements for batteries",
      "Baseline calculation methodology for batteries"
    ],
    "verified_information": [
      "Payment rate: Up to $40/kW per 6-month period ($80/kW-year total)",
      "Minimum capacity: 50 kW curtailment",
      "Event frequency: 2 scheduled tests + 4 unscheduled events per year",
      "Event duration: 1-3 hours for tests, up to 4 hours for unscheduled",
      "Advance notice: 30 minutes",
      "Penalty structure: NONE - no penalties for opting out or non-participation",
      "Program seasons: Summer (June 1-Nov 30), Winter (Dec 1-May 31)",
      "Event window: 24/7 year-round availability",
      "Metering requirement: Interval Data Recorder (IDR) or Smart Meter",
      "Eligibility: Commercial, industrial, government, non-profit customers",
      "Service territory: CenterPoint Energy Houston Electric (ERCOT)",
      "Payment timing: End of each program period (semi-annual)",
      "Contact: CNPEE@CenterPointEnergy.com"
    ]
  }
}
