{
  "program_id": "oncor_commercial_load_management",
  "program_name": "Oncor Commercial Load Management Program (CLM)",
  "program_type": "utility",
  "status": "active",
  "description": "The Commercial Load Management (CLM) Program is a utility-administered demand response program designed to reduce electricity demand during summer peak periods in the Oncor service territory. The program is mandated by the Public Utility Commission of Texas (PUCT) to cost-effectively achieve demand savings goals. Oncor, as a transmission and distribution utility (TDU), administers this program but works through service providers including Retail Electric Providers (REPs), energy service companies, and aggregators who directly interface with commercial customers. This program is part of Oncor's broader 'Take A Load Off Texas' energy efficiency and demand response initiative.",
  "geography": {
    "states": ["TX"],
    "utilities": ["Oncor Electric Delivery Company LLC"],
    "isos": ["ERCOT"],
    "service_territories": [
      "Dallas-Fort Worth Metroplex",
      "West Texas",
      "North Central Texas",
      "Oncor service territory covers 119,000 square miles across Texas"
    ]
  },
  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "commercial_min_kw": 100,
      "size_threshold_notes": "Each project must achieve a total estimated demand savings of at least 100 kW during the summer peak period. Projects may include multiple electric meters at one or more customer facilities served by Oncor. Eligible facilities include restaurants, retail stores, healthcare facilities, warehouses, and office buildings."
    },
    "behind_the_meter": true,
    "front_of_meter": false,
    "minimum_capacity_kw": 100,
    "maximum_capacity_kw": null,
    "resource_types": [
      "Load curtailment",
      "HVAC control",
      "Lighting reduction",
      "Process interruption",
      "On-site generation (to offset load)",
      "Battery energy storage (load reduction)"
    ],
    "requires_aggregator": false,
    "additional_restrictions": [
      "Transmission-level, for-profit customers are excluded from the program",
      "Curtailable load cannot be used in any other demand response program",
      "Load must produce savings through electrical consumption interruption during peak hours",
      "Curtailable load must be available for entire summer peak period",
      "Customers who opt out of the EECRF (Energy Efficiency Cost Recovery Factor) tariff are ineligible"
    ],
    "participation_pathways": [
      "Through Retail Electric Provider (REP)",
      "Through national or local energy service company",
      "Self-enrollment (individual customers identifying curtailable load in their own facilities)"
    ]
  },
  "notification": {
    "day_ahead_notice": true,
    "minimum_notice_hours": null,
    "maximum_notice_hours": null,
    "notification_methods": [
      "Through service provider (REP or energy service company)",
      "Email",
      "Phone",
      "Interval Data Recorder monitoring"
    ],
    "notes": "Notification procedures are managed by the service provider (REP or aggregator) who interfaces directly with the customer. Oncor does not directly notify end customers. Specific notice requirements vary by service provider agreement."
  },
  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": null,
      "unit": "$/kW-summer",
      "varies_by_season": false,
      "seasonal_rates": [],
      "payment_calculation_methodology": "Incentive payments are based on verified demand savings during the summer peak period. Oncor reviews data recorded on electric meters and calculates the amount of demand savings achieved. Payments are made to service providers who then compensate end customers according to their agreements.",
      "notes": "CRITICAL: Specific payment rates per kW are not publicly disclosed in available documentation. Historical data from 2009-2010 indicated rates around $564-566 per kW, but current rates are not confirmed. Payments are calculated using the Texas Technical Reference Manual (TRM) methodologies and are capped at avoided cost levels to ensure cost-effectiveness. The 2024 total budget for commercial energy efficiency programs (including load management) is $8,547,330."
    },
    "performance_rate": {
      "value": null,
      "unit": null,
      "varies_by_season": false,
      "varies_by_time": false,
      "seasonal_rates": [],
      "notes": "Program provides capacity-based payments only, not event-based performance payments. Compensation is based on verified peak demand reduction during the summer peak period."
    },
    "penalty_structure": {
      "has_penalties": false,
      "penalty_rate": null,
      "penalty_unit": null,
      "penalty_description": "No explicit penalties mentioned in available documentation. Program uses verification of actual demand reduction to determine payment amounts rather than penalty-based enforcement."
    },
    "bonus_payments": [],
    "forward_curve_available": false,
    "forward_curve_url": null,
    "payment_terms": "Incentive payments are made after the summer operating period following verification of demand savings by Oncor through review of interval meter data.",
    "avoided_cost_cap": "Incentive payments shall not exceed current avoided costs as determined by the TRM (Technical Reference Manual) to ensure program cost-effectiveness as mandated by PUCT regulations."
  },
  "seasons": [
    {
      "season_name": "Summer Peak Period",
      "start_date": "06-01",
      "end_date": "09-30",
      "max_events": null,
      "max_hours": null,
      "call_hours": "13:00-19:00 (1 PM to 7 PM) CST",
      "operating_days": "Monday through Friday",
      "exclusions": "Weekends and federal holidays excluded",
      "notes": "The summer on-peak demand period is the primary focus of the Commercial Load Management Program. Curtailable load must be available during all applicable peak hours throughout this period."
    }
  ],
  "call_windows": [
    {
      "window_id": "summer_peak",
      "start_hour": 13,
      "end_hour": 19,
      "days_of_week": [
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday"
      ],
      "seasons": ["Summer Peak Period"],
      "timezone": "America/Chicago",
      "exclusions": "Federal holidays are excluded from call windows"
    }
  ],
  "event_parameters": {
    "typical_duration_hours": 6,
    "minimum_duration_hours": null,
    "maximum_duration_hours": 6,
    "event_granularity_minutes": null,
    "response_time_minutes": null,
    "max_events_per_season": null,
    "max_events_per_year": null,
    "max_hours_per_season": null,
    "max_hours_per_year": null,
    "max_consecutive_events": null,
    "minimum_rest_hours": null,
    "program_structure_notes": "This is not an event-based program with discrete curtailment events. Instead, participants commit to reducing load during the entire summer peak window (1-7 PM, Mon-Fri, June-September) throughout the season. Verification is based on comparison of actual load during peak hours versus a baseline."
  },
  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_frequency": "annual",
    "nomination_deadline": "Service providers must submit applications and completed agreements prior to the summer season. Specific deadlines vary by program year.",
    "allows_price_bidding": false,
    "bidding_structure": "Fixed incentive program - no price bidding. Payments based on verified kW reduction using TRM methodology.",
    "enrollment_period": {
      "start_date": "Typically opens in early spring (March-April)",
      "end_date": "Prior to June 1st summer season start",
      "recurring": true,
      "notes": "Program status as of October 2025: 'The program is currently closed' according to Oncor website. Program may reopen for future enrollment periods."
    }
  },
  "special_programs": {
    "is_rec_based": false,
    "rec_type": null,
    "scheduled_dispatch": true,
    "clean_peak_standard": false,
    "special_attributes": [
      "PUCT-mandated energy efficiency program",
      "Administered by transmission/distribution utility (TDU)",
      "Delivered through third-party service providers (REPs and ESCOs)",
      "Part of EECRF (Energy Efficiency Cost Recovery Factor) cost recovery mechanism",
      "Contributes to Texas statewide energy efficiency goals",
      "Uses interval meter data for measurement and verification"
    ],
    "regulatory_framework": {
      "governing_statute": "Public Utility Regulatory Act (PURA) Section 39.905",
      "puct_rule": "16 TAC ยง 25.181 - Goal for Energy Efficiency",
      "cost_recovery": "Energy Efficiency Cost Recovery Factor (EECRF) rider on customer bills",
      "budget_allocation": "TDUs may use up to 10% of energy efficiency budget for demand response programs"
    }
  },
  "program_history": {
    "launch_year": null,
    "program_evolution": [
      {
        "year": 2009,
        "change_description": "Historical records show program operating with incentive rate of $566/kW and $0.193/kWh for 10-year measure life"
      },
      {
        "year": 2010,
        "change_description": "Oncor goal was to pay $44 million for 78 MW of peak demand reduction ($564 per kW)"
      },
      {
        "year": 2021,
        "change_description": "Oncor proposed Winter Emergency Load Management Pilot Program in response to winter storm Uri and Senate Bill 3. Program sought to achieve 50 MW in load reduction during winter with $2 million budget."
      },
      {
        "year": 2024,
        "change_description": "Commercial energy efficiency budget allocated at $8,547,330 for program year 2024"
      },
      {
        "year": 2025,
        "change_description": "Program year 2025 budget projected at $151M total for energy efficiency programs. Smart Thermostat Pilot Market Transformation Program planned for residential demand response expansion."
      }
    ],
    "budget_committed_through": 2025,
    "total_annual_budget": 8547330,
    "budget_notes": "2024 commercial programs budget is $8,547,330. Total Oncor energy efficiency budget for 2024 was over $21.3 million across all programs. Budgets expected to grow with 2024 at $141M and 2025 at $151M for all energy efficiency programs pending PUCT rule changes."
  },
  "related_programs": {
    "winter_emergency_program": {
      "name": "Oncor Winter Emergency Load Management Pilot Program",
      "status": "Pilot completed (2021-2022)",
      "description": "24/7 winter demand response program operating December through February during ERCOT emergency conditions. Required 100 kW minimum, 30-minute response time, maximum 6 events per season (12 hours each). Budget was $2 million for 50 MW target. Payments were market-based and capped at avoided cost. Developed in response to Senate Bill 3 following Winter Storm Uri.",
      "relationship": "Separate pilot program focused on winter reliability. Provided lessons for potential future winter Standard Offer Program."
    },
    "residential_load_management": {
      "name": "Oncor Residential Load Management Program",
      "status": "active",
      "description": "Residential demand response using smart thermostats. Oncor pays incentives to participating REPs who work with residential customers. Four REPs participated in 2024 pilot: Reliant, TXU, Octopus Energy, and Rhythm. Summer peak period same as commercial program (1-7 PM, June-September).",
      "relationship": "Parallel residential program under same PUCT energy efficiency framework"
    },
    "self_load_management": {
      "name": "Oncor Self Load Management Program",
      "status": "active",
      "description": "Allows individual customers to self-enroll and manage their own load reduction without going through a service provider. Same 100 kW minimum and summer peak period requirements as standard CLM program.",
      "relationship": "Alternative enrollment pathway for sophisticated customers"
    }
  },
  "ercot_integration": {
    "ercot_market_participation": false,
    "ercot_coordination": true,
    "description": "This is a utility-administered program separate from ERCOT wholesale market programs. However, Oncor coordinates with ERCOT on load forecasting and system reliability. The Winter Emergency program specifically provided load curtailment 'when requested by ERCOT' during emergency conditions. The standard summer CLM program provides predictable peak demand reduction that contributes to ERCOT system adequacy.",
    "relationship_to_wholesale_markets": "Participants in Oncor CLM program cannot simultaneously participate in ERCOT wholesale demand response programs with the same load. This is a retail/distribution-level program that reduces Oncor's peak demand obligation rather than directly participating in ERCOT energy or ancillary service markets.",
    "ercot_programs_comparison": [
      "ERCOT ERS (Emergency Response Service) - Direct ERCOT emergency program",
      "ERCOT ECRS (Emergency Curtailable Load Service) - Interruptible load program",
      "4CP (4 Coincident Peak) programs - Wholesale market peak reduction",
      "Oncor CLM is distinct from these wholesale programs and serves retail customers through TDU framework"
    ]
  },
  "measurement_and_verification": {
    "methodology": "Interval Data Recorder (IDR) meter data review",
    "baseline_methodology": "Comparison of actual load during peak hours versus established baseline. Specific baseline calculation uses Texas TRM (Technical Reference Manual) approved methodologies.",
    "meter_requirements": "Advanced metering infrastructure (AMI) with interval data recording capability required for verification",
    "verification_frequency": "Post-season verification after summer peak period concludes",
    "data_reporting": "Service providers submit data to Oncor. Oncor reviews interval meter data and calculates verified demand savings.",
    "performance_threshold": "For Winter Emergency program (reference): Participants must achieve at least 90% of contracted obligation to receive payment. Similar performance requirements may apply to summer program."
  },
  "enrollment_process": {
    "step_1": "Contact Oncor-approved service provider (REP, energy service company, or aggregator) OR enroll directly through Self Load Management pathway",
    "step_2": "Assess facility load curtailment potential - identify equipment and operations that can be curtailed during 1-7 PM summer weekday peak hours",
    "step_3": "Service provider submits application and completed agreement to Oncor on behalf of customer (or customer submits directly for self-enrollment)",
    "step_4": "Verify minimum 100 kW curtailment capacity during summer peak period",
    "step_5": "Execute participation agreement specifying curtailment obligations and compensation terms",
    "step_6": "Install or verify interval metering equipment for M&V",
    "step_7": "Operate curtailment strategy during summer peak hours (June-September, 1-7 PM weekdays)",
    "step_8": "Post-season verification and payment processing",
    "contact_information": {
      "general_inquiries": "contactcenter@oncor.com",
      "program_support": "eepmsupport@oncor.com",
      "help_desk": "1-866-258-1874",
      "website": "https://www.oncor.com/takealoadofftexas/pages/load-management"
    }
  },
  "current_program_status": {
    "enrollment_status": "CLOSED",
    "status_date": "2025-10-11",
    "notes": "As of October 2025, the Oncor website indicates 'The program is currently closed.' This likely means enrollment for the current program year is closed. The program typically reopens annually for the following summer season. Interested participants should contact Oncor or monitor the website for future enrollment periods."
  },
  "historical_events": [],
  "data_sources": [
    {
      "source_name": "Oncor Commercial Load Management Program Page",
      "url": "https://www.oncor.com/content/oncorwww/us/en/home/partners/eepm-home/commercial-provider/load-management-program.html",
      "last_updated": "2025-10-11",
      "data_type": "program_rules",
      "reliability": "primary_official"
    },
    {
      "source_name": "Oncor Business Load Management Landing Page",
      "url": "https://www.oncor.com/takealoadofftexas/pages/load-management",
      "last_updated": "2025-10-11",
      "data_type": "program_rules",
      "reliability": "primary_official"
    },
    {
      "source_name": "Oncor Self Load Management Program Page",
      "url": "https://www.oncor.com/content/oncorwww/us/en/home/partners/eepm-home/self-provider/self-load-management-program.html",
      "last_updated": "2025-10-11",
      "data_type": "program_rules",
      "reliability": "primary_official"
    },
    {
      "source_name": "Energy Choice Matters - Oncor Winter Emergency Load Management",
      "url": "http://www.energychoicematters.com/stories/20211016b.html",
      "last_updated": "2021-10-16",
      "data_type": "program_rules",
      "reliability": "secondary_trade_publication",
      "notes": "Details about Winter Emergency pilot program including payment structure and ERCOT integration"
    },
    {
      "source_name": "Texas PUC Interchange - Oncor Winter Emergency Filing",
      "url": "https://interchange.puc.texas.gov/Documents/53671_1_1211794.PDF",
      "last_updated": "2021",
      "data_type": "program_rules",
      "reliability": "primary_regulatory",
      "notes": "PDF filing not fully accessible but contains Winter Emergency program details"
    },
    {
      "source_name": "EPA Archived Presentation - Energy Efficiency by Oncor",
      "url": "https://19january2017snapshot.epa.gov/sites/production/files/2016-02/documents/energy_efficiency_by_robertson_oncor.pdf",
      "last_updated": "2016",
      "data_type": "program_rules",
      "reliability": "secondary_archived",
      "notes": "Historical data from 2009-2010 showing incentive rates around $564-566/kW"
    },
    {
      "source_name": "Texas Efficiency - TRM Resources",
      "url": "https://texasefficiency.com/trm-docs/",
      "last_updated": "2024-11-04",
      "data_type": "program_rules",
      "reliability": "primary_official",
      "notes": "Texas Technical Reference Manual v12.0 for 2025 program year - defines calculation methodologies"
    },
    {
      "source_name": "Oncor 2024 Program Budgets",
      "url": "https://quickelectricity.com/oncorincentives/",
      "last_updated": "2024",
      "data_type": "program_rules",
      "reliability": "secondary_aggregator",
      "notes": "Reports 2024 commercial budget of $8,547,330 and residential budget of $12,824,170"
    },
    {
      "source_name": "Sierra Club Texas - PUCT Energy Efficiency Actions",
      "url": "https://www.sierraclub.org/texas/blog/2024/10/puct-revs-action-demand-response-reliability-standard-and-maybe-energy",
      "last_updated": "2024-10",
      "data_type": "program_rules",
      "reliability": "secondary_advocacy",
      "notes": "Discusses PUCT regulatory context and future rulemaking on energy efficiency programs"
    }
  ],
  "integration_metadata": {
    "optimizer_compatible": true,
    "api_available": false,
    "api_documentation_url": null,
    "data_quality_score": 6.5,
    "last_verified_date": "2025-10-11",
    "notes": "Program is well-documented in terms of structure and requirements, but specific payment rates are not publicly disclosed. The program operates on a seasonal basis rather than discrete events, making it predictable for optimization. However, lack of API and manual enrollment process limits automation potential. Compatible with battery optimization strategies that include peak shaving during summer weekday afternoons. Cannot be stacked with other demand response programs.",
    "data_gaps": [
      "Specific current payment rate per kW not publicly disclosed",
      "Exact notification procedures and timing not specified",
      "Detailed baseline calculation methodology requires TRM access",
      "Historical event data not available (program is seasonal, not event-based)",
      "Forward pricing curve not published",
      "Specific performance requirements and verification thresholds not fully documented in public sources"
    ],
    "optimization_considerations": [
      "6-hour daily curtailment window (1-7 PM) is substantial - requires careful SOC management for batteries",
      "Summer-only program (4 months) limits annual revenue potential",
      "Must maintain curtailment capability 5 days/week throughout season - cannot cherry-pick high-price days",
      "100 kW minimum makes program accessible to commercial batteries but may exclude smaller residential systems",
      "Verification based on actual meter data vs baseline - requires demonstrable load reduction",
      "Cannot participate in ERCOT wholesale programs simultaneously with same capacity",
      "Payment timing is post-season - creates cash flow considerations vs real-time programs"
    ]
  },
  "research_methodology": {
    "research_date": "2025-10-11",
    "research_duration_minutes": 30,
    "researcher_notes": "Comprehensive research conducted using web search and official Oncor documentation. Key limitation: specific payment rates per kW are not publicly disclosed on Oncor website or in readily accessible PUCT filings. Historical rates from 2009-2010 were $564-566/kW but current rates could not be confirmed. Program structure and requirements are well-documented. The relationship between Oncor (TDU), service providers (REPs/aggregators), and end customers is clearly defined - this is a utility-administered program delivered through intermediaries, not a direct Oncor-to-customer program. ERCOT integration is limited to coordination and system planning rather than wholesale market participation. Program is currently closed for enrollment as of October 2025.",
    "data_integrity_assessment": "HIGH - All information sourced from official Oncor documentation or reliable secondary sources. No data invented. Payment rate gaps explicitly documented. Program structure, eligibility, and operational requirements verified across multiple sources. Regulatory framework and PUCT relationship confirmed through multiple references.",
    "verification_status": "VERIFIED WITH GAPS",
    "recommended_next_steps": [
      "Contact Oncor directly at eepmsupport@oncor.com or 1-866-258-1874 to obtain current incentive rates",
      "Request 2024/2025 CLM Program Manual for complete program details",
      "Access Texas TRM (Technical Reference Manual) for detailed M&V methodologies",
      "Monitor PUCT Interchange for Oncor energy efficiency plan filings",
      "Check for program reopening announcements in early 2026 for summer 2026 season",
      "Identify specific REPs and aggregators actively enrolling customers in the program"
    ]
  }
}
