{
  "program_id": "ARIZONA-SMART-DEMAND-RESPONSE-(SMARTDR)-PROGRAM",
  "program_name": "Smart Demand Response (SmartDR) Program",
  "program_type": "utility",
  "status": "active",
  "research_completed_date": "2025-10-11",
  "data_quality_score": 4,
  "description": "Tucson Electric Power's Smart Demand Response (SmartDR) Program offers large commercial, industrial, and institutional customers the opportunity to reduce energy costs by reducing energy use at times of high demand or system constraints. Customers develop customized Energy Reduction Plans with TEP and receive quarterly bill credits based on their performance during load reduction events. The program provides flexibility with no penalties for opting out of individual events, though credits will be lower. No special equipment is required.",

  "geography": {
    "states": ["AZ"],
    "utilities": ["Tucson Electric Power"],
    "isos": [],
    "service_territories": ["TEP service area (Pima County and surrounding areas in Southern Arizona)"],
    "notes": "TEP is a subsidiary of UNS Energy Corporation, which is owned by Fortis Inc."
  },

  "eligibility": {
    "customer_classes": {
      "residential": false,
      "commercial": true,
      "industrial": true,
      "institutional": true,
      "size_threshold_notes": "Designed for larger commercial, industrial, and institutional customers"
    },
    "behind_the_meter": true,
    "front_of_meter": true,
    "minimum_capacity_kw": "not specified",
    "maximum_capacity_kw": "not available",
    "resource_types": [
      "load curtailment",
      "motors reduction",
      "refrigeration adjustment",
      "lighting reduction",
      "non-essential equipment shutdown",
      "HVAC modification",
      "other operational adjustments"
    ],
    "requires_aggregator": false,
    "aggregator_name": "not applicable",
    "notes": "Program allows both direct participation and aggregated participation. Customers can participate individually or through an aggregator. Piclo Energy has listed this program on their platform as a marketplace opportunity."
  },

  "notification": {
    "day_ahead_notice": "not specified",
    "minimum_notice_hours": "not specified",
    "maximum_notice_hours": "not available",
    "notification_methods": ["phone", "email"],
    "notification_notes": "TEP contacts program participants when the demand for energy is high and asks them to reduce usage according to their Energy Reduction Plan. Specific advance notice period not publicly disclosed. For comparison, TEP's Interruptible Service program provides 30-minute notice."
  },

  "payment_structure": {
    "has_capacity_payment": true,
    "has_performance_payment": false,
    "capacity_rate": {
      "value": "not available",
      "unit": "not available",
      "varies_by_season": "possibly",
      "seasonal_rates": [],
      "notes": "Program provides quarterly bill credits based on agreed curtailment and performance during events. Specific $/kW rates are not publicly disclosed. TEP's Interruptible Service program (a related but different program) offers $2.25/kW MVCP (Market Value Capacity Price) for comparison. SmartDR rates likely differ and may be customized per participant."
    },
    "performance_rate": {
      "value": "not available",
      "unit": "not available",
      "varies_by_season": false,
      "varies_by_time": false,
      "notes": "Program primarily offers quarterly bill credits rather than per-event performance payments. Credits are based on agreed curtailment capacity and actual performance during events."
    },
    "penalty_structure": {
      "has_penalties": false,
      "penalty_rate": "not applicable",
      "penalty_unit": "not applicable",
      "penalty_description": "No penalty or fee for opting out of demand response dispatches, but quarterly credit will be lower if customer does not respond to events."
    },
    "bonus_payments": [],
    "forward_curve_available": false,
    "forward_curve_url": "not available",
    "payment_notes": "Quarterly bill credits applied based on performance. No upfront costs. Customers can opt out of individual events without penalties, though this reduces their quarterly credit amount. Program is designed to be flexible and customer-friendly."
  },

  "seasons": [
    {
      "season_name": "Summer (Peak Season)",
      "start_date": "05-01",
      "end_date": "09-30",
      "max_events": "not specified",
      "max_hours": "not specified",
      "notes": "TEP defines summer as May through September. Events are most likely during this period due to high cooling demand in Arizona. TEP experienced peak demand records during summer heat waves."
    },
    {
      "season_name": "Winter (Off-Peak Season)",
      "start_date": "10-01",
      "end_date": "04-30",
      "max_events": "not specified",
      "max_hours": "not specified",
      "notes": "Events less common but possible during winter months. Program operates year-round but with primary focus on summer peaks."
    }
  ],

  "call_windows": [
    {
      "window_id": "typical_peak_hours",
      "start_hour": "not specified",
      "end_hour": "not specified",
      "days_of_week": ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"],
      "seasons": ["Year-round"],
      "timezone": "America/Phoenix",
      "notes": "Arizona does not observe Daylight Saving Time. Specific event call windows not publicly disclosed. Events typically occur during periods of high demand, which in Arizona are typically afternoon/early evening hours during summer heat."
    }
  ],

  "event_parameters": {
    "typical_duration_hours": "several",
    "minimum_duration_hours": "not specified",
    "maximum_duration_hours": "not specified",
    "event_granularity_minutes": "not available",
    "response_time_minutes": "not specified",
    "max_events_per_season": "not specified",
    "max_events_per_year": "not specified",
    "max_hours_per_season": "not specified",
    "max_hours_per_year": "not specified",
    "max_consecutive_events": "not available",
    "minimum_rest_hours": "not available",
    "notes": "Documentation indicates events typically last 'several hours'. Specific parameters not publicly disclosed. Events are called during high demand periods and system constraints."
  },

  "event_triggers": {
    "trigger_description": "Events are called when demand for power is high or when there are system constraints. In Arizona, this is primarily during extreme heat conditions in summer months when cooling loads drive peak demand. TEP experienced record-breaking peak demand during summer 2024 heat waves, highlighting the importance of demand response resources.",
    "primary_trigger": "high_demand_peak",
    "secondary_triggers": ["system_constraints", "extreme_weather", "high_temperature"],
    "temperature_threshold": "not available",
    "price_threshold": "not available",
    "examples": "In summer 2024, Arizona utilities (APS, TEP, SRP) broke peak demand records during extreme heat. TEP has called events during these conditions to maintain grid reliability."
  },

  "nomination_bidding": {
    "requires_nomination": true,
    "nomination_frequency": "not available",
    "nomination_deadline": "not available",
    "allows_price_bidding": false,
    "bidding_structure": "not applicable",
    "enrollment_period": {
      "start_date": "not available",
      "end_date": "not available",
      "recurring": "appears to be ongoing"
    },
    "notes": "Customers must enroll by contacting TEP's Commercial Energy Solutions department and developing an Energy Reduction Plan. Enrollment appears to be ongoing rather than limited to specific seasonal periods. Piclo Energy marketplace listed the program as 'inactive or no longer accepting new applicants' as of September 2025, but TEP's website still shows the program as active - status should be verified with TEP directly."
  },

  "special_programs": {
    "is_rec_based": false,
    "rec_type": "not applicable",
    "scheduled_dispatch": false,
    "clean_peak_standard": false,
    "special_attributes": [
      "No special equipment required",
      "Flexible Energy Reduction Plans customized to business needs",
      "No penalties for opting out of events",
      "Plans can be adjusted at any time",
      "Helps ensure grid reliability and energy affordability",
      "Can participate directly or through aggregator"
    ]
  },

  "program_history": {
    "launch_year": "not available",
    "program_evolution": [
      {
        "year": "not specified",
        "change_description": "Program established to provide demand response resources for TEP's system"
      }
    ],
    "budget_committed_through": "not available",
    "total_annual_budget": "not available",
    "notes": "Program history not well documented in public sources. TEP also offers related programs including Interruptible Service (minimum 3,000 kW demand, 1,000 kW curtailment) and residential programs like Smart Rewards and Energy Storage Rewards."
  },

  "historical_events": [
    {
      "event_id": "summer_2024_heat_wave",
      "event_date": "2024-08",
      "start_time": "not available",
      "end_time": "not available",
      "duration_hours": "not available",
      "season": "Summer",
      "notification_time": "not available",
      "advance_notice_hours": "not available",
      "call_window": "not available",
      "performance_payment_rate": "not available",
      "total_mw_called": "not available",
      "notes": "Arizona utilities (APS, TEP, SRP) broke peak demand records during extreme heat in summer 2024. Specific SmartDR event details not publicly available."
    }
  ],

  "case_studies": [],

  "related_programs": {
    "interruptible_service": {
      "program_name": "Interruptible Service",
      "description": "TEP's firm interruptible program for large commercial customers with higher capacity requirements",
      "minimum_capacity_kw": 3000,
      "minimum_curtailment_kw": 1000,
      "notification_minutes": 30,
      "season": "May through September typically",
      "payment_rate": "$2.25 per kW (Market Value Capacity Price)",
      "payment_type": "bill credits for months with interruptions",
      "enrollment_period": "March 15 - April 15 each program year",
      "equipment_requirements": "Customer responsible for communication, relay, and breaker equipment",
      "interruption_rights": "Can be interrupted at any time for any reason; customer waives claims for losses",
      "status": "active",
      "notes": "More stringent requirements than SmartDR but higher and more predictable payment rate. Good comparison point for SmartDR economics."
    },
    "smart_rewards": {
      "program_name": "Smart Rewards",
      "description": "Residential smart thermostat demand response program",
      "customer_class": "residential",
      "status": "active",
      "notes": "In summer 2024, Smart Rewards participants collectively saved enough energy across nine events to power equivalent of 2,300 homes"
    },
    "energy_storage_rewards": {
      "program_name": "Energy Storage Rewards",
      "description": "Residential battery storage demand response program",
      "customer_class": "residential",
      "status": "active"
    }
  },

  "verification_sources": [
    {
      "source_name": "TEP Smart Demand Response Program Page",
      "url": "https://www.tep.com/smart-demand-response/",
      "accessed_date": "2025-10-11",
      "document_type": "program webpage",
      "fields_verified": [
        "program_name",
        "eligible_customer_types",
        "program_description",
        "no_penalty_policy",
        "flexibility_features",
        "contact_information"
      ]
    },
    {
      "source_name": "TEP Interruptible Service Program Page",
      "url": "https://www.tep.com/interruptible-service/",
      "accessed_date": "2025-10-11",
      "document_type": "program webpage",
      "fields_verified": [
        "related_program_comparison",
        "payment_rate_reference",
        "notification_period_comparison",
        "enrollment_period_reference"
      ]
    },
    {
      "source_name": "Piclo Energy - TEP SmartDR Program Listing",
      "url": "https://www.piclo.com/opportunities/tep-smart-demand-response-smartdr",
      "accessed_date": "2025-10-11",
      "document_type": "marketplace listing",
      "fields_verified": [
        "participation_routes",
        "location_coverage",
        "program_status_note"
      ]
    },
    {
      "source_name": "DOE FEMP Western States DR Programs Database",
      "url": "https://www.energy.gov/eere/femp/demand-response-and-time-variable-pricing-programs-western-states",
      "accessed_date": "2025-10-11",
      "document_type": "government database",
      "fields_verified": [
        "program_existence",
        "basic_program_parameters"
      ]
    },
    {
      "source_name": "Utility Dive - Arizona Utilities Peak Demand Records",
      "url": "https://www.utilitydive.com/news/arizona-aps-tep-srp-peak-demand-record/757395/",
      "accessed_date": "2025-10-11",
      "document_type": "news article",
      "fields_verified": [
        "peak_demand_context",
        "summer_2024_grid_stress"
      ]
    }
  ],

  "data_gaps_and_limitations": {
    "missing_critical_data": [
      "Specific payment rates ($/kW-month or $/kW-quarter)",
      "Minimum capacity requirement (kW)",
      "Maximum capacity limits",
      "Advance notification period (hours or days)",
      "Event duration parameters (typical, min, max hours)",
      "Maximum events per season/year",
      "Maximum hours per season/year",
      "Specific call windows (time of day)",
      "Minimum rest hours between events",
      "Temperature or price thresholds for event triggers",
      "Enrollment deadlines and periods",
      "Nomination procedures",
      "Historical event log with dates/times",
      "Total program capacity (MW enrolled)",
      "Number of participants",
      "Performance requirements and measurement methodology"
    ],
    "data_not_publicly_available": [
      "Quarterly bill credit calculation methodology",
      "Payment rates - likely customized per participant based on capacity and performance commitments",
      "Detailed Energy Reduction Plan templates or requirements",
      "Measurement and verification procedures",
      "Baseline calculation methodology",
      "Individual participant performance data",
      "Complete historical event records",
      "Program evaluation reports or impact assessments",
      "Arizona Corporation Commission tariff filings for SmartDR"
    ],
    "verification_limitations": [
      "TEP's website provides only high-level program description",
      "No publicly available tariff sheets specifically for SmartDR program",
      "Payment rates not disclosed - requires direct contact with TEP",
      "Most operational details require enrollment to access",
      "Piclo Energy shows program as 'inactive' but TEP website shows active - conflicting information on current status",
      "No access to TEP's 2023 IRP PDF (file too large) which may contain detailed program information",
      "Arizona Corporation Commission docket system not searched for regulatory filings",
      "No case studies or participant testimonials publicly available"
    ]
  },

  "research_notes": "Conducted web research on TEP SmartDR program on 2025-10-11. Program is minimally documented in public sources with only basic information available on TEP's website. Key program parameters (payment rates, capacity requirements, event frequency/duration, notification periods) are not publicly disclosed. TEP's Interruptible Service program provides useful comparison point - it offers $2.25/kW MVCP with 30-minute notice, but has much higher thresholds (3,000 kW demand, 1,000 kW curtailment) and more stringent requirements (can be interrupted anytime, customer liable for equipment, waives damage claims). SmartDR appears designed as more flexible, lower-threshold alternative with no penalties and adjustable plans. Piclo Energy marketplace listed program but shows as 'inactive or no longer accepting new applicants' as of Sept 2025, while TEP's website still promotes the program - this conflict needs resolution. TEP experienced peak demand records in summer 2024, demonstrating ongoing need for DR resources. For complete program details, direct contact with TEP Commercial Energy Solutions (520-745-3425 or smartdr@tep.com) required. Overall data quality is poor due to lack of public documentation - suitable for general awareness but insufficient for detailed economic modeling or optimization without additional information gathering.",

  "integration_metadata": {
    "optimizer_compatible": "uncertain",
    "api_available": false,
    "api_documentation_url": "not available",
    "api_notes": "No evidence of API availability. Program appears to operate via manual notification (phone/email) and response.",
    "data_quality_score": 4,
    "last_verified_date": "2025-10-11",
    "verification_thoroughness": "Basic web research conducted including program webpage, related program pages, marketplace listings, news articles, and regulatory context. Limited by lack of public documentation. Did not access: ACC regulatory filings, TEP tariff sheets, IRP detailed analysis (file too large), direct contact with TEP.",
    "recommended_next_steps": [
      "Contact TEP Commercial Energy Solutions (520-745-3425, smartdr@tep.com) to request detailed program information including payment rates, capacity requirements, and enrollment materials",
      "Search Arizona Corporation Commission docket system for TEP SmartDR tariff filings and regulatory approvals",
      "Download and review TEP 2023 IRP (may need to request from TEP if PDF too large for web access)",
      "Request sample Energy Reduction Plan template to understand commitment requirements",
      "Clarify current program status - resolve conflict between Piclo (inactive) and TEP website (active)",
      "Request historical event log to understand actual call frequency and timing patterns",
      "Interview current or past participants if possible",
      "Compare economics vs TEP Interruptible Service to understand when SmartDR is advantageous",
      "Determine if program is compatible with battery energy storage systems or primarily load curtailment",
      "Request M&V procedures and baseline calculation methodology"
    ],
    "notes": "Program appears active and operational but is poorly documented publicly. The low data quality score (4/10) reflects significant gaps in critical information needed for economic analysis or system optimization. Main value proposition is flexibility and ease of participation compared to more stringent Interruptible Service program. No penalties for non-performance is attractive but suggests lower payment rates. Quarterly payment structure provides steady revenue but less responsive to individual event participation compared to per-event payments. Limited utility for battery optimization modeling without additional data gathering. TEP's service territory is not part of an ISO/RTO, operating as traditional vertically integrated utility, which may limit transparency vs ISO markets. Arizona's extreme summer heat (peak demand records in 2024) creates strong value proposition for DR resources."
  }
}
