{
  "program_id": "NEW-YORK-COMMERCIAL-SYSTEM-RELIEF-PROGRAM",
  "program_name": "Commercial System Relief Program",
  "utility": "Con Edison",
  "state": "New York",
  "iso_rto_territory": "NYISO",
  "program_type": "utility",
  "status": "active_but_closed_to_new_enrollment_annually",
  "payment_structure": {
    "capacity_payment": {
      "rate": "$6-$18/kW-month (location-based)",
      "rate_details": {
        "tier_1_networks": "$6/kW-month (Staten Island, Westchester)",
        "tier_2_networks": "$18/kW-month (Brooklyn, Bronx, Manhattan, Queens)"
      },
      "billing_frequency": "monthly",
      "bonus_payment": "$5.00/kW-month bonus if 5 or more events are called per season"
    },
    "performance_payment": {
      "rate": "$1.00/kWh",
      "conditions": "During event hours for actual load reduction below baseline"
    },
    "bill_credit": {
      "rate": "not applicable",
      "structure": "direct payments, not bill credits"
    }
  },
  "event_parameters": {
    "notification_time": "21 hours for planned events; minimum 2 hours for unplanned events (voluntary participation)",
    "event_duration": "4 hours",
    "event_window": "11:00 AM to 11:00 PM (varies by network)",
    "max_events_per_season": "not specified (bonus payment threshold is 5+ events)",
    "max_hours_per_season": "not specified",
    "seasons": [
      {
        "name": "Summer Capability Period",
        "start_date": "May 1",
        "end_date": "September 30",
        "applicable_days": "weekdays only (excluding federal holidays)"
      }
    ],
    "trigger_conditions": "Forecasted peak demand reaches 92% of overall summer peak demand forecast or temperature variables"
  },
  "eligibility": {
    "customer_classes": [
      "commercial",
      "industrial"
    ],
    "minimum_load": "50 kW (minimum for direct participant single account or aggregator total)",
    "minimum_reduction": "100 kW mentioned in marketing materials",
    "excluded_customers": [],
    "metering_requirements": "Communicating interval meter with 15-minute interval data; real-time access required",
    "enrollment_options": [
      "Direct enrollment",
      "Through aggregator",
      "Reservation option (committed)",
      "Voluntary option (non-committed)"
    ]
  },
  "baseline_methodology": "Customer Baseline Load (CBL): Average of top 5 days out of last 10 eligible weekdays. Customers can choose between Average Day CBL or Weather-Adjusted CBL. Event Final Adjustment Factor applied to hourly CBL values. Federal holidays excluded from CBL calculation. Customers using generators for load relief cannot use weather-adjusted methodology.",
  "battery_suitability": {
    "rating": "Excellent",
    "justification": "CSRP is highly suitable for battery energy storage systems with excellent economics. Location-based capacity payments of $6-$18/kW-month plus $1/kWh performance payments provide strong revenue streams. The 21-hour advance notice for planned events allows optimal battery dispatch planning. 4-hour event duration aligns well with typical BESS capabilities (1-4 hour systems). Summer-only season (May-Sept) matches peak arbitrage opportunities. Program explicitly allows battery participation with specific requirements: must be NYC-approved, requires communicating interval meter with 15-minute data, and remote inverter telemetry access. Can stack with DLRP (Distribution Load Relief Program) for additional revenue. Tier 2 networks (Brooklyn, Bronx, Manhattan, Queens) offer $18/kW-month = $216/kW-year capacity payment alone, plus performance payments. For a 1MW/4MWh system in Tier 2, capacity revenue alone would be $216,000/year. With typical 5-10 events per summer at 4 hours each, performance payments could add $20,000-$40,000 (assuming $1/kWh × 4 MWh × 5-10 events). Minimum 50 kW enrollment is easily met by most utility-scale BESS. CBL methodology based on historical consumption works well for batteries with predictable charging patterns."
  },
  "enrollment_details": {
    "enrollment_deadlines": [
      {
        "deadline": "April 1",
        "capability_period_start": "May 1"
      },
      {
        "deadline": "May 1",
        "capability_period_start": "June 1"
      }
    ],
    "enrollment_frequency": "Annual",
    "current_enrollment_status": "Program runs annually; closes to new enrollment after deadlines; reopens each year",
    "enrollment_process": "Direct enrollment with Con Edison or through qualified aggregator; voluntary customers can enroll after deadlines"
  },
  "network_details": {
    "total_networks": "82 networks throughout Con Edison service territory (as of 2025)",
    "network_tiers": {
      "tier_1": {
        "payment_rate": "$6/kW-month",
        "locations": "Staten Island, Westchester, and other lower-constraint networks"
      },
      "tier_2": {
        "payment_rate": "$18/kW-month",
        "locations": "Brooklyn, Bronx, Manhattan, Queens, Park Slope, Richmond Hill (added 2025)"
      }
    },
    "recent_changes_2025": "Randall's Island network merged with West Bronx network; Park Slope and Richmond Hill upgraded to Tier 2; Riverdale and Southeast Bronx reverted to Tier 1"
  },
  "program_performance": {
    "2023_enrollment": "437 MW",
    "2024_enrollment": "466.20 MW",
    "2023_average_reduction": "363 MW",
    "2024_average_reduction": "326.68 MW"
  },
  "concurrent_participation": {
    "allowed_programs": [
      "DLRP (Distribution Load Relief Program)",
      "One program from Peak Shaving group (CSRP or TERM-DLM)",
      "One program from Reliability group (DLRP or AUTO-DLM)"
    ],
    "restrictions": "Each customer can participate in Reservation OR Voluntary option per program, not both"
  },
  "battery_specific_requirements": {
    "eligible_technologies": [
      "Battery energy storage systems approved for NYC use by all relevant authorities"
    ],
    "excluded_technologies": [
      "Thermal energy storage systems",
      "Zinc storage systems",
      "Vehicle-to-grid technologies"
    ],
    "telemetry_requirements": "Real-time access to 15-minute interval data; remote access to inverter telemetry required",
    "metering": "Smart meter with communicating capabilities"
  },
  "penalties_and_compliance": {
    "reservation_option": "Committed participation with potential penalties for non-performance",
    "voluntary_option": "No commitment required; no penalties for non-participation",
    "unplanned_events": "Voluntary participation (less than 21 hours notice)"
  },
  "data_sources": [
    "https://www.coned.com/en/save-money/rebates-incentives-tax-credits/rebates-incentives-tax-credits-for-commercial-industrial-buildings-customers/smart-usage-rewards",
    "https://www.piclo.com/opportunities/con-edison-commercial-system-relief-program",
    "Con Edison Demand Response (Rider T) Program Guidelines 2025 Capability Period",
    "CPower Energy NYISO CSRP-ConEd Snapshot 2025",
    "Con Edison Customer Baseline Load Procedure documentation",
    "Web search results: Con Edison CSRP program status 2024-2025"
  ],
  "research_notes": "Program is ACTIVE and ongoing, not closed or terminated. The 'closed_to_new' designation in the original database is misleading - the program accepts new enrollment annually with deadlines of April 1 or May 1 depending on desired start date. Enrollment reopens every year. The program has grown from 437 MW in 2023 to 466.20 MW in 2024, showing healthy participation growth. The program is part of Con Edison's Rider T demand response portfolio and operates under New York Public Service Commission oversight. Battery energy storage systems are explicitly eligible and supported with specific technical requirements. The program offers excellent economics for BESS operators, especially in Tier 2 networks (Brooklyn, Bronx, Manhattan, Queens) with $18/kW-month capacity payments. Third-party aggregators like CPower Energy, Enel North America, and others actively aggregate BESS into this program. The program can be stacked with DLRP for additional revenue opportunities. Con Edison has been making ongoing improvements including network reconfigurations and tier adjustments to better target constrained areas. The 21-hour advance notice for planned events is particularly valuable for battery operators to optimize dispatch schedules and avoid conflicts with other revenue streams (arbitrage, frequency regulation, etc.). Event duration of 4 hours aligns perfectly with typical 4-hour duration BESS systems deployed for utility-scale applications.",
  "research_date": "2025-10-11",
  "research_quality_score": 9,
  "research_quality_notes": "Comprehensive information obtained from multiple authoritative sources including Con Edison official website, third-party aggregator documentation, and recent program performance data. Only minor gaps: exact maximum number of events per season not explicitly stated (though bonus threshold of 5+ events provides context); detailed penalty structure for Reservation option not fully documented; specific network-by-network call windows not detailed. All critical information for battery operator decision-making is present including payment rates, event parameters, eligibility requirements, baseline methodology, and battery-specific technical requirements. Program status definitively confirmed as active with annual enrollment cycles."
}
